/*
Navicat MySQL Data Transfer

Source Server         : bd
Source Server Version : 50726
Source Host           : localhost:3306
Source Database       : zpwcce

Target Server Type    : MYSQL
Target Server Version : 50726
File Encoding         : 65001

Date: 2025-05-22 17:52:36
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for zp_admin
-- ----------------------------
DROP TABLE IF EXISTS `zp_admin`;
CREATE TABLE `zp_admin` (
    `id` tinyint(4) NOT NULL AUTO_INCREMENT COMMENT '管理员ID',
    `admin_id` int(10) unsigned DEFAULT '0' COMMENT '所属上级代理ID',
    `group_id` tinyint(5) unsigned DEFAULT '0' COMMENT '所属用户组ID',
    `username` varchar(20) NOT NULL COMMENT '管理员用户名',
    `mobile` varchar(11) DEFAULT NULL COMMENT '电话号码',
    `email` varchar(30) DEFAULT NULL COMMENT '邮箱',
    `password` varchar(32) NOT NULL COMMENT '管理员密码',
    `salt` varchar(6) DEFAULT NULL COMMENT '盐值',
    `token` varchar(50) DEFAULT NULL COMMENT 'token',
    `avatar` varchar(200) DEFAULT NULL COMMENT '头像地址',
    `qrcode` varchar(128) DEFAULT NULL COMMENT '微信二维码',
    `wechat` varchar(64) DEFAULT NULL COMMENT '微信号',
    `realname` varchar(10) DEFAULT NULL COMMENT '真实姓名',
    `balance` decimal(16,4) unsigned DEFAULT '0.0000' COMMENT '账户余额',
    `min_cash` decimal(11,2) unsigned DEFAULT '100.00' COMMENT '最低提现',
    `min_take` decimal(11,2) unsigned DEFAULT '5.00' COMMENT '最低抽成比例，5.00%',
    `min_pub` decimal(11,2) unsigned DEFAULT '0.00' COMMENT '资源最低发布金额',
    `dis_pub` decimal(11,2) unsigned DEFAULT '0.00' COMMENT '资源最低发布原价',
    `cash_fee` decimal(11,2) unsigned DEFAULT '10.00' COMMENT '提现手续费比例,10%',
    `auto_spread` tinyint(1) unsigned DEFAULT '1' COMMENT '是否自动推广:1手动，2自动',
    `kammi_type` tinyint(1) unsigned DEFAULT '0' COMMENT '卡密权限类型，0禁止，1创建',
    `is_ad` tinyint(1) unsigned NOT NULL DEFAULT '1' COMMENT '是否开启广告，1开启',
    `take_num` int(10) unsigned DEFAULT '5' COMMENT '扣量间隔，5表示，每5次扣一次，相当于20%',
    `exp_time` int(10) unsigned DEFAULT '0' COMMENT '过期时间',
    `short_id` int(11) unsigned DEFAULT '1' COMMENT '短链接通道ID',
    `check_id` int(11) unsigned DEFAULT '0' COMMENT '检测通道ID',
    `entry_url` varchar(128) DEFAULT NULL COMMENT '防封入口（主要是微信）',
    `view_id` int(10) unsigned DEFAULT '0' COMMENT '默认模板ID-首页布局ID',
    `loginfail` int(10) unsigned DEFAULT '0' COMMENT '登录失败次数',
    `master_token` varchar(64) DEFAULT NULL COMMENT '主资源库接口TOKEN',
    `api_token` varchar(100) DEFAULT NULL COMMENT '资源市场token',
    `logtime` int(10) unsigned DEFAULT '0' COMMENT '登录时间',
    `logip` varchar(20) DEFAULT NULL COMMENT '登录IP',
    `status` tinyint(2) unsigned DEFAULT '1' COMMENT '审核状态,1正常，0禁用',
    `ctime` int(11) unsigned DEFAULT '0' COMMENT '添加时间',
    PRIMARY KEY (`id`),
    UNIQUE KEY `idx_username` (`username`) USING BTREE,
    KEY `idx_balace` (`id`,`balance`) USING BTREE,
    KEY `idx_use` (`id`),
    KEY `idx_group_id` (`group_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='管理员表';

-- ----------------------------
-- Table structure for zp_admin_bill
-- ----------------------------
DROP TABLE IF EXISTS `zp_admin_bill`;
CREATE TABLE `zp_admin_bill` (
     `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
     `type` tinyint(3) unsigned DEFAULT '0' COMMENT '类型，1资源收益，2VIP收益，3分成，4扣量',
     `mode` tinyint(1) unsigned NOT NULL DEFAULT '0' COMMENT '模式，1：增加，2：减少',
     `before` decimal(12,2) unsigned NOT NULL DEFAULT '0.00' COMMENT '操作前余额',
     `money` decimal(12,2) unsigned NOT NULL DEFAULT '0.00' COMMENT '金额',
     `after` decimal(12,2) unsigned NOT NULL DEFAULT '0.00' COMMENT '操作后余额',
     `remark` varchar(200) DEFAULT NULL COMMENT '备注',
     `order_id` int(10) unsigned DEFAULT '0' COMMENT '业务ID',
     `uid` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '用户ID',
     `ctime` int(10) unsigned DEFAULT '0' COMMENT '创建时间',
     PRIMARY KEY (`id`),
     KEY `idx_user` (`uid`),
     KEY `idx_type` (`type`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COMMENT='余额操作日志';

-- ----------------------------
-- Table structure for zp_admin_log
-- ----------------------------
DROP TABLE IF EXISTS `zp_admin_log`;
CREATE TABLE `zp_admin_log` (
    `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
    `content` text COLLATE utf8mb4_unicode_ci,
    `remark` varchar(50) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '操作描述',
    `url` varchar(256) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '访问路径',
    `ua` varchar(256) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '浏览器特征',
    `ip` varchar(20) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '操作IP',
    `uid` int(10) unsigned DEFAULT '0' COMMENT '操作员ID',
    `ctime` int(11) unsigned DEFAULT '0' COMMENT '记录时间',
    PRIMARY KEY (`id`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='系统日志表';

-- ----------------------------
-- Table structure for zp_admin_site
-- ----------------------------
DROP TABLE IF EXISTS `zp_admin_site`;
CREATE TABLE `zp_admin_site` (
     `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
     `admin_id` int(10) unsigned DEFAULT '0' COMMENT '代理ID',
     `webname` varchar(64) DEFAULT NULL COMMENT '站点名称',
     `is_ssl` tinyint(3) unsigned DEFAULT '0' COMMENT '是否配置了SSL，1为是',
     `sub_type` tinyint(2) unsigned DEFAULT '0' COMMENT '域名类型，0，二级域名，1一级域名',
     `domain` varchar(64) DEFAULT NULL COMMENT '一级域名',
     `sub_prefix` varchar(32) DEFAULT NULL COMMENT '二级域名前缀',
     `base_domain` varchar(48) DEFAULT NULL COMMENT '二级根域名',
     `entry_url` varchar(256) DEFAULT NULL COMMENT '防封链接入口',
     `wechat` varchar(48) DEFAULT NULL COMMENT '微信号',
     `qrcode` varchar(128) DEFAULT NULL COMMENT '二维码',
     `realname` varchar(32) DEFAULT NULL COMMENT '联系人',
     `mobile` varchar(48) DEFAULT NULL COMMENT '联系电话',
     `utime` int(10) unsigned DEFAULT '0' COMMENT '联系时间',
     `ctime` int(10) unsigned DEFAULT '0',
     PRIMARY KEY (`id`),
     UNIQUE KEY `idx_admin_id` (`admin_id`) USING BTREE,
     KEY `idx_sub` (`domain`,`sub_prefix`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;


-- ----------------------------
-- Table structure for zp_adv
-- ----------------------------
DROP TABLE IF EXISTS `zp_adv`;
CREATE TABLE `zp_adv` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `sort` tinyint(3) unsigned DEFAULT '0' COMMENT '渠道类型，0:微信小程序，1:抖音小程序，2:app，3:百度小程序',
  `name` varchar(255) DEFAULT NULL COMMENT '广告位名称',
  `advid` varchar(255) DEFAULT NULL COMMENT '广告位ID',
  `status` tinyint(4) DEFAULT '1' COMMENT '1启用2禁用',
  `type` tinyint(4) DEFAULT '1' COMMENT '广告类型  1:banner,2:激励,3:插屏,4:视频,5:格子,6:封面,7:原生模板',
  `ctime` int(11) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COMMENT='广告';


-- ----------------------------
-- Table structure for zp_adv_set
-- ----------------------------
DROP TABLE IF EXISTS `zp_adv_set`;
CREATE TABLE `zp_adv_set` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `sort` tinyint(3) unsigned DEFAULT '0' COMMENT '渠道类型，0:微信小程序，1:抖音小程序，2:app，3:百度小程序',
  `aid` int(11) DEFAULT NULL COMMENT 'advID',
  `type` tinyint(4) DEFAULT NULL COMMENT '广告类型',
  `adsense` tinyint(4) DEFAULT '1' COMMENT '1:首页,2:资源页,3:收藏页,4:个人中心,5:我的资源,6:我的人脉',
  `ctime` int(11) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COMMENT='广告位置';

-- ----------------------------
-- Table structure for zp_article
-- ----------------------------
DROP TABLE IF EXISTS `zp_article`;
CREATE TABLE `zp_article` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `sort_id` int(10) unsigned DEFAULT '0' COMMENT '资讯类型',
  `title` varchar(100) DEFAULT NULL COMMENT '标题中文',
  `thumb` varchar(150) DEFAULT NULL,
  `content` text COMMENT '内容',
  `is_out` tinyint(3) unsigned DEFAULT '0' COMMENT '是否站外，1站外，0站内',
  `is_top` tinyint(1) unsigned DEFAULT '0' COMMENT '是否置顶，1置顶，0不置顶',
  `links` varchar(480) DEFAULT NULL COMMENT '站外链接',
  `views` int(255) unsigned DEFAULT '0' COMMENT '浏览次数',
  `admin_id` int(10) unsigned DEFAULT '0' COMMENT '发布人ID',
  `status` tinyint(3) unsigned DEFAULT '0' COMMENT '状态，1启用，0禁用',
  `ctime` int(10) unsigned DEFAULT '0' COMMENT '创建时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COMMENT='文章列表';

-- ----------------------------
-- Records of zp_article
-- ----------------------------
INSERT INTO `zp_article` VALUES ('1', '1', '学习网络创业，选择智创云享', '', '<p>学习网络创业，选择<a href=\"/pages/resource/resource?id=84\" target=\"_self\">智创云享</a></p>', '0', '0', null, '19', '0', '1', '0');
INSERT INTO `zp_article` VALUES ('2', '4', '用户隐私保护协议', '', '<p>为使用【某某】（以下简称“本网站”）及服务，请用户务必审慎阅读、充分理解各条款内容，特别是免除或者限制责任的条款，以及开通或使用某项服务的单独协议，并选择接受或不接受。限制、免责条款可能以加粗形式提示注意。</p><p>除非用户已阅读并接受本协议所有条款，否则用户无权下载或使用本网站相关服务。用户的下载、使用、登录等行为即视为已阅读并同意上述的约束。</p><p>1.本协议的范围</p><p>1.1 本协议适用主体范围： 本协议是您作为用户，与【某某】有限公司（以下简称“【某某】”或“本公司”）之间关于下载、使用本网站，以及使用【某某】相关服务所订立的协议。</p><p>1.2 协议关系及冲突条款 本协议被视为《服务协议》的补充协议，是其不可分割的组成部分，与其构成统一整体。本协议与上述内容存在冲突的，以本协议为准。本协议内容同时包括【某某】可能不断发布的关于本服务的相关协议、业务规则等内容。上述内容一经正式发布，即为本协议不可分割的组成部分，用户同样应当遵守。</p><p>2. 关于本服务</p><p>2.1 本服务的内容 本服务内容是指【某某】通过互联网向用户提供的本网站信息使用权，同时为用户提供本网站内容的阅读、下载和在线咨询服务。用户通过官网任意入口，即可全面访问本网站的文章、视频、电子书以及直播课等信息，从而进一步提高用户的职业技能和职业经验，有效降低企业的人力资源成本，提高业务。（以下简称“本服务”）（以下简称“本服务”）</p><p>2.2 本服务的形式</p><p>2.2.1 用户使用本网站需要登陆、注册、填写其他表单，就本网站，【某某】给予用户一项不可转让及非排他性的许可。用户仅可为访问或使用本网站的目的而使用这些内容及服务。</p><p>2.2.2 本服务中软件提供包括但不限于移动端和PC端等多个应用版本，用户应选择与所使用环境相相匹配的网站版本。</p><p>2.3 本服务的范围</p><p>2.3.1 本条及本协议其他条款未明示授权的其他一切权利仍由【某某】保留，用户在行使这些权利时须另外取得【某某】的书面许可。【某某】如果未行使前述任何权利，并不构成对该权利的放弃。</p><p>2.3.2 如果用户停止使用本网站，或服务被终止或取消，本公司可以从服务器上地删除您的数据。服务停止、终止或取消后，本公司没有义务向用户返还任何数据。</p><p>3. 资料的获取</p><p>3.1 用户可以直接从【某某】的网站上获取资料。</p><p>3.2 如果用户从未经【某某】授权的第三方获取本网站或与本网站名称相同的资料，【某某】无法保证该资料内容正确，并对因此给用户造成的损失不予负责。</p><p>4. 资料的下载</p><p>4.1 【某某】可能为不同的用户提供不同的内容展现形式，用户应当根据实际情况选择下载或阅读合适的资料。</p><p>4.2 下载资料后，用户应按照相应类型的资料选择程序打开阅读。</p><p>4.3 为提供加优质、安全的服务，在本网站打开时【某某】可能推荐用户安装其他版本浏览器，用户可以选择安装或不安装。</p><p>5. 官网的更新</p><p>5.1 为了改善用户体验、完善服务内容，【某某】将不断努力开发新的服务，并为用户不时提供本网站的新（这些新可能会采取替换、修改、功能强化、版本升级等形式）。</p><p>5.2 为了保证本网站及服务的安全性和功能的一致性，【某某】有权不经向用户特别通知而对本网站进行新，或者对本网站的部分功能效果进行改变或限制。</p><p>5.3 本网站新版本发布后，本公司将可能视情况设定一定期限的过渡期，以方便用户使用新版本。过渡期结束后，旧版本的官网可能无法使用。【某某】不保证旧版本网站继续可用及相应的客户服务，请核对并使用新版本。</p><p>6. 隐私声明</p><p>6.1 用户信息收集</p><p>6.1.1 用户在注册帐号或使用本网站的过程中，需要提供一些必要的信息，例如：真实姓名、地址、籍、企业名称、行业、规模、职位、所在部门、电话号码和电子邮件地址等。上述信息视为您的身份识别信息，本公司用这些信息来管理您的账户，并为您提供一系列服务的访问。本公司也可能利用这些信息来通知您新的产品新和市场活动。您可以在本公司取得账户信息及密码登录本公司并查看账户设置和您的信息，并可查看和修改您的个人信息。</p><p>6.1.2 您只能通过您的密码来使用您的帐号。如果您泄漏了密码，您可能丢失了您的个人识别信息，并且可能出现对您不利的后果。因此，无论任何原因危及您的密码安全，您应该通过本公司预留的联系方式和本公司取得联系</p><p>6.1.3 您成功注册后，本公司将收集您的官网浏览行为，作为您的身份识别信息的一部分，本公司用这些信息可能为您提供一系列的服务，以方便您好的使用本网站。</p><p>6.1.4 本公司还可能收集并存储以下数据：您在本网站中的标识符、经度和纬度、性别、年龄、用户触发的事件、错误和页面浏览量，还可能包含您终用户的IP地址、设备类型、地区等信息。</p><p>6.2 用户信息的披露和使用</p><p>6.2.1 本公司将使用本公司通过你对本网站的行为收集来的信息为您提供加深入的支持与服务。</p><p>6.2.2 本公司不会向任何无关第三方提供，出售，出租，分享和交易用户的个人信息，但为方便您使用本公司服务，本公司将对您及（或）您的公司的身份和交易数据进行综合统计，本公司不会披露任何可能用以识别用户的个人身份的资料，但从用户的用户名或其它可披露资料分析得出的资料不受此限。</p><p>6.2.3 您同意本公司可披露或使用您的个人信息以用于识别和（或）确认您的身份，或解决争议，或有助于确保网站安全，限制欺诈、非法或其他刑事犯罪活动。</p><p>6.2.4 您同意本公司可披露或使用您的个人信息以保护您的生命、财产之安全或为防止严重侵害他人之合法权益或为公共利益之需要。</p><p>6.2.5 您同意本公司可披露或使用您的个人信息以改进本公司的服务，并使本公司的服务能符合您的要求，从而使您在使用本公司服务时得到好的使用体验。</p><p>6.2.6 您同意本公司利用您的个人信息与您联络，并向您提供您可能感兴趣的信息，如：介绍、推销产品、服务、促销优惠或者商业投资机会的商业性短信息等，您接受本条款中的隐私声明即为明示同意收取这些信息。</p><p>6.2.7 当本公司被法律强制或依照政府或依权利人因识别涉嫌侵权行为人的要求而提供您的信息时，本公司将善意地披露您的资料。</p><p>6.2.8 当本公司需要保护本公司、本公司的代理人、客户、用户和其他人的权益和财产，包括执行本公司的协议、政策和使用条款时，本公司将善意的披露您的资料。</p><p>6.2.9 您同意如果本公司拟进行企业并购、重组、出售全部或部分股份和/或资产时，本公司有权在与前述交易的相关方签署保密协议的前提下向其披露您的资料以协助本公司完成该等交易。</p><p>6.2.10 您在此同意，在您使用本网站期间，本公司可以在对您的原始数据、进行信息脱密处理的情况下，将该等信息用于制作及发布行业分析报告、行业交流等非营利性用途。</p><p>6.3 用户信息的存储和交换</p><p>6.3.1 本公司所收集的用户信息将保存在本公司的服务器或本公司的合作产品提供商的服务器上。本公司将根据本条款中的隐私声明保存收集的用户信息，除非适用法律要求或允许保存长时间，本公司将在本条款中的隐私声明规定的目的实现后的合理期限内删除本公司所收集的用户信息。之后，如果为本条款中的隐私声明规定的目的不再需要，本公司可能在合理时间内完全删除本公司所保存的用户信息。本公司不去核实试用用户信息是否正确。尽管有上述规定，本公司仍可能保存某些解决争议、满足技术和法律要求和维护本公司的服务的安全完整运行所需的试用用户信息。</p><p>6.4 用户信息安全</p><p>6.4.1 本公司有相应的安全措施来确保本网站收集的用户信息不丢失，不被滥用和变造。这些安全措施包括但不限于向其它服务器备份数据和对用户密码加密。尽管本公司有这些安全措施，但请注意在因特网上不存在“完善的安全措施”，因此用户信息可能非因本公司的原因而丢失，包括但不限于他人非法利用用户资料，用户下载安装的其他软件或访问的其他网站中可能含有病毒、木马程序或其他恶意程序，威胁用户的终端设备信息和数据安全，继而影响本网站的正常使用等。对此，本公司不承担任何责任。</p><p>6.5 用户对本软件分析结果的使用</p><p>6.5.1 用户在此无条件同意，用户在免费使用本公司提供的服务期间，本条款中的隐私声明项下的信息及对该等信息的分析结果的所有权由本公司与用户共同拥有。本公司建议，用户应当以符合相关法律规定和道德义务的方式使用该等信息。同时，本公司提醒注意，因包括但不限于技术原因、网络传输质量等原因，导致本公司对本公司收集的信息的分析结果可能存在不准确的情况，对于该等不准确所导致的问题或者损失，本公司不承担任何责任。如果您接受本条款中的隐私声明并把本公司提供给您的信息、资料集成到您的网站或者应用中，您已经同意并向本公司保证您所有的终用户同意本公司收集、使用并分析其信息，并且遵守本条款中的隐私声明的全部规定。</p><p>6.5.2 您在此进一步保证，您不会因为本公司按照本声明的规定收集、使用、分析、披露收集的信息及对该等信息的分析结果而对本公司产生任何形式的诉求、投诉等。如果您因本条款中的隐私声明项下的对其的信息的收集、使用、披露或者对该等信息的分析以及您对分析结果的使用和处分而致使本公司遭受任何形式的诉求以及投诉等，您将负责全面给予解决；如果导致本公司发生任何形式的损失，您将负责给予本公司赔偿。</p><p>7. 用户行为规范</p><p>7.1 本网站使用规范。除非法律允许或本公司书面许可，用户使用本网站过程中不得从事下列行为：</p><p>7.1.1 删除本网站关于著作权的信息；</p><p>7.1.2 对本网站进行反向工程、反向汇编、反向编译，或者以其他方式尝试发现本软件的源代码；</p><p>7.1.3 对本公司拥有知识产权的内容进行使用、出租、出借、复制、修改、链接、转载、汇编、发表、出版、建立镜像站点等；</p><p>7.1.4 对本网站或者本网站运行过程中释放到任何终端内存中的数据、软件运行过程中客户端与服务器端的交互数据，以及本软件运行所必需的系统数据，进行复制、修改、增加、删除、挂接运行或创作任何衍生作品，形式包括但不限于使用插件、外挂或非经本公司授权的第三方工具/服务接入本软件和相关系统；</p><p>7.1.5 通过修改或伪造软件运行中的指令、数据，增加、删减、变动软件的功能或运行效果，或者将用于上述用途的软件、方法进行运营或向公众传播，无论这些行为是否为商业目的；</p><p>7.1.6 通过非本公司开发、授权的第三方软件、插件、外挂、系统，登录或使用本公司软件及服务，或制作、发布、传播上述工具；</p><p>7.1.7 自行或者授权他人、第三方软件对本软件及其组件、模块、数据进行干扰；</p><p>7.2 用户理解并同意，基于用户体验或相关服务平台运营安全、平台规则要求及健康发展等综合因素，针对以下情形，本公司有权视具体情况中止或终止提供本服务，包括但不限于：</p><p>7.2.1 违反法律法规或本协议规定的；</p><p>7.2.2 影响服务体验的；</p><p>7.2.3 存在安全隐患的。</p><p>7.3 违约处理</p><p>7.3.1 如果本公司发现或收到他人举报或投诉您违反本协议约定的，本公司有权视行为情节对您处以包括但不限于警告、限制或禁止使用部分或全部功能、帐号封禁直至注销的处罚。</p><p>7.3.2 您理解并同意，本公司有权依合理判断对违反有关法律法规或本协议规定的行为进行处罚，对违法违规的任何用户采取适当的法律行动，并依据法律法规保存有关信息向有关部门报告等，您应独自承担由此而产生的一切法律责任。</p><p>7.3.3 您理解并同意，因您违反本协议或相关服务条款的规定，导致或产生第三方主张的任何索赔、要求或损失，用户应当独立承担责任；本公司因此遭受损失的，您也应当一并赔偿。</p><p>8. 知识产权声明</p><p>8.1 【某某】是本网站的知识产权权利人。本网站的一切著作权、商标权、专利权、商业秘密等知识产权，均受中华人民共和法律法规和相应的际条约保护，本公司享有上述知识产权，但相关权利人依照法律规定和本条款应享有的权利除外。</p><p>8.2 未经本公司或相关权利人书面同意，用户不得为任何商业或非商业目的自行或许可任何第三方实施、利用、转让上述知识产权。</p><p>9. 第三方软件或技术</p><p>9.1 本网站可能会使用第三方软件或技术（包括本软件可能使用的开源代码和公共领域代码等，下同），这种使用已经获得合法授权。</p><p>9.2 本网站如果使用了第三方的软件或技术，本公司将按照相关法规或约定，对相关的协议或其他文件，可能通过本协议附件、在本网站进行展示，它们可能会以“软件使用许可协议”、“授权协议”、“开源代码许可证”或其他形式来表达。前述通过各种形式展现的相关协议、其他文件及网页，均是本协议不可分割的组成部分，与本协议具有同等的法律效力，您应当遵守这些要求。如果您没有遵守这些要求，该第三方或者家机关可能会对您提起诉讼、罚款或采取其他制裁措施，并要求本公司给予协助，您对此应当自行承担法律责任。</p><p>9.3 如因本网站使用的第三方软件或技术引发的任何纠纷，应由该第三方负责解决，本公司不承担任何责任。本公司不对第三方软件或技术提供客服支持，若用户需要获取支持，请与第三方联系。</p><p>10. 其他</p><p>10.1 用户使用本网站即视为您已阅读并同意受本协议的约束。本公司有权在必要时修改本协议条款。用户可以在本软件的新版本中查阅相关协议条款。本协议条款变后，如果用户继续使用本网站，即视为用户已接受修改后的协议。如果用户不接受修改后的协议，应当停止使用本软件。</p><p>10.2 本协议签订地为中华人民共和北京市。</p><p>10.3 本协议的成立、生效、履行、解释及纠纷解决，适用中华人民共和大陆地区法律（不包括冲突法）。</p><p>10.4 若用户和【某某】之间发生任何纠纷或争议，应友好协商解决；协商不成的，用户同意将纠纷或争议提交本协议签订地有管辖权的人民法院管辖。</p><p>10.5 本协议所有条款的标题仅为阅读方便，本身并无实际涵义，不能作为本协议涵义解释的依据。</p><p>10. 本协议条款无论因何种原因部分无效或不可执行，其余条款仍有效，对双方具有约束力。（正文完）</p><p><br/></p>', '0', '1', null, '7', '1', '1', '1649304485');
INSERT INTO `zp_article` VALUES ('3', '4', '用户注册服务协议', '', '<p style=\"margin: 0px; padding: 0px; font-size: 14px; color: rgb(255, 0, 0); font-family: arial; white-space: normal; background-color: rgb(248, 248, 248);\">前言</p><p>本《用户注册服务协议》协议（以下简称“本协议”）是由您（以下称为“用户”）与【某某】有限公司（以下称为“某某”）就【某某】在其和／或其关联公司所提供的产品和服务（包括【某某】拥有的小程序以及【某某】现在正在提供和将来可能向用户提供的服务，以下统称为“产品和服务”）所订立的协议。</p><p>如果用户进入【某某】的用户注册页面，确认已经阅读、同意本协议的条款并完成注册，或者通过其他任何方式获得和使用【某某】所提供的产品和服务，则视为用户已经详细阅读了本协议的内容，同意遵守本协议的约定。用户不应再以不了解本协议内容为由拒绝履行本协议。因此，为保障用户的权益，请于注册使用【某某】所提供的各种产品和服务之前，仔细阅读本协议全文。此外，依据本协议第十六条，【某某】有权不时对本协议进行修改与更新，请用户留意查看本协议的最新版本。</p><p style=\"margin: 0px; padding: 0px; font-size: 14px; color: rgb(255, 0, 0); font-family: arial; white-space: normal; background-color: rgb(248, 248, 248);\">一、服务内容</p><p>1.&nbsp;【某某】小程序和服务的具体内容由【某某】根据实际情况提供。【某某】保留随时变更、中断或终止部分或全部产品和服务的权利。</p><p>2.&nbsp;【某某】在提供小程序服务时，可能会对部分用户收取一定的费用。在此情况下，相关页面上会有明确的提示。如用户不同意支付该等费用，可选择不接受相应的产品和服务。</p><p>3.&nbsp;【某某】通过服务器端设备接入互联网为用户提供产品和服务，除此之外与产品和服务有关的设备（如电脑、调制解调器及其他与接入互联网有关的装置）及所需的费用（如为接入互联网而支付的电话费及上网费）均应由用户自行负担。</p><p>4.&nbsp;用户应使用正版软件接受产品和服务，软件费用由用户自行负担。</p><p style=\"margin: 0px; padding: 0px; font-size: 14px; color: rgb(255, 0, 0); font-family: arial; white-space: normal; background-color: rgb(248, 248, 248);\">二、帐号名称和密码</p><p>1.&nbsp;用户阅读并同意本协议，成功完成注册后，即成为【某某】的注册用户，取得【某某】用户帐号（以下称“【某某】通行证”）。【某某】通行证名称在注册之后不可变更，而帐号对应的密码则可以通过【某某】提供的客户服务进行修改。</p><p>2.&nbsp;用户对于【某某】通行证的保管以及使用该帐号和密码所进行的一切行为负有完全的责任。禁止将【某某】通行证销售、转让或出借、共享给他人使用。因为用户的保管疏忽或任何第三方行为，导致用户的【某某】通行证遭他人非法使用，以及因此而产生的任何后果，【某某】均不承担任何责任。</p><p>3.&nbsp;用户发现其【某某】通行证被他人非法使用或有使用异常情况的，应及时根据【某某】不时公布的处理方式通知【某某】，并有权请求【某某】采取措施暂停该帐号的登录和使用。【某某】根据用户身份核对结果，决定是否暂停用户帐号的登录和使用。用户应提供与其注册身份信息相一致的个人有效身份信息，用户没有提供其个人有效身份证件或者用户提供的个人有效身份证件与所注册的身份信息不一致的，【某某】有权拒绝用户上述请求。【某某】核实用户所提供的个人有效身份信息与所注册的身份信息相一致的，会及时采取措施暂停用户账号的登录和使用。</p><p style=\"margin: 0px; padding: 0px; font-size: 14px; color: rgb(255, 0, 0); font-family: arial; white-space: normal; background-color: rgb(248, 248, 248);\">三、帐号注册信息</p><p>1.&nbsp;提供注册信息</p><p>（1）在申请【某某】通行证时（或注册后补充信息时），用户应当向【某某】提供最新、详细及真实准确的个人注册信息。前述个人注册信息包括：用户的【某某】通行证名称、密码、微信昵称、手机号码等。用户在此承诺：用户以其真实身份注册成为【某某】的用户，并保证所提供的个人身份资料信息真实、完整、有效，依据法律规定和必备条款约定对所提供的信息承担相应的法律责任。</p><p>（2）所有由用户提供的个人注册信息将可能被【某某】用来作为认定【某某】通行证的关联性以及辨别用户身份的依据。用户同意应【某某】的要求，随时提供该等信息的证明材料，以便【某某】核实用户身份。</p><p>（3）如果用户提供给【某某】的信息不准确，或不真实，或不合法有效，或已变更而未及时更新，或有任何误导之嫌，【某某】有权中止对该用户提供全部或部分服务；【某某】采取中止措施会通知到用户并告知中止期间，中止期间届满【某某】会恢复对该用户的服务。【某某】有权审查乙方注册所提供的身份信息是否真实、有效，并应积极地采取技术与管理等合理措施保障用户帐号的安全、有效；用户有义务妥善保管其帐号及密码，并正确、安全地使用其帐号及密码。任何一方未尽上述义务导致帐号密码遗失、帐号被盗等情形而给对方或他人的权利造成损害的，应当承担由此产生的法律责任。</p><p>2.&nbsp;用户同意，与其【某某】通行证相关的一切资料、数据和记录（包括但不限于登录记录、登录后行为记录、点卡信息等）均以【某某】系统记录的数据为准。</p><p style=\"margin: 0px; padding: 0px; font-size: 14px; color: rgb(255, 0, 0); font-family: arial; white-space: normal; background-color: rgb(248, 248, 248);\">四、信息披露与保护</p><p>1.&nbsp;本协议第三条所描述的注册信息，以及用户在使用产品和服务时存储在【某某】控制范围内的非公开信息（以下合称“用户信息”），应按照本条约定进行披露及保护。</p><p>2.&nbsp;为了向用户提供更好的产品和服务，在用户自愿选择使用【某某】的产品和服务的情况下，或者明示同意提供信息的情况下，【某某】可能会收集用户信息，并可能对这些信息进行分析和整合。在用户使用【某某】的产品和服务时，服务器可能会自动记录部分用户信息，这些信息都将成为【某某】商业秘密的一部分。</p><p>3.&nbsp;保护用户（特别是未成年人用户）的隐私是【某某】的一项基本原则。【某某】一贯积极地采取技术与管理等方面的合理措施保障用户信息的安全、保密。</p><p>4.&nbsp;&nbsp;除本协议第四条第4款所列五项情形之外，【某某】保证不对外公开或向第三方披露、提供用户信息。五项除外情形如下：</p><p>（1）用户或者用户的监护人授权【某某】披露的；</p><p>（2）有关法律法规、监管机构规章或自律组织规则要求【某某】披露用户信息；</p><p>（3）司法机关或行政机关基于法定程序要求【某某】提供的；</p><p>（4）【某某】为了维护自己合法权益而向用户提起诉讼或者仲裁时；</p><p>（5）应用户监护人的合法要求而提供用户个人身份信息时。</p><p>5.&nbsp;为了向用户正常地提供产品和服务，【某某】可能需要向【某某】的技术服务商、【某某】的关联公司或其他第三方传送部分用户信息，在这些第三方承诺其将承担至少与【某某】同等的保密义务的前提下，【某某】将向这些第三方传送用户信息，用户对此予以理解和同意。</p><p>6.&nbsp;用户为了维护其合法权益，向【某某】提供与所注册的身份信息相一致的个人有效身份信息时，【某某】会为用户提供账号注册人证明、原始注册信息等必要的协助和支持，并根据需要向有关行政机关和司法机关提供相关证据信息资料。</p><p>7.&nbsp;在不透露单个用户隐私资料的前提下，【某某】有权对整个用户信息数据库进行技术分析并对已进行分析、整理后的用户数据库进行商业上的利用。</p><p>8.&nbsp;&nbsp;【某某】将采取商业上合理可行的方式保护用户的个人信息的安全。【某某】使用通常可以获得的安全技术和程序来保护用户的个人信息不被未经授权地访问、使用或泄漏。对于非因【某某】的故意及重大过失而造成用户帐号的丢失或用户个人信息的泄密，【某某】不承担任何责任。</p><p style=\"margin: 0px; padding: 0px; font-size: 14px; color: rgb(255, 0, 0); font-family: arial; white-space: normal; background-color: rgb(248, 248, 248);\">五、用户的基本权利</p><p>1.&nbsp;用户可以自愿选择通过手机绑定第三方登录提供的页面，从而在第一时间获得【某某】提供的服务、活动、优惠信息等内容。</p><p>3.&nbsp;用户有权在使用【某某】提供的产品和服务期间监督【某某】及【某某】的工作人员是否按照【某某】所公布的标准向用户提供产品和服务，也可以随时向【某某】提出与产品和服务有关的意见和建议。</p><p>4.&nbsp;如果用户不同意本协议条款，或对【某某】后来修改、更新的条款有异议，或对【某某】所提供的产品和服务不满意，用户可以随时选择停止使用【某某】的产品和服务。如果用户选择停止使用【某某】的产品和服务，【某某】不再对用户承担任何义务和责任。</p><p style=\"margin: 0px; padding: 0px; font-size: 14px; color: rgb(255, 0, 0); font-family: arial; white-space: normal; background-color: rgb(248, 248, 248);\">六、用户行为守则</p><p>1.&nbsp;用户同意按照包括本协议在内的、【某某】不时发布或变更的各类规则规范自己的行为，从而接受并使用【某某】的产品和服务。用户对登录后其所持帐号产生的行为依法享有权利和承担责任。用户进一步同意，在违反这些规则时，按照本协议第六条第13款、第14款、第十四条及其他相关条款的规定承担违规后果和违约责任。</p><p>2.&nbsp;用户在使用【某某】通行证期间，须遵守与互联网信息发布相关的法律、法规及通常适用的互联网一般道德和礼仪的规范，用户将自行承担其所发布的信息内容的责任。用户发布的各类信息，不得包含以下内容：</p><p>（1）违背宪法所确定的基本原则的；</p><p>（2）危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；</p><p>（3）损害国家荣誉和利益的；</p><p>（4）煽动民族仇恨、民族歧视，破坏民族团结的；</p><p>（5）破坏国家宗教政策，宣扬邪教和封建迷信的；</p><p>（6）散布谣言，扰乱社会秩序，破坏社会稳定的；</p><p>（7）传播淫秽、色情、赌博、暴力、凶杀、恐怖信息或者教唆犯罪的；</p><p>（8）侮辱、诽谤或恶意用言语攻击他人，侵害他人合法权益的；</p><p>（9）侵犯任何第三者的知识产权，版权或公众／私人权利的；</p><p>（10）违反人文道德、风俗习惯的；</p><p>（11）破坏游戏正常秩序的；</p><p>（12）含有法律、行政法规禁止的其他内容的。</p><p>3.&nbsp;用户的【某某】通行证名称及游戏中的人物、帮派等名称应当遵守合法、健康的原则，不允许使用包括但不限于涉及种族、宗教、政治、国家领导人、淫秽、低俗、诽谤、恐吓、欺诈性的、攻击性的、污辱性的、可能引起误会的、违禁药品等内容的名称。</p><p>4.&nbsp;用户应当对自己在游戏中的言行负责，尤其不得：</p><p>（1）通过任何方式、行为散布或传播低俗、不雅信息；</p><p>（2）通过任何方式、行为冒充平台向其他用户散布或传播虚假信息；</p><p>（3）通过任何方式或途径引起纷争；</p><p>（4）通过任何方式、行为散布或传播、使用私服、木马、外挂、病毒及此类信息；</p><p>（5）通过任何方式、行为传播或进行除【某某】提供的交易途径之外的资源、课程、文档等线下交易；</p><p>（6）泄露其它用户、非用户或【某某】平台员工的任何信息；</p><p>（7）宣传或发布违法信息、违反社会公德的信息，或不利于精神文明建设的信息，包括但不限于色情、赌博、邪教、恐怖主义等内容；</p><p>（8）其他不符合法律法规、社会公德或游戏规则的言论或行为。</p><p>5.&nbsp;用户不得干扰、阻碍【某某】正常地提供产品和服务，尤其不得：</p><p>（1）攻击、侵入【某某】的网站服务器或使网站服务器过载；</p><p>（2）破解、修改【某某】提供的客户端程序；</p><p>（3）不合理地干扰或阻碍他人使用【某某】所提供的产品和服务；</p><p>（4）利用程序的漏洞和错误（Bug）破坏网站的正常进行或传播该漏洞或错误（Bug）；</p><p>（5）直接或间接利用网站Bug（包括系统、程序、设定等方面存在的漏洞或不合理的现象）、程序漏洞获利或扰乱秩序，或者利用Bug、漏洞达到个人目的；</p><p>（6）不得修改客户端程序，使之改变或者新增或者减少【某某】平台所预先设定的功能，或者导致客户端向服务器发送的数据出现异常的一切行为。</p><p>10.&nbsp;用户不得利用【某某】提供的产品和服务从事以下活动：</p><p>（1）未经允许，进入计算机信息网络或者使用计算机信息网络资源的；</p><p>（2）未经允许，对计算机信息网络功能进行删除、修改或者增加的；</p><p>（3）未经允许，对进入计算机信息网络中存储、处理或者传输的数据和应用程序进行删除、修改或者增加的；</p><p>（4）故意制作、传播计算机病毒等破坏性程序的；</p><p>（5）其他危害计算机信息网络安全的行为。</p><p>11.&nbsp;如果【某某】发现用户行为或者数据异常，可以观察及记录该用户行为，并以观察和记录的结果作为判断用户是否实施了违反本协议用户行为守则的依据。 【某某】积极保护用户的账号、虚拟货币的安全，为此，【某某】对盗号及盗号相关行为展开严厉的打击。【某某】发现或者怀疑存在包括但不限于以下的盗号及盗号相关行为时，有权视情况按照本协议第六条第13款、第14款、第十四条及其他相关条款的规定处理，同时，【某某】保留进一步追诉的权利：</p><p>（1）盗取账号；</p><p>（2）盗取虚拟物品；</p><p>（3）盗取虚拟货币；</p><p>（4）盗取账号或/及密码；</p><p>（5）异常IP下的物品转移；</p><p>（6）其他盗号及盗号相关行为。</p><p>12.&nbsp;若用户实施违反本条所述用户行为守则的行为，【某某】有权视行为严重程度，向该用户施加以下一项或若干项违规后果，该用户应承担该等不利后果：</p><p>（1）警告：警告是针对轻微违反本协议而做出的教育导向，它是用于正常管理运行的一种方式。</p><p>（2）封停帐号：暂停或永久终止违规用户使用【某某】通行证登录【某某】小程序和网站的权利。</p><p>（3）删除帐号：永久终止违规用户通过【某某】通行证登录【某某】平台的权利，包括但不限于用户注册信息等平台数据库中的全部数据都将被永久封禁。</p><p>（4）封禁IP：暂时或永久禁止违规用户在某一异常IP登录某款游戏的某个服务器。</p><p>（5）承担法律责任：违规用户的不当行为对他人或者【某某】造成损害，或者与现行法律规定相违背的，违规用户应依法承担相应的民事、行政和／或刑事责任，例如，用户在进行使用过程中侵犯第三方知识产权或其他权利而导致被权利人索赔的，由用户直接承担责任。</p><p>13．若用户实施违反本条所述用户行为守则的行为，【某某】还有权要求违规用户向【某某】承担违约责任，包括但不限于恢复原状，消除影响，对给【某某】造成的直接及间接损失或额外的成本支出进行赔偿，以及在【某某】首先承担了因违规用户行为导致的行政处罚或侵权损害赔偿责任后，由【某某】向违规用户追偿。</p><p style=\"margin: 0px; padding: 0px; font-size: 14px; color: rgb(255, 0, 0); font-family: arial; white-space: normal; background-color: rgb(248, 248, 248);\"></p><p style=\"margin: 0px; padding: 0px; font-size: 14px; color: rgb(255, 0, 0); font-family: arial; white-space: normal; background-color: rgb(248, 248, 248);\">七、服务中断或终止</p><p>1.&nbsp;如发生下列任何一种情形，【某某】有权随时中断或终止向用户提供本协议项下的服务和其他网络服务，对于因而产生的不便和损失，【某某】不承担任何责任：</p><p>（1）用户提供的个人资料不真实；</p><p>（2）用户违反本协议中规定的用户行为准则。</p><p>2.&nbsp;为了保障平台网站和服务器的正常运行，【某某】需要定期或不定期对游网站和服务器进行停机维护，或针对突发事件进行紧急停机维护。因上述情况而造成的正常服务中断、中止，用户予以理解并同意，【某某】则有义务尽力避免服务中断并将中断时间限制在最短时间内。</p><p>3.&nbsp;发生下列情形之一时，【某某】有权不经提前通知，终止或中断服务器所提供之全部或部分服务，对因此而产生的不便或损失，【某某】对用户或第三人均不承担任何责任：</p><p>（1）定期检查或施工，更新软硬件等；</p><p>（2）服务器遭受损害，无法正常运作；</p><p>（3）突发性的软硬件设备与电子通信设备故障；</p><p>（4）网络提供商线路或其他故障；</p><p>（5）在紧急情况之下依照法律的规定或为用户及第三者之人身安全；</p><p>（6）第三方原因或其他不可抗力的情形。</p><p>6.&nbsp;不管产品和服务由于任何原因终止，用户应采取相应的措施自行处理平台上的虚拟物品。用户不得因终止服务而要求【某某】承担除用户已经购买但尚未使用的虚拟货币以外任何形式的赔偿或补偿责任，包括但不限于因不再能继续使用帐号、虚拟物品等而要求的赔偿。</p><p style=\"margin: 0px; padding: 0px; font-size: 14px; color: rgb(255, 0, 0); font-family: arial; white-space: normal; background-color: rgb(248, 248, 248);\">八、有限保证及免责声明</p><p>1.&nbsp;对于【某某】的产品和服务，【某某】仅作本条所述有限保证，该有限保证取代任何文档、包装、或其他资料中的任何其他明示或默示的保证（若有）。</p><p>2.&nbsp;【某某】仅以“现有状况且包含所有错误”的形式提供相关的产品、软件或程序及任何支持服务，并仅保证：</p><p>（1）【某某】所提供的产品和服务能基本符合【某某】正式公布的要求；</p><p>（2）【某某】所提供的相关产品和服务基本与【某某】正式公布的服务承诺相符；</p><p>（3）【某某】仅在商业上允许的合理范围内尽力解决【某某】在提供产品和服务过程中所遇到的任何问题。</p><p>3.&nbsp;在适用法律允许的最大范围内，【某某】明确表示不提供任何其他类型的保证，不论是明示的或默示的，包括但不限于适销性、适用性、可靠性、准确性、完整性、无病毒以及无错误的任何默示保证和责任。</p><p>4.&nbsp;在适用法律允许的最大范围内，【某某】并不担保【某某】所提供的产品和服务一定能满足用户的要求，也不担保提供的产品和服务不会被中断，并且不担保产品和服务的及时性、安全性及不受干扰，亦不担保无错误发生，以及信息能准确、及时、顺利地传送。</p><p>5.&nbsp;用户理解并同意：通过【某某】的产品和服务取得的任何信息、资料，是否信任及使用，完全取决于用户自己，并由用户承担由该等信任及使用带来的系统受损、资料丢失以及其它任何风险。【某某】对在产品和服务中提及的任何商品购物服务、交易进程、招聘信息，尤其是第三方发出的信息，都不作担保。</p><p>6.&nbsp;如有系统故障、安全漏洞（Security&nbsp;Vulnerability）、程序缺陷（Bug）、程序出错等问题，【某某】有权把游戏的资料还原到一定日期，以维护游戏之平衡。用户不得因此要求补偿或赔偿。</p><p>7.&nbsp;在适用法律允许的最大范围内，【某某】对用户因使用【某某】的产品和服务引起的任何间接、偶然、意外、特殊或继起的损害（包括但不限于因未能履行诚信或合理谨慎引起的人身伤害、隐私泄漏等以及任何金钱上的损失或其他损失）不负责任，这些损害可能来自：用户或他人不正当使用产品和服务、在网上购买商品或类似服务、在网上进行交易、非法使用服务或用户传送的信息有所变动。</p><p>8.&nbsp;【某某】对本协议项下涉及的境内外基础电信运营商的固定及移动通信网络的故障，各类技术缺陷、覆盖范围限制、不可抗力、计算机病毒、黑客攻击、用户所在位置、用户关机、合作方因素、他人故意或过失行为或其他非【某某】技术能力范围内的原因造成的服务中断、用户发送的数据或短信息的内容丢失、出现乱码、错误接收、无法接收、迟延接收等等，均不承担责任。</p><p>9.&nbsp;由于用户个人失误、错误或不当操作导致的任何后果，由用户自行承担责任，【某某】不予任何赔偿或补偿。</p><p style=\"margin: 0px; padding: 0px; font-size: 14px; color: rgb(255, 0, 0); font-family: arial; white-space: normal; background-color: rgb(248, 248, 248);\">九、知识产权及信息所有权</p><p>1.&nbsp;【某某】通过产品和服务提供的软件（包括具备客户端软件及不具备客户端软件）、其他软件、信息、作品及资料，其著作权、专利权、商标专用权及其它知识产权，均为【某某】或其相应权利人所有。除非事先经&nbsp;【某某】书面合法授权，或法律另有明文规定，任何人不得擅自以任何形式使用、复制、传播、伪造、模仿、修改、改编、翻译、汇编、出版、进行反编译或反汇编等反向工程，否则【某某】有权立即终止向用户提供产品和服务，并依法追究其知识产权侵权责任，要求用户赔偿【某某】的一切损失。</p><p>2.&nbsp;用户在使用产品和服务过程中产生并储存于【某某】服务器中的任何数据信息（包括但不限于帐号数据信息、角色数据信息、等级物品数据信息等，但用户的姓名、身份证号、电话号码等个人身份数据信息除外）属于游戏或游戏平台的一部分，由【某某】所有并进行管理，用户有权在遵守游戏规则的前提下通过【某某】指定的途径对属于自身帐号的数据信息进行修改、转移、处分。</p><p>3.&nbsp;为保证准确及避免争议，本协议涉及到的有关技术方面的数据、信息，用户同意以【某某】服务器所储存的数据作为判断标准。【某某】保证该数据的真实性。</p><p style=\"margin: 0px; padding: 0px; font-size: 14px; color: rgb(255, 0, 0); font-family: arial; white-space: normal; background-color: rgb(248, 248, 248);\">十、损害赔偿</p><p>用户若违反本协议或可适用的法律法规，导致【某某】的母公司、子公司、其他关联公司、附属机构及其人员，受雇人、代理人及其他一切相关履行辅助人员因此受到损害或支出任何衍生费用（包括但不限于支付上述法律主体须就用户的违约或违法行为所进行的一切辩护或索偿诉讼及相关和解之法律费用），用户应承担补偿相关费用及支付损害赔偿的责任。</p><p style=\"margin: 0px; padding: 0px; font-size: 14px; color: rgb(255, 0, 0); font-family: arial; white-space: normal; background-color: rgb(248, 248, 248);\">十一、协议的终止</p><p>用户应遵守本协议及有关法律法规的规定。【某某】有权判断用户是否违反本协议。若【某某】认定用户违反本协议或任何法律法规，【某某】有权在无需向用户进行事先通知的情况之下，立即暂停或终止用户的帐号并删除用户帐号中的所有相关资料、档案及任何记录，以及限制、停止或取消用户的使用资格。</p><p style=\"margin: 0px; padding: 0px; font-size: 14px; color: rgb(255, 0, 0); font-family: arial; white-space: normal; background-color: rgb(248, 248, 248);\">十二、修改和解释权</p><p>1.&nbsp;为了向用户及时、更好地提供产品和服务，基于对【某某】本身、用户及市场状况不断变化的考虑，【某某】保留随时修改、新增、删除本协议条款的权利。修改、新增、删除本协议条款时，【某某】将于官方网站公告修改、新增、删除的事实，而不另行对用户进行个别通知。若用户不同意【某某】所修改、新增、删除的内容，可立即停止使用【某某】所提供的服务。若用户继续使用【某某】提供的服务，则视同用户同意并接受本协议条款修改、新增、删除后的内容，且不得因此而要求任何补偿或赔偿。</p><p>2.&nbsp;未经【某某】事先书面同意，用户不得转让其在本协议项下的权利或义务。【某某】有权通过【某某】的子公司或其他关联公司行使其在本协议项下的权利或履行本协议项下的义务。</p><p style=\"margin: 0px; padding: 0px; font-size: 14px; color: rgb(255, 0, 0); font-family: arial; white-space: normal; background-color: rgb(248, 248, 248);\">十三、广告与外部链接</p><p>1.&nbsp;【某某】的产品和服务中可能包含他人的商业广告或其它活动促销的广告。这些内容由广告商或商品／服务提供者提供并承担相应责任，【某某】仅提供刊登内容的媒介。用户通过【某某】或【某某】所链接的网站所购买的该等服务或商品，其交易行为仅存于用户与该等商品或服务的提供者之间，与【某某】无关，【某某】不就用户与该商品或服务的提供者之间所产生的交易行为承担任何法律责任。</p><p>2.&nbsp;用户可能在使用【某某】的产品和服务过程中链接到第三方的站点。第三方的站点不由【某某】控制，并且【某某】也不对任何第三方站点的内容、第三方站点包含的任何链接、第三方站点的任何更改或更新负责。【某某】仅为了提供便利的目的而向用户提供这些到第三方站点的链接，【某某】所提供的这些链接并不意味着【某某】认可该第三方站点，不意味着【某某】担保其真实性、完整性、实时性或可信度。这些个人、公司或组织与【某某】间亦不存在任何雇用、委任、代理、合伙或其它类似的关系。用户需要检查并遵守该第三方站点的相关规定。</p><p>3.&nbsp;用户理解并同意【某某】通过电子邮件、短信或者其他方式向用户发送产品和服务或其他相关商业信息。</p><p style=\"margin: 0px; padding: 0px; font-size: 14px; color: rgb(255, 0, 0); font-family: arial; white-space: normal; background-color: rgb(248, 248, 248);\">十四、其他约定</p><p>1.&nbsp;本协议的订立、效力、解释、履行及争议解决适用中华人民共和国法律。如果本协议的任何内容与法律相抵触，应以法律规定为准。</p><p>2.&nbsp;本协议的任何条款部分或全部无效的，不影响其它条款的效力。</p><p>3.&nbsp;就本协议产生的争议及纠纷，用户与【某某】应友好协商解决。协商不成的，任何一方有权向本协议签订地人民法院提起诉讼。</p><p>4.&nbsp;本协议于用户完成【某某】通行证注册之日在【深圳市龙岗区】签订并生效。即便用户没有完成【某某】通行证注册，但通过其他任何方式获得和使用【某某】所提供的产品和服务的，本协议视为在该用户获得及使用产品和服务之日签订并生效。</p><p><br/></p>', '0', '1', null, '9', '1', '1', '1649304598');
INSERT INTO `zp_article` VALUES ('4', '4', '代理分站服务协议', '', '<p>尊敬的用户，您好！<br/></p><p>开通分站前请你务必知悉并确认：</p><p>1.本站会员服务为虚拟产品，开通分站代理服务后，若你中途主动取消代理服务或要求终止资格，你已支付的费用将不予退还，不支持以任何理由退款！如果您支付下单，即视为您已同意并接受本协议。</p><p>2.如你有关于本站的问题需要咨询或建议，可以通过【联系我们-投诉反馈】提交工单联系客服进行反馈，客服会在24小时内进行处理解答，敬请关注工单状态。</p><p>3.如果您在使用<span style=\"white-space: normal;\">代理</span>服务过程中出现纠纷，您应当与本平台友好协商解决。</p><p>4.建立合作关系后的合作有效期内，客户购买资源并支付订单为有效订单，您可获得推广提成。</p><p>5.开通分站后务必在后台准确填写收款结算信息，佣金支持随时可结算，提现后，推广提成会结算至后台填写的收款账户中，推广费用以实际到账金额为准。</p><p>6.本站不做任何返佣形式的订单【例如：充值返利等等】，请注意自身防范，勿相信不正当途径告知您购买项目课程返利的行为！本站杜绝此类情况的产生，如果有站长涉及此类情况，请第一时间前往【<span style=\"white-space: normal;\">联系我们-投诉反馈</span>】提交相应截图凭证反馈，会有客服为您处理！</p><p>7.如果您未满18周岁，需取得监护人的同意并在监护人的陪同下阅读本协议，并在取得监护人同意您使用本站所提供的服务、以及向本站提供的服务支付相关费用的行为。您使用本站服务的行为将视为您已经履行上述义务。</p><p><br/></p><p><br/></p>', '0', '1', '', '4', '1', '1', '1682669851');
INSERT INTO `zp_article` VALUES ('5', '5', '加盟代理合伙人声明', '', '<h4>①作为一个虚拟资源创业网站优势就很明显，懂项目的都清楚，市场价格基本大几百项目，平台作为资源整合，走量销售运营模式，让每位客户以最优惠的价格，同样享受大几百项目，再也不用担心经常被大几百几千学费被割韭菜了！</h4><p>②加盟高级合伙人将会找到一群志同道合的内部圈子人脉，享受内部价格，独立自己的网站，平台全力扶持每一位合伙人发展自己的团队！<br/><br/>③同行跳槽或本身就在从事相关方面的我们将提供最优质、最专业的服务！<br/><br/>④小白的话想加盟高级合伙人，但是担心不知道咋干，对于小白的话平台也做到了全面照顾，推出了一系列《小白无忧计划》详情参考会员中心-官方公告内查看！<br/><br/>⑤本平台拥有全网最优质的客服服务(6位客服24小时轮班在线)以及最专业的技术团队前(阿里、腾讯)技术员支持，所有可能发生的问题均有预备方案，出现问题极速响应，最大程度的保证您的推广道路畅通无阻，我们重视每一个IP，因为每一个IP都是潜力股!&nbsp;<br/><br/>⑥平台任何变动、更新、通知、福利等，都会及时通知您(微信通知)，做一个真正把代理当做家人的平台，由于平台活动比较多，加盟费用等优惠福利政策，可加客服了解详情！<br/><br/>⑦俗话说：不会做调查的运营不是好运营，对于平台规模管理运营，也相继推出了《倾听计划》用心聆听每一位用户对平台的反馈，用心优化解决每一个问题，给每位客户带来最极致的体验感！<br/><br/>⑧更多优势欢迎您加盟后自行品鉴、相互比较，有实力的平台经得起任何考验与比较，我们将不忘初心、砥砺前行，将各代理的流量最大化转化为利润，为各代理创造更大的价值。<br/><br/>⑨最后由衷感谢每位用户，能抽出宝贵的时间了解到底，如还有不懂可联系客服咨询相关问题，2023不负所望，共同前行！</p><p><br/></p>', '0', '1', '', '4', '1', '1', '1682669987');
INSERT INTO `zp_article` VALUES ('7', '2', '如何推广资源赚取分销', '', '<p>如何推广资源赚取分销</p>', '0', '1', '', '22', '1', '1', '1690804131');
INSERT INTO `zp_article` VALUES ('8', '3', '关于我们', '', '<p>关于我们</p>', '0', '1', '', '3', '1', '1', '1690814032');
INSERT INTO `zp_article` VALUES ('9', '3', '联系我们', '', '<p>联系我们</p>', '0', '1', '', '4', '1', '1', '1690814080');
INSERT INTO `zp_article` VALUES ('10', '3', '版权声明', '', '<p>版权声明</p>', '0', '1', '', '6', '1', '1', '1690816377');
INSERT INTO `zp_article` VALUES ('11', '7', 'SVIP介绍', '', '<h1>1.在开始学习之前，花点时间了解几个基本的概念，可以帮助您更快熟悉智创云享。</h1><p>在智创云享中，您可以报名任意的课程，每个课程中含有若干节，每个节下会有若干个学习任务，学习任务的类型包括：直播任务、录播任务、习题任务等，您可以通过各种类型的任务进行学习。</p><p>当您完成所有的学习任务后，就完成了该门课程的学习。</p><p>各种课程、章节、学习任务由授课老师安排，如果在课程内容上有任何建议，您可以联系老师沟通。</p><p>2.在智创云享可以做什么？</p><p>学习！学习！学习！</p><p>好学的您可以通过在线直播来与老师实时互动，通过录播视频随时随地学习，通过习题任务进一步地巩固所学的知识，同时可以下载相关学习资料。</p><p>当然，效率也很重要！</p><p>课程表帮您更好地管理自己的学习。</p><p>PC网页：您可以在“个人中心 -&gt; 课程表”页面中查看报名课程以及即将开始的课程。</p><p>移动端APP：您可以在“课程表”页面中查看报名课程以及即将开始的课程。</p><p>&nbsp;</p><p>&nbsp;</p><p>3.如何开始学习？</p><p>首先，您需要登录智创云享，报名该课程。</p><p>免费课点击课程详情页中的免费报名，即可报名该课程。</p><p><br/></p>', '0', '1', '', '542', '1', '1', '1692605746');INSERT INTO `zp_article` VALUES ('13', '4', '会员服务协议', '', '<p>付费会员协议</p><p>请认真阅读并理解以下内容，本协议是您与西安众邦网络科技有限公司之间就SVIP会员所订立的契约。请您仔细阅读本协议，会员购买成功后本协议即构成对双方有约束力的法律文件。</p><p>第1条 相关定义</p><p>1.1 SVIP会员:SVIP 会员是为商城客户打造的高级会员服务，通过提供高品质的客户服务，让网购变的更加方便，省钱和放心。</p><p>1.5 实名信息:用户开通SVIP会员需保证商城用户信息真实，同一自然人如有多个商城账号，可同时开通对应的多个会员。</p><p>第2条 本站服务条款的确认和接纳</p><p>2.1本站所提供的SVIP会员试用期及正式期活动的所有权和运作权归本公司所有。</p><p>2.2 用户支付会员成功，即视为用户确认自己同意接受SVIP会员相关服务的条款，且同意按本协议内容履行，如产生用户相关责任的，同意承担相应法律责任。</p><p>2.3 如果您在18周岁以下，您只能在父母或监护人的监护参与下方能参与体验该服务。</p><p>2.4 本公司保留在中华人民共和国大陆地区法施行之法律允许的范围内独自决定拒绝服务、关闭用户账户、清除或编辑</p><p>内容等相关权利。</p><p>2.5 SVIP会员开通后，您在已开通的服务期内不能主动取消服务或终止资格，</p><p><br/></p>', '0', '1', '', '5', '1', '1', '1708415195');
INSERT INTO `zp_article` VALUES ('13', '4', '会员服务协议', '', '<p>付费会员协议</p><p>请认真阅读并理解以下内容，本协议是您与智创云享之间就SVIP会员所订立的契约。请您仔细阅读本协议，会员购买成功后本协议即构成对双方有约束力的法律文件。</p><p>第1条 相关定义</p><p>1.1 SVIP会员:SVIP 会员是为商城客户打造的高级会员服务，通过提供高品质的客户服务，让网购变的更加方便，省钱和放心。</p><p>1.5 实名信息:用户开通SVIP会员需保证用户信息真实，同一自然人如有多个商城账号，可同时开通对应的多个会员。</p><p>第2条 本站服务条款的确认和接纳</p><p>2.1本站所提供的SVIP会员试用期及正式期活动的所有权和运作权归我们所有。</p><p>2.2 用户支付会员成功，即视为用户确认自己同意接受SVIP会员相关服务的条款，且同意按本协议内容履行，如产生用户相关责任的，同意承担相应法律责任。</p><p>2.3 如果您在18周岁以下，您只能在父母或监护人的监护参与下方能参与体验该服务。</p><p>2.4 本公司保留在中华人民共和国大陆地区法施行之法律允许的范围内独自决定拒绝服务、关闭用户账户、清除或编辑</p><p>内容等相关权利。</p><p>2.5 SVIP会员开通后，您在已开通的服务期内不能主动取消服务或终止资格，</p><p><br/></p>', '0', '1', '', '5', '1', '1', '1708415195');


-- ----------------------------
-- Table structure for zp_article_sort
-- ----------------------------
DROP TABLE IF EXISTS `zp_article_sort`;
CREATE TABLE `zp_article_sort` (
   `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
   `pid` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '父ID',
   `name` varchar(30) DEFAULT NULL COMMENT '类型名称',
   `indexid` int(10) unsigned DEFAULT '0' COMMENT '排序',
   `status` tinyint(3) unsigned DEFAULT '0' COMMENT '状态，1启用，0禁用',
   `ctime` int(10) unsigned DEFAULT '0' COMMENT '创建时间',
   PRIMARY KEY (`id`),
   KEY `idx_pid` (`pid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COMMENT='文章分类';

-- ----------------------------
-- Records of zp_article_sort
-- ----------------------------
INSERT INTO `zp_article_sort` VALUES ('1', '0', '官方公告', '1', '1', '1578987839');
INSERT INTO `zp_article_sort` VALUES ('2', '0', '常见问题', '1', '1', '1580719198');
INSERT INTO `zp_article_sort` VALUES ('3', '0', '关于我们', '1', '1', '1580719289');
INSERT INTO `zp_article_sort` VALUES ('4', '0', '用户协议', '1', '1', '1649303451');
INSERT INTO `zp_article_sort` VALUES ('5', '0', '代理加盟', '1', '1', '1682669950');
INSERT INTO `zp_article_sort` VALUES ('6', '0', '精选资讯', '1', '1', '1684231877');
INSERT INTO `zp_article_sort` VALUES ('7', '0', 'SVIP介绍', '1', '1', '1692605704');

-- ----------------------------
-- Table structure for zp_attachment
-- ----------------------------
DROP TABLE IF EXISTS `zp_attachment`;
CREATE TABLE `zp_attachment` (
 `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
 `admin_id` int(10) unsigned DEFAULT '0' COMMENT '代理ID',
 `pid` int(10) unsigned DEFAULT '0' COMMENT '所属分类',
 `name` varchar(128) COLLATE utf8mb4_bin DEFAULT NULL COMMENT '名称',
 `real_name` varchar(128) COLLATE utf8mb4_bin DEFAULT NULL COMMENT '真实名称',
 `att_dir` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL COMMENT '原路径',
 `satt_dir` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL COMMENT '现路径',
 `att_size` varchar(32) COLLATE utf8mb4_bin DEFAULT NULL COMMENT '大小',
 `att_type` varchar(32) COLLATE utf8mb4_bin DEFAULT NULL COMMENT '类型',
 `up_type` tinyint(1) unsigned DEFAULT '0' COMMENT '上传类型：1本地，2阿里云，3腾讯云，4七牛云',
 `mode_type` tinyint(1) unsigned DEFAULT '0' COMMENT '上传来源：1后端，2前端',
 `ctime` int(10) unsigned DEFAULT NULL COMMENT '时间',
 PRIMARY KEY (`id`),
 KEY `idx_pid` (`pid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_bin COMMENT='素材列表';

-- ----------------------------
-- Records of zp_attachment
-- ----------------------------
INSERT INTO `zp_attachment` VALUES ('3', '0', '1', '0d2d5e46e8d7d1f7b52d825b7c3c0f89.png', 'logo.png', 'https://zpcms.oss-cn-beijing.aliyuncs.com/uploads/20240719/0d2d5e46e8d7d1f7b52d825b7c3c0f89.png', 'https://zpcms.oss-cn-beijing.aliyuncs.com/uploads/20240719/0d2d5e46e8d7d1f7b52d825b7c3c0f89.png', '10809', 'png', '2', '1', '1721396271');
INSERT INTO `zp_attachment` VALUES ('4', '0', '1', 'cbc61f0aae840c82967b49dd657c1be9.png', 'fenzhan.png', 'https://zpcms.oss-cn-beijing.aliyuncs.com/uploads/20240719/cbc61f0aae840c82967b49dd657c1be9.png', 'https://zpcms.oss-cn-beijing.aliyuncs.com/uploads/20240719/cbc61f0aae840c82967b49dd657c1be9.png', '25131', 'png', '2', '1', '1721396288');
INSERT INTO `zp_attachment` VALUES ('5', '0', '2', 'ff307b0d3e25d59f33661c31632047f7.png', 'jieshao.png', 'https://zpcms.oss-cn-beijing.aliyuncs.com/uploads/20240719/ff307b0d3e25d59f33661c31632047f7.png', 'https://zpcms.oss-cn-beijing.aliyuncs.com/uploads/20240719/ff307b0d3e25d59f33661c31632047f7.png', '30549', 'png', '2', '1', '1721396306');
INSERT INTO `zp_attachment` VALUES ('8', '0', '2', 'a02188577e646a3ebd04c08c70847276.png', 'hehuoren.png', 'https://zpcms.oss-cn-beijing.aliyuncs.com/uploads/20240810/a02188577e646a3ebd04c08c70847276.png', 'https://zpcms.oss-cn-beijing.aliyuncs.com/uploads/20240810/a02188577e646a3ebd04c08c70847276.png', '212994', 'png', '2', '1', '1723296637');
INSERT INTO `zp_attachment` VALUES ('10', '0', '2', '011cef616009029e8d2bf441570ff26d.png', '设计创作.png', 'https://zpcms.oss-cn-beijing.aliyuncs.com/uploads/20240810/011cef616009029e8d2bf441570ff26d.png', 'https://zpcms.oss-cn-beijing.aliyuncs.com/uploads/20240810/011cef616009029e8d2bf441570ff26d.png', '10895', 'png', '2', '1', '1723297676');
INSERT INTO `zp_attachment` VALUES ('11', '0', '2', '338368ebd873b85403ae888115f81db6.png', '3.png', 'https://zpcms.oss-cn-beijing.aliyuncs.com/uploads/20240810/338368ebd873b85403ae888115f81db6.png', 'https://zpcms.oss-cn-beijing.aliyuncs.com/uploads/20240810/338368ebd873b85403ae888115f81db6.png', '6053', 'png', '2', '1', '1723297684');
INSERT INTO `zp_attachment` VALUES ('12', '0', '2', 'b50316d0b49b923d274997b8a6218b8e.png', '6.png', 'https://zpcms.oss-cn-beijing.aliyuncs.com/uploads/20240810/b50316d0b49b923d274997b8a6218b8e.png', 'https://zpcms.oss-cn-beijing.aliyuncs.com/uploads/20240810/b50316d0b49b923d274997b8a6218b8e.png', '7343', 'png', '2', '1', '1723297694');
INSERT INTO `zp_attachment` VALUES ('13', '0', '2', '21933390d1de078345c0a261a3c5e00a.png', '8.png', 'https://zpcms.oss-cn-beijing.aliyuncs.com/uploads/20240810/21933390d1de078345c0a261a3c5e00a.png', 'https://zpcms.oss-cn-beijing.aliyuncs.com/uploads/20240810/21933390d1de078345c0a261a3c5e00a.png', '16395', 'png', '2', '1', '1723297704');
INSERT INTO `zp_attachment` VALUES ('14', '0', '2', 'c119d09ff52647dc3b31e0513d6681d9.png', '语言留学.png', 'https://zpcms.oss-cn-beijing.aliyuncs.com/uploads/20240810/c119d09ff52647dc3b31e0513d6681d9.png', 'https://zpcms.oss-cn-beijing.aliyuncs.com/uploads/20240810/c119d09ff52647dc3b31e0513d6681d9.png', '8211', 'png', '2', '1', '1723297717');
INSERT INTO `zp_attachment` VALUES ('15', '0', '2', '0ea9e5d433443a4b5684131ec5724413.png', '5.png', 'https://zpcms.oss-cn-beijing.aliyuncs.com/uploads/20240810/0ea9e5d433443a4b5684131ec5724413.png', 'https://zpcms.oss-cn-beijing.aliyuncs.com/uploads/20240810/0ea9e5d433443a4b5684131ec5724413.png', '8556', 'png', '2', '1', '1723297727');
INSERT INTO `zp_attachment` VALUES ('17', '0', '2', 'bfa344e2da75e77118c3ef3656b4321f.png', '11.png', 'https://zpcms.oss-cn-beijing.aliyuncs.com/uploads/20240810/bfa344e2da75e77118c3ef3656b4321f.png', 'https://zpcms.oss-cn-beijing.aliyuncs.com/uploads/20240810/bfa344e2da75e77118c3ef3656b4321f.png', '13475', 'png', '2', '1', '1723297754');
INSERT INTO `zp_attachment` VALUES ('18', '0', '2', '029b4d033cd0e659da7f3e8cd91e6b2e.png', '4.png', 'https://zpcms.oss-cn-beijing.aliyuncs.com/uploads/20240810/029b4d033cd0e659da7f3e8cd91e6b2e.png', 'https://zpcms.oss-cn-beijing.aliyuncs.com/uploads/20240810/029b4d033cd0e659da7f3e8cd91e6b2e.png', '2669', 'png', '2', '1', '1723297913');
INSERT INTO `zp_attachment` VALUES ('19', '0', '2', 'c17fba0562dbd142d8386274c0e14391.png', '升学考证.png', 'https://zpcms.oss-cn-beijing.aliyuncs.com/uploads/20240810/c17fba0562dbd142d8386274c0e14391.png', 'https://zpcms.oss-cn-beijing.aliyuncs.com/uploads/20240810/c17fba0562dbd142d8386274c0e14391.png', '6017', 'png', '2', '1', '1723297926');
INSERT INTO `zp_attachment` VALUES ('20', '0', '2', '2ba465e1afee0addcd3dcbd364ed248c.png', '10.png', 'https://zpcms.oss-cn-beijing.aliyuncs.com/uploads/20240810/2ba465e1afee0addcd3dcbd364ed248c.png', 'https://zpcms.oss-cn-beijing.aliyuncs.com/uploads/20240810/2ba465e1afee0addcd3dcbd364ed248c.png', '3386', 'png', '2', '1', '1723297967');
INSERT INTO `zp_attachment` VALUES ('21', '0', '2', 'c44ac535ca658603044138b5bd5f4d29.png', '9.png', 'https://zpcms.oss-cn-beijing.aliyuncs.com/uploads/20240810/c44ac535ca658603044138b5bd5f4d29.png', 'https://zpcms.oss-cn-beijing.aliyuncs.com/uploads/20240810/c44ac535ca658603044138b5bd5f4d29.png', '7058', 'png', '2', '1', '1723297979');
INSERT INTO `zp_attachment` VALUES ('22', '0', '2', '836325a9edf0ac5970083f19c73074ab.png', '13.png', 'https://zpcms.oss-cn-beijing.aliyuncs.com/uploads/20240810/836325a9edf0ac5970083f19c73074ab.png', 'https://zpcms.oss-cn-beijing.aliyuncs.com/uploads/20240810/836325a9edf0ac5970083f19c73074ab.png', '6660', 'png', '2', '1', '1723297995');
INSERT INTO `zp_attachment` VALUES ('23', '0', '2', '305cff1e10890ba35fcb69a39abc7456.png', '1.png', 'https://zpcms.oss-cn-beijing.aliyuncs.com/uploads/20240810/305cff1e10890ba35fcb69a39abc7456.png', 'https://zpcms.oss-cn-beijing.aliyuncs.com/uploads/20240810/305cff1e10890ba35fcb69a39abc7456.png', '6100', 'png', '2', '1', '1723298003');
INSERT INTO `zp_attachment` VALUES ('26', '0', '2', '658d0d8bcda6fa9b1a3e3056854022e0.png', 'IT技术.png', 'https://zpcms.oss-cn-beijing.aliyuncs.com/uploads/20240810/658d0d8bcda6fa9b1a3e3056854022e0.png', 'https://zpcms.oss-cn-beijing.aliyuncs.com/uploads/20240810/658d0d8bcda6fa9b1a3e3056854022e0.png', '3655', 'png', '2', '1', '1723298057');
INSERT INTO `zp_attachment` VALUES ('32', '0', '2', '709422984a2e64f41f32b8b7088a913a.png', '知识付费.png', 'https://zpcms.oss-cn-beijing.aliyuncs.com/uploads/20240810/709422984a2e64f41f32b8b7088a913a.png', 'https://zpcms.oss-cn-beijing.aliyuncs.com/uploads/20240810/709422984a2e64f41f32b8b7088a913a.png', '44100', 'png', '2', '1', '1723298067');
INSERT INTO `zp_attachment` VALUES ('33', '0', '2', 'c2f84e7cab2b011767874f6c064bc98c.png', '7.png', 'https://zpcms.oss-cn-beijing.aliyuncs.com/uploads/20240810/c2f84e7cab2b011767874f6c064bc98c.png', 'https://zpcms.oss-cn-beijing.aliyuncs.com/uploads/20240810/c2f84e7cab2b011767874f6c064bc98c.png', '5495', 'png', '2', '1', '1723297742');
INSERT INTO `zp_attachment` VALUES ('40', '19', '5', 'c514fd92769122adcbc96d94a919f659.png', 'logo.png', 'https://zpcms.oss-cn-beijing.aliyuncs.com/uploads/20241007/c514fd92769122adcbc96d94a919f659.png', 'https://zpcms.oss-cn-beijing.aliyuncs.com/uploads/20241007/c514fd92769122adcbc96d94a919f659.png', '10809', 'png', '2', '1', '1728267315');
INSERT INTO `zp_attachment` VALUES ('51', '1', '1', '03c58db7b4deaf772e0c8ccf62304a8d.jpg', 'bg.jpg', 'https://zpcms.oss-cn-beijing.aliyuncs.com/uploads/20250227/03c58db7b4deaf772e0c8ccf62304a8d.jpg', 'https://zpcms.oss-cn-beijing.aliyuncs.com/uploads/20250227/03c58db7b4deaf772e0c8ccf62304a8d.jpg', '41795', 'jpg', '2', '1', '1740645483');
INSERT INTO `zp_attachment` VALUES ('97', '1', '1', '07f7a6fe4a50aef9f5e384e38306f5e1.png', 'logo.png', 'https://zpcms.oss-cn-beijing.aliyuncs.com/uploads/20250327/07f7a6fe4a50aef9f5e384e38306f5e1.png', 'https://zpcms.oss-cn-beijing.aliyuncs.com/uploads/20250327/07f7a6fe4a50aef9f5e384e38306f5e1.png', '4273', 'png', '2', '1', '1743067359');
INSERT INTO `zp_attachment` VALUES ('130', '1', '1', 'b663d7910cebf0d23f120001d5832444.png', '智创云享-180_48.png', 'https://zpcms.oss-cn-beijing.aliyuncs.com/uploads/20250522/b663d7910cebf0d23f120001d5832444.png', 'https://zpcms.oss-cn-beijing.aliyuncs.com/uploads/20250522/b663d7910cebf0d23f120001d5832444.png', '3489', 'png', '2', '1', '1747903781');
INSERT INTO `zp_attachment` VALUES ('131', '1', '1', '930e8247f12ed1682a404fea1cd32c31.jpg', 'qrcode_for_gh_c52fb66122dc_430.jpg', 'https://zpcms.oss-cn-beijing.aliyuncs.com/uploads/20250522/930e8247f12ed1682a404fea1cd32c31.jpg', 'https://zpcms.oss-cn-beijing.aliyuncs.com/uploads/20250522/930e8247f12ed1682a404fea1cd32c31.jpg', '39605', 'jpg', '2', '1', '1747906504');
INSERT INTO `zp_attachment` VALUES ('132', '1', '1', '3c755bc3a195c6fa60d622a5161abf20.ico', 'fav.ico', 'https://zpcms.oss-cn-beijing.aliyuncs.com/uploads/20250522/3c755bc3a195c6fa60d622a5161abf20.ico', 'https://zpcms.oss-cn-beijing.aliyuncs.com/uploads/20250522/3c755bc3a195c6fa60d622a5161abf20.ico', '9662', 'ico', '2', '1', '1747906525');
INSERT INTO `zp_attachment` VALUES ('133', '1', '1', '3d979b4b6258ae71cf80afeef1a15652.png', 'login-bg.png', 'https://zpcms.oss-cn-beijing.aliyuncs.com/uploads/20250522/3d979b4b6258ae71cf80afeef1a15652.png', 'https://zpcms.oss-cn-beijing.aliyuncs.com/uploads/20250522/3d979b4b6258ae71cf80afeef1a15652.png', '68651', 'png', '2', '1', '1747906638');
INSERT INTO `zp_attachment` VALUES ('134', '1', '1', 'b09a2ba327d3464e466e8b927d6d9e9c.jpg', 'dd87607d55ad80114482ad34d8f4979e.jpg', 'https://zpcms.oss-cn-beijing.aliyuncs.com/uploads/20250522/b09a2ba327d3464e466e8b927d6d9e9c.jpg', 'https://zpcms.oss-cn-beijing.aliyuncs.com/uploads/20250522/b09a2ba327d3464e466e8b927d6d9e9c.jpg', '120565', 'jpg', '2', '1', '1747906769');

-- ----------------------------
-- Table structure for zp_attachment_sort
-- ----------------------------
DROP TABLE IF EXISTS `zp_attachment_sort`;
CREATE TABLE `zp_attachment_sort` (
`id` int(10) unsigned NOT NULL AUTO_INCREMENT,
`pid` int(10) unsigned DEFAULT '0' COMMENT '父ID',
`name` varchar(64) COLLATE utf8mb4_bin DEFAULT NULL COMMENT '名称',
`ctime` int(11) unsigned DEFAULT '0',
PRIMARY KEY (`id`),
KEY `idx_pid` (`pid`)
) ENGINE=InnoDB AUTO_INCREMENT=7 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_bin COMMENT='素材分类';

-- ----------------------------
-- Records of zp_attachment_sort
-- ----------------------------
INSERT INTO `zp_attachment_sort` VALUES ('1', '0', '系统自带', '0');
INSERT INTO `zp_attachment_sort` VALUES ('2', '0', '分类图标', '0');
INSERT INTO `zp_attachment_sort` VALUES ('3', '0', '底部菜单', '0');
INSERT INTO `zp_attachment_sort` VALUES ('4', '0', '轮播图片', '0');
INSERT INTO `zp_attachment_sort` VALUES ('5', '0', '未分类', '0');

-- ----------------------------
-- Table structure for zp_audio_course
-- ----------------------------
DROP TABLE IF EXISTS `zp_audio_course`;
CREATE TABLE `zp_audio_course` (
`id` int(11) NOT NULL AUTO_INCREMENT,
`title` varchar(150) DEFAULT NULL COMMENT '课程标题',
`thumb` varchar(128) DEFAULT NULL COMMENT '封面图',
`url` varchar(255) DEFAULT NULL COMMENT '课程地址',
`desc` varchar(255) DEFAULT NULL COMMENT '简介',
`rid` int(11) DEFAULT NULL COMMENT '资源ID',
`times` varchar(24) DEFAULT NULL COMMENT '时长',
`is_try` tinyint(1) DEFAULT '0' COMMENT '是否试看',
`indexid` int(11) DEFAULT NULL COMMENT '排序',
`ctime` int(11) DEFAULT NULL,
PRIMARY KEY (`id`),
KEY `idx_rid` (`rid`),
KEY `union_where` (`rid`,`indexid`,`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COMMENT='音频课程';

-- ----------------------------
-- Table structure for zp_auth_group
-- ----------------------------
DROP TABLE IF EXISTS `zp_auth_group`;
CREATE TABLE `zp_auth_group` (
 `id` int(8) unsigned NOT NULL AUTO_INCREMENT,
 `title` char(50) NOT NULL DEFAULT '' COMMENT '标题',
 `status` tinyint(1) unsigned DEFAULT '0' COMMENT '状态',
 `rules` longtext COMMENT '规则',
 `is_auth` tinyint(1) unsigned DEFAULT '1' COMMENT '是否区分数据，0：不区分，1：区分',
 `ctime` int(11) unsigned NOT NULL DEFAULT '0' COMMENT '添加时间',
 PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='管理权限组';

-- ----------------------------
-- Records of zp_auth_group
-- ----------------------------
INSERT INTO `zp_auth_group` VALUES ('1', '超级管理员', '1', '*', '0', '1563124128');
INSERT INTO `zp_auth_group` VALUES ('2', '代理用户组', '1', '295,294,346,347,469,480,481,531,622,532,533,536,534,535,433,435,434,436,437,504,438,503,439,440,441,507,442,443,444,420,545,546,431,547,548,491,494,495,496,497,500,501,336,337,544,352,353,459,425,623,624,426,478,479,383,357,651,427,428,363,625,492,626,456,629,457,628,470,627,632,633,377,549,401,402,403,630,631,379,550,404,406,407,634,635,432,551,636,476,477,458,327,328,555,556,557,448,449,447,451,452,559,655,656,386,387,388,385,384,446,450,453,329,558,277,278,362,567,647,648,297,296,348,502,568,571,569,570,467,375,572,418,575,413,364,365,576,445,398,399,400,366,579,483,394,490,581,580,393,395,342,368,591,369,370,371,372,657,658,659,660,661,662,663,664,665,666,667', '1', '1570849015');
-- ----------------------------
-- Table structure for zp_auth_rule
-- ----------------------------
DROP TABLE IF EXISTS `zp_auth_rule`;
CREATE TABLE `zp_auth_rule` (
`id` mediumint(8) unsigned NOT NULL AUTO_INCREMENT,
`pid` int(5) NOT NULL DEFAULT '0' COMMENT '父栏目ID',
`method` varchar(12) DEFAULT NULL COMMENT '接口请求方式',
`href` char(80) NOT NULL DEFAULT '',
`title` char(20) NOT NULL DEFAULT '',
`type` tinyint(1) NOT NULL DEFAULT '1',
`open` tinyint(2) NOT NULL DEFAULT '1' COMMENT '是否开启验证',
`icon` varchar(20) DEFAULT NULL COMMENT '样式',
`condition` char(100) DEFAULT '',
`sort` int(11) DEFAULT '0' COMMENT '排序',
`status` tinyint(1) NOT NULL DEFAULT '1' COMMENT '权限状态，1开启，0关闭',
`ctime` int(11) NOT NULL DEFAULT '0' COMMENT '添加时间',
`is_menu` tinyint(1) unsigned NOT NULL DEFAULT '0' COMMENT '1显示菜单，0不显示',
PRIMARY KEY (`id`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COMMENT='权限表';

-- ----------------------------
-- Records of zp_auth_rule
-- ----------------------------
INSERT INTO `zp_auth_rule` VALUES ('1', '0', 'GET', 'Setting', '系统设置', '1', '1', 'icon-setting', '', '1', '1', '1446535750', '1');
INSERT INTO `zp_auth_rule` VALUES ('2', '1', 'GET', 'Setting/index', '全局设置', '1', '1', '', '', '1', '1', '1446535789', '1');
INSERT INTO `zp_auth_rule` VALUES ('386', '328', 'POST', 'Resource/del', '删除资源', '1', '1', '', '', '50', '1', '1624418397', '0');
INSERT INTO `zp_auth_rule` VALUES ('387', '328', 'POST', 'Resource/setstatus', '设置资源状态', '1', '1', '', '', '50', '1', '1624418462', '0');
INSERT INTO `zp_auth_rule` VALUES ('388', '328', 'POST', 'Resource/spread', '推广资源', '1', '1', '', '', '50', '1', '1624418496', '0');
INSERT INTO `zp_auth_rule` VALUES ('15', '0', 'GET', 'Auth', '权限管理', '1', '1', 'icon-auth', '', '2', '1', '1446535750', '1');
INSERT INTO `zp_auth_rule` VALUES ('16', '15', 'GET', 'Auth/adminList', '管理员列表', '1', '1', '', '', '0', '1', '1446535750', '1');
INSERT INTO `zp_auth_rule` VALUES ('17', '15', 'GET', 'Auth/adminGroup', '权限组列表', '1', '1', '', '', '1', '1', '1446535750', '1');
INSERT INTO `zp_auth_rule` VALUES ('18', '15', 'GET', 'Auth/adminRule', '权限管理', '1', '1', '', '', '2', '1', '1446535750', '1');
INSERT INTO `zp_auth_rule` VALUES ('370', '342', 'GET', 'Order/zlist', '助力记录', '1', '1', '', '', '3', '1', '1622701574', '1');
INSERT INTO `zp_auth_rule` VALUES ('28', '0', 'GET', 'Function', '网站功能', '1', '1', 'icon-sas', '', '14', '1', '1447231590', '1');
INSERT INTO `zp_auth_rule` VALUES ('278', '277', 'GET', 'Agent/index', '代理列表', '1', '1', '', '', '1', '1', '1571896159', '1');
INSERT INTO `zp_auth_rule` VALUES ('108', '18', 'POST', 'Auth/ruleAdd', '操作-添加', '1', '1', '', '', '1', '1', '1461550835', '0');
INSERT INTO `zp_auth_rule` VALUES ('109', '18', 'POST', 'Auth/ruleStatus', '操作-状态', '1', '1', '', '', '5', '1', '1461550949', '0');
INSERT INTO `zp_auth_rule` VALUES ('110', '18', 'POST', 'Auth/ruleAuth', '操作-验证', '1', '1', '', '', '6', '1', '1461551129', '0');
INSERT INTO `zp_auth_rule` VALUES ('111', '18', 'POST', 'Auth/ruleOrder', '操作-排序', '1', '1', '', '', '7', '1', '1461551263', '0');
INSERT INTO `zp_auth_rule` VALUES ('112', '18', 'POST', 'Auth/ruleDel', '操作-删除', '1', '1', '', '', '4', '1', '1461551536', '0');
INSERT INTO `zp_auth_rule` VALUES ('114', '18', 'POST', 'Auth/ruleEdit', '操作-修改', '1', '1', '', '', '2', '1', '1461551913', '0');
INSERT INTO `zp_auth_rule` VALUES ('116', '17', 'POST', 'Auth/groupEdit', '操作-修改', '1', '1', '', '', '3', '1', '1461552326', '0');
INSERT INTO `zp_auth_rule` VALUES ('117', '17', 'POST', 'Auth/groupDel', '操作-删除', '1', '1', '', '', '30', '1', '1461552349', '0');
INSERT INTO `zp_auth_rule` VALUES ('118', '17', 'POST', 'Auth/groupAccess', '操作-权限', '1', '1', '', '', '40', '1', '1461552404', '0');
INSERT INTO `zp_auth_rule` VALUES ('119', '16', 'POST', 'Auth/adminAdd', '操作-添加', '1', '1', '', '', '1', '1', '1461553162', '0');
INSERT INTO `zp_auth_rule` VALUES ('120', '16', 'POST', 'Auth/adminEdit', '操作-修改', '1', '1', '', '', '2', '1', '1461554130', '0');
INSERT INTO `zp_auth_rule` VALUES ('121', '16', 'POST', 'Auth/adminDel', '操作-删除', '1', '1', '', '', '4', '1', '1461554152', '0');
INSERT INTO `zp_auth_rule` VALUES ('363', '337', 'GET', 'Spread/batchMoney', '推广价格页面', '1', '1', '', '', '9', '1', '1576200457', '0');
INSERT INTO `zp_auth_rule` VALUES ('389', '329', 'GET', 'Resource/addsort', '添加分类页面', '1', '1', '', '', '50', '1', '1624418587', '0');
INSERT INTO `zp_auth_rule` VALUES ('390', '329', 'GET', 'Resource/editsort', '编辑分类页面', '1', '1', '', '', '50', '1', '1624418627', '0');
INSERT INTO `zp_auth_rule` VALUES ('391', '329', 'POST', 'Resource/delsort', '删除分类', '1', '1', '', '', '50', '1', '1624418669', '0');
INSERT INTO `zp_auth_rule` VALUES ('328', '327', 'GET', 'Resource/index', '资源列表', '1', '1', '', '', '1', '1', '1586605249', '1');
INSERT INTO `zp_auth_rule` VALUES ('329', '327', 'GET', 'Resource/sort', '资源分类', '1', '1', '', '', '2', '1', '1586610178', '1');
INSERT INTO `zp_auth_rule` VALUES ('374', '373', 'POST', 'Usercash/passed', '提现审核操作', '1', '1', '', '', '2', '1', '1622717301', '0');
INSERT INTO `zp_auth_rule` VALUES ('392', '365', 'POST', 'User/setUp', '设置用户状态', '1', '1', '', '', '50', '1', '1624418903', '0');
INSERT INTO `zp_auth_rule` VALUES ('145', '16', 'POST', 'Auth/adminstate', '操作-状态', '1', '1', '', '', '5', '1', '1461550835', '0');
INSERT INTO `zp_auth_rule` VALUES ('149', '17', 'POST', 'Auth/groupAdd', '操作-添加', '1', '1', '', '', '1', '1', '1461550835', '0');
INSERT INTO `zp_auth_rule` VALUES ('151', '17', 'POST', 'Auth/groupSetAccess', '操作-权存', '1', '1', '', '', '50', '1', '1461550835', '0');
INSERT INTO `zp_auth_rule` VALUES ('327', '0', 'GET', 'Resource', '资源管理', '1', '1', 'icon-datasource', '', '6', '1', '1586605157', '1');
INSERT INTO `zp_auth_rule` VALUES ('373', '364', 'GET', 'Usercash/list', '用户提现', '1', '1', '', '', '6', '1', '1622713208', '1');
INSERT INTO `zp_auth_rule` VALUES ('362', '278', 'POST', 'Agent/personal', '资料编辑保存', '1', '1', '', '', '0', '1', '1576200457', '0');
INSERT INTO `zp_auth_rule` VALUES ('342', '0', 'GET', 'Order', '订单管理', '1', '1', 'icon-list', '', '8', '1', '1576200457', '1');
INSERT INTO `zp_auth_rule` VALUES ('181', '17', 'POST', 'Auth/groupState', '操作-状态', '1', '1', '', '', '50', '1', '1461834340', '0');
INSERT INTO `zp_auth_rule` VALUES ('393', '366', 'GET', 'User/addsvip', '添加SVIP页面', '1', '1', '', '', '50', '1', '1624419087', '0');
INSERT INTO `zp_auth_rule` VALUES ('294', '295', 'GET', 'Index/index', '首页统合', '1', '1', '', '', '0', '1', '1571886753', '0');
INSERT INTO `zp_auth_rule` VALUES ('295', '0', 'GET', 'Index/main', '管理首页', '1', '1', 'icon-home', '', '0', '1', '1571886753', '1');
INSERT INTO `zp_auth_rule` VALUES ('296', '278', 'GET', 'Agent/add', '添加代理页面', '1', '1', '', '', '2', '1', '1571886753', '0');
INSERT INTO `zp_auth_rule` VALUES ('297', '278', 'GET', 'Agent/edit', '编辑代理页面', '1', '1', '', '', '1', '1', '1571886753', '0');
INSERT INTO `zp_auth_rule` VALUES ('274', '273', 'POST', 'Config/add', '添加参数保存', '1', '1', '', '', '3', '1', '1566920383', '0');
INSERT INTO `zp_auth_rule` VALUES ('273', '1', 'GET', 'Config/index', '系统参数', '1', '1', '', '', '5', '1', '1566122740', '1');
INSERT INTO `zp_auth_rule` VALUES ('275', '273', 'POST', 'Config/edit', '编辑参数保存', '1', '1', '', '', '50', '1', '1566920834', '0');
INSERT INTO `zp_auth_rule` VALUES ('277', '0', 'GET', 'Agent', '代理分站', '1', '1', 'icon-agent', '', '6', '1', '1571886753', '1');
INSERT INTO `zp_auth_rule` VALUES ('385', '328', 'GET', 'Resource/edit', '编辑资源页面', '1', '1', '', '', '50', '1', '1624418357', '0');
INSERT INTO `zp_auth_rule` VALUES ('336', '0', 'GET', 'Spread', '运营推广', '1', '1', 'icon-yingxiao', '', '5', '1', '1576200457', '1');
INSERT INTO `zp_auth_rule` VALUES ('337', '336', 'GET', 'Spread/index', '推广中心', '1', '1', null, '', '0', '1', '1576200457', '1');
INSERT INTO `zp_auth_rule` VALUES ('415', '28', 'GET', 'Articlesort/index', '文章分类', '1', '1', '', '', '6', '1', '1624755916', '1');
INSERT INTO `zp_auth_rule` VALUES ('346', '295', 'POST', 'Index/statinfo', '首页统计', '1', '1', null, '', '0', '1', '1576200457', '0');
INSERT INTO `zp_auth_rule` VALUES ('347', '295', 'POST', 'Index/dataView', '首页图表', '1', '1', null, '', '1', '1', '1576200457', '0');
INSERT INTO `zp_auth_rule` VALUES ('348', '278', 'GET', 'Agent/pwd', '修改密码页面', '1', '1', '', '', '3', '1', '1576200457', '0');
INSERT INTO `zp_auth_rule` VALUES ('365', '364', 'GET', 'User/index', '用户列表', '1', '1', '', '', '1', '1', '1622516318', '1');
INSERT INTO `zp_auth_rule` VALUES ('364', '0', 'GET', 'User', '用户管理', '1', '1', 'icon-user', '', '7', '1', '1622516051', '1');
INSERT INTO `zp_auth_rule` VALUES ('352', '337', 'POST', 'Spread/qrcodeUrl', '推广二维码', '1', '1', null, '', '1', '1', '1576200457', '0');
INSERT INTO `zp_auth_rule` VALUES ('353', '337', 'POST', 'Spread/shortUrl', '推广链接', '1', '1', null, '', '2', '1', '1576200457', '0');
INSERT INTO `zp_auth_rule` VALUES ('384', '328', 'GET', 'Resource/add', '添加资源页面', '1', '1', '', '', '50', '1', '1624418313', '0');
INSERT INTO `zp_auth_rule` VALUES ('383', '337', 'POST', 'Spread/setstatus', '启用/禁用资源', '1', '1', '', '', '6', '1', '1624417432', '0');
INSERT INTO `zp_auth_rule` VALUES ('357', '337', 'POST', 'Spread/del', '推广删除', '1', '1', null, '', '6', '1', '1576200457', '0');
INSERT INTO `zp_auth_rule` VALUES ('366', '364', 'GET', 'User/sviplist', 'SVIP设置', '1', '1', '', '', '2', '1', '1622527645', '1');
INSERT INTO `zp_auth_rule` VALUES ('367', '364', 'GET', 'User/privilege', '特权设置', '1', '1', '', '', '3', '1', '1622527823', '1');
INSERT INTO `zp_auth_rule` VALUES ('368', '342', 'GET', 'Order/list', '全部订单', '1', '1', '', '', '1', '1', '1622630582', '1');
INSERT INTO `zp_auth_rule` VALUES ('369', '342', 'GET', 'Order/rlist', '分润记录', '1', '1', '', '', '2', '1', '1622630683', '1');
INSERT INTO `zp_auth_rule` VALUES ('371', '342', 'GET', 'Order/tlist', '任务记录', '1', '1', '', '', '4', '1', '1622701665', '1');
INSERT INTO `zp_auth_rule` VALUES ('372', '342', 'GET', 'Order/ulist', '资源记录', '1', '1', '', '', '5', '1', '1622701757', '1');
INSERT INTO `zp_auth_rule` VALUES ('375', '277', 'GET', 'Cash/index', '提现列表', '1', '1', '', '', '2', '1', '1622794286', '1');
INSERT INTO `zp_auth_rule` VALUES ('377', '336', 'GET', 'Groups/index', '社群管理', '1', '1', '', '', '7', '1', '1622797699', '1');
INSERT INTO `zp_auth_rule` VALUES ('458', '336', 'GET', 'Pages/index', '移动端页面', '1', '1', '', '', '52', '1', '1639706332', '1');
INSERT INTO `zp_auth_rule` VALUES ('379', '336', 'GET', 'Jump/index', '跳转管理', '1', '1', '', '', '8', '1', '1623051149', '1');
INSERT INTO `zp_auth_rule` VALUES ('380', '0', 'GET', 'Adv', '广告管理', '1', '1', 'icon-plus', '', '7', '1', '1623206093', '1');
INSERT INTO `zp_auth_rule` VALUES ('381', '380', 'GET', 'Adv/adsense', '广告位管理', '1', '1', '', '', '1', '1', '1623206668', '1');
INSERT INTO `zp_auth_rule` VALUES ('382', '380', 'GET', 'Adv/advset', '广告位设置', '1', '1', '', '', '2', '1', '1623206778', '1');
INSERT INTO `zp_auth_rule` VALUES ('394', '366', 'GET', 'User/editsvip', '编辑SVIP页面', '1', '1', '', '', '5', '1', '1624419209', '0');
INSERT INTO `zp_auth_rule` VALUES ('395', '366', 'POST', 'User/delsvip', '删除SVIP', '1', '1', '', '', '50', '1', '1624419270', '0');
INSERT INTO `zp_auth_rule` VALUES ('396', '367', 'POST', 'User/saveprivilege', '保存特权设置', '1', '1', '', '', '3', '1', '1624419397', '0');
INSERT INTO `zp_auth_rule` VALUES ('397', '367', 'POST', 'User/delprivilege', '删除特权', '1', '1', '', '', '50', '1', '1624419444', '0');
INSERT INTO `zp_auth_rule` VALUES ('398', '365', 'POST', 'User/usersvip', 'svip升级记录', '1', '1', '', '', '50', '1', '1624419520', '0');
INSERT INTO `zp_auth_rule` VALUES ('399', '365', 'POST', 'User/bill', '余额变更记录', '1', '1', '', '', '50', '1', '1624419585', '0');
INSERT INTO `zp_auth_rule` VALUES ('400', '365', 'POST', 'User/userResource', '资源获取记录', '1', '1', '', '', '50', '1', '1624419652', '0');
INSERT INTO `zp_auth_rule` VALUES ('401', '377', 'POST', 'Groups/add', '添加社群保存', '1', '1', '', '', '50', '1', '1624419762', '0');
INSERT INTO `zp_auth_rule` VALUES ('402', '377', 'POST', 'Groups/edit', '编辑社群保存', '1', '1', '', '', '50', '1', '1624419798', '0');
INSERT INTO `zp_auth_rule` VALUES ('403', '377', 'POST', 'Groups/del', '删除社群', '1', '1', '', '', '50', '1', '1624419825', '0');
INSERT INTO `zp_auth_rule` VALUES ('404', '379', 'POST', 'Jump/add', '添加跳转保存', '1', '1', '', '', '50', '1', '1624419882', '0');
INSERT INTO `zp_auth_rule` VALUES ('406', '379', 'POST', 'Jump/edit', '编辑跳转保存', '1', '1', '', '', '50', '1', '1624420026', '0');
INSERT INTO `zp_auth_rule` VALUES ('407', '379', 'POST', 'Jump/del', '删除跳转', '1', '1', '', '', '50', '1', '1624420051', '0');
INSERT INTO `zp_auth_rule` VALUES ('408', '381', 'GET', 'Adv/saveadv', '添加/编辑广告位页面', '1', '1', '', '', '1', '1', '1624420290', '0');
INSERT INTO `zp_auth_rule` VALUES ('409', '381', 'POST', 'Adv/del', '删除广告', '1', '1', '', '', '50', '1', '1624429307', '0');
INSERT INTO `zp_auth_rule` VALUES ('410', '368', 'POST', 'Order/delorder', '删除订单', '1', '1', '', '', '50', '1', '1624429926', '0');
INSERT INTO `zp_auth_rule` VALUES ('411', '368', 'POST', 'Order/delnopay', '删除未支付订单', '1', '1', '', '', '50', '1', '1624430027', '0');
INSERT INTO `zp_auth_rule` VALUES ('412', '364', 'GET', 'Fundlist/index', '余额明细', '1', '1', '', '', '9', '1', '1624528816', '1');
INSERT INTO `zp_auth_rule` VALUES ('413', '277', 'GET', 'Agent/fundlist', '余额明细', '1', '1', '', '', '4', '1', '1624529507', '1');
INSERT INTO `zp_auth_rule` VALUES ('414', '373', 'GET', 'Usercash/list', '提现列表页面', '1', '1', '', '', '0', '1', '0', '0');
INSERT INTO `zp_auth_rule` VALUES ('416', '28', 'GET', 'Article/index', '文章管理', '1', '1', '', '', '8', '1', '1624755966', '1');
INSERT INTO `zp_auth_rule` VALUES ('476', '432', 'POST', 'kammi/add', '卡密添加保存', '1', '1', '', '', '2', '1', '1700658703', '0');
INSERT INTO `zp_auth_rule` VALUES ('418', '375', 'GET', 'Cash/add', '提现申请页面', '1', '1', '', '', '3', '1', '1624763487', '0');
INSERT INTO `zp_auth_rule` VALUES ('420', '480', 'GET', 'Cuscom/setting', '主题设置', '1', '1', '', '', '3', '1', '1624763487', '1');
INSERT INTO `zp_auth_rule` VALUES ('425', '337', 'POST', 'Spread/setUp', '推广设置', '1', '1', '', '', '3', '1', '1576200457', '0');
INSERT INTO `zp_auth_rule` VALUES ('422', '0', 'GET', 'Market', '资源市场', '1', '1', 'icon-book', '', '4', '1', '1630650100', '1');
INSERT INTO `zp_auth_rule` VALUES ('423', '422', 'GET', 'Market/index', '资源市场', '1', '1', '', '', '1', '1', '1630650167', '1');
INSERT INTO `zp_auth_rule` VALUES ('424', '422', 'GET', 'Market/news', '消息中心', '1', '1', '', '', '2', '1', '1630650202', '1');
INSERT INTO `zp_auth_rule` VALUES ('426', '337', 'GET', 'Spread/gettreesort', '获取资源分类', '1', '1', '', '', '4', '1', '1622717301', '0');
INSERT INTO `zp_auth_rule` VALUES ('427', '337', 'GET', 'Spread/groups', '社群列表页面', '1', '1', '', '', '7', '1', '1622717301', '0');
INSERT INTO `zp_auth_rule` VALUES ('428', '337', 'GET', 'Spread/jump', '跳转列表页面', '1', '1', '', '', '8', '1', '1622717301', '0');
INSERT INTO `zp_auth_rule` VALUES ('549', '377', 'GET', 'Groups/index', '社群列表', '1', '1', '', '', '0', '1', '1740999878', '0');
INSERT INTO `zp_auth_rule` VALUES ('431', '480', 'GET', 'Cuscom/poster', '海报设置', '1', '1', '', '', '4', '1', '1622717301', '1');
INSERT INTO `zp_auth_rule` VALUES ('432', '336', 'GET', 'Kammi/index', '卡密管理', '1', '1', '', '', '50', '1', '1632884245', '1');
INSERT INTO `zp_auth_rule` VALUES ('433', '481', 'GET', 'Widget/getResourceList', '资源列表', '1', '1', null, '', '6', '1', '1632884245', '0');
INSERT INTO `zp_auth_rule` VALUES ('434', '481', 'GET', 'Widget/getResourceSort', '资源分类', '1', '1', null, '', '7', '1', '1632884245', '0');
INSERT INTO `zp_auth_rule` VALUES ('435', '481', 'GET', 'Widget/getArticle', '文章列表', '1', '1', null, '', '6', '1', '1632884245', '0');
INSERT INTO `zp_auth_rule` VALUES ('436', '481', 'GET', 'Widget/getArticleSort', '文章分类', '1', '1', null, '', '7', '1', '1632884245', '0');
INSERT INTO `zp_auth_rule` VALUES ('437', '481', 'GET', 'Widget/getPages', '前端页面', '1', '1', null, '', '8', '1', '1632884245', '0');
INSERT INTO `zp_auth_rule` VALUES ('438', '481', 'GET', 'Widget/articleInfo', '文章内容', '1', '1', null, '', '9', '1', '1632884245', '0');
INSERT INTO `zp_auth_rule` VALUES ('439', '481', 'GET', 'Widget/spreadInfo', '资源内容', '1', '1', null, '', '11', '1', '1632884245', '0');
INSERT INTO `zp_auth_rule` VALUES ('440', '481', 'GET', 'Widget/articleSortInfo', '文章分类内容', '1', '1', null, '', '12', '1', '1632884245', '0');
INSERT INTO `zp_auth_rule` VALUES ('441', '481', 'GET', 'Widget/pageList', '页面列表', '1', '1', null, '', '13', '1', '1632884245', '0');
INSERT INTO `zp_auth_rule` VALUES ('442', '481', 'GET', 'Widget/tagNotice', '公告列表', '1', '1', null, '', '14', '1', '1632884245', '0');
INSERT INTO `zp_auth_rule` VALUES ('443', '481', 'GET', 'Widget/tagSpread', '推广列表', '1', '1', null, '', '15', '1', '1632884245', '0');
INSERT INTO `zp_auth_rule` VALUES ('444', '481', 'GET', 'Widget/tagSorts', '资源分类', '1', '1', null, '', '16', '1', '1632884245', '0');
INSERT INTO `zp_auth_rule` VALUES ('445', '365', 'POST', 'User/spread', '邀请用户列表', '1', '1', '', '', '16', '1', '1632884245', '0');
INSERT INTO `zp_auth_rule` VALUES ('446', '328', 'GET', 'Resource/gettreesort', '获取资源分类', '1', '1', '', '', '50', '1', '1639646255', '0');
INSERT INTO `zp_auth_rule` VALUES ('447', '328', 'GET', 'Resource/course', '课程列表页面', '1', '1', '', '', '10', '1', '1639649247', '0');
INSERT INTO `zp_auth_rule` VALUES ('448', '328', 'GET', 'Resource/addcourse', '添加课程页面', '1', '1', '', '', '7', '1', '1639649831', '0');
INSERT INTO `zp_auth_rule` VALUES ('449', '328', 'POST', 'Resource/savecourse', '保存课程', '1', '1', '', '', '8', '1', '1639650630', '0');
INSERT INTO `zp_auth_rule` VALUES ('450', '328', 'POST', 'Resource/delcourse', '删除课程', '1', '1', '', '', '50', '1', '1639650863', '0');
INSERT INTO `zp_auth_rule` VALUES ('451', '328', 'GET', 'Resource/kammi', '卡密列表页面', '1', '1', '', '', '13', '1', '1639651126', '0');
INSERT INTO `zp_auth_rule` VALUES ('452', '328', 'GET', 'Resource/addkammi', '添加卡密页面', '1', '1', '', '', '15', '1', '1639651540', '0');
INSERT INTO `zp_auth_rule` VALUES ('453', '328', 'POST', 'Resource/delkammi', '删除卡密', '1', '1', '', '', '50', '1', '1639706332', '0');
INSERT INTO `zp_auth_rule` VALUES ('454', '1', 'GET', 'Upgrade/index', '版本更新', '1', '1', '', '', '6', '1', '1641450649', '1');
INSERT INTO `zp_auth_rule` VALUES ('630', '377', 'GET', 'Groups/add', '添加社群页面', '1', '1', '', '', '50', '1', '1624419762', '0');
INSERT INTO `zp_auth_rule` VALUES ('456', '337', 'GET', 'Spread/selectgroup', '批量挂载社群页面', '1', '1', '', '', '14', '1', '1639706332', '0');
INSERT INTO `zp_auth_rule` VALUES ('457', '337', 'GET', 'Spread/selectjump', '批量挂载跳转页面', '1', '1', '', '', '16', '1', '1639706332', '0');
INSERT INTO `zp_auth_rule` VALUES ('459', '337', 'POST', 'Spread/posterUrl', '推广海报', '1', '1', null, '', '2', '1', '1576200457', '0');
INSERT INTO `zp_auth_rule` VALUES ('460', '327', 'GET', 'Library/index', '主资源库', '1', '1', '', '', '0', '1', '1586605249', '1');
INSERT INTO `zp_auth_rule` VALUES ('461', '327', 'GET', 'Level/index', '资源等级', '1', '1', '', '', '3', '1', '1586610178', '1');
INSERT INTO `zp_auth_rule` VALUES ('464', '28', 'GET', 'Swiper/index', '轮播管理', '1', '1', '', '', '3', '1', '1682604855', '1');
INSERT INTO `zp_auth_rule` VALUES ('465', '277', 'GET', 'Agent/order', '自助订单', '1', '1', '', '', '3', '1', '1682667287', '1');
INSERT INTO `zp_auth_rule` VALUES ('466', '28', 'GET', 'Links/index', '友情链接', '1', '1', '', '', '4', '1', '1684304480', '1');
INSERT INTO `zp_auth_rule` VALUES ('467', '278', 'GET', 'Agent/setting', '分站设置页面', '1', '1', '', '', '6', '1', '1684745243', '0');
INSERT INTO `zp_auth_rule` VALUES ('469', '295', 'GET', 'Ueditor/index', '文件上传', '1', '1', '', '', '3', '1', '1684747022', '0');
INSERT INTO `zp_auth_rule` VALUES ('470', '337', 'GET', 'Spread/batchlevel', '批量资源等级页面', '1', '1', '', '', '18', '1', '1695737483', '0');
INSERT INTO `zp_auth_rule` VALUES ('471', '1', 'GET', 'Wechat', '公众号设置', '1', '1', '', '', '2', '1', '1698221559', '1');
INSERT INTO `zp_auth_rule` VALUES ('472', '471', 'GET', 'Wechat/menus', '公众号菜单', '1', '1', '', '', '1', '1', '1698221644', '1');
INSERT INTO `zp_auth_rule` VALUES ('473', '471', 'GET', 'Wechat/words', '关键字回复', '1', '1', '', '', '2', '1', '1698222663', '1');
INSERT INTO `zp_auth_rule` VALUES ('474', '471', 'GET', 'Wechat/subscribe', '关注回复', '1', '1', '', '', '3', '1', '1698222708', '1');
INSERT INTO `zp_auth_rule` VALUES ('475', '471', 'GET', 'Wechat/received', '消息回复', '1', '1', '', '', '4', '1', '1698222736', '1');
INSERT INTO `zp_auth_rule` VALUES ('477', '432', 'POST', 'kammi/del', '卡密删除', '1', '1', '', '', '3', '1', '1700658744', '0');
INSERT INTO `zp_auth_rule` VALUES ('478', '337', 'POST', 'spread/courseposter', '推广资源海报', '1', '1', '', '', '4', '1', '1700836386', '0');
INSERT INTO `zp_auth_rule` VALUES ('479', '337', 'POST', 'spread/courseurl', '推广资源链接', '1', '1', '', '', '5', '1', '1700836534', '0');
INSERT INTO `zp_auth_rule` VALUES ('480', '0', 'GET', 'theme', '装修主题', '1', '1', 'icon-theme', '', '3', '1', '1702004358', '1');
INSERT INTO `zp_auth_rule` VALUES ('481', '480', 'GET', 'Cuscom/index', '移动装修', '1', '1', '', '', '1', '1', '1702004738', '1');
INSERT INTO `zp_auth_rule` VALUES ('483', '366', 'GET', 'user/getprivilege', 'SVIP特权列表', '1', '1', '', '', '4', '1', '1709175219', '0');
INSERT INTO `zp_auth_rule` VALUES ('551', '432', 'GET', 'Kammi/index', '卡密列表', '1', '1', '', '', '0', '1', '1741000478', '0');
INSERT INTO `zp_auth_rule` VALUES ('552', '460', 'GET', 'Library/index', '主资源库页面', '1', '1', '', '', '0', '1', '1741056224', '0');
INSERT INTO `zp_auth_rule` VALUES ('599', '466', 'GET', 'Links/index', '友情链接页面', '1', '1', '', '', '0', '1', '1741077298', '0');
INSERT INTO `zp_auth_rule` VALUES ('490', '366', 'POST', 'User/setVipUp', '设置SVIP状态', '1', '1', '', '', '5', '1', '1709714819', '0');
INSERT INTO `zp_auth_rule` VALUES ('491', '480', 'GET', 'Attachment/index', '素材中心', '1', '1', '', '', '5', '1', '1720141176', '1');
INSERT INTO `zp_auth_rule` VALUES ('492', '337', 'GET', 'Spread/batchSvip', '设置会员专享页面', '1', '1', '', '', '12', '1', '1727494431', '0');
INSERT INTO `zp_auth_rule` VALUES ('496', '491', 'POST', 'Attachment/delFile', '删除文件', '1', '1', '', '', '4', '1', '1727495555', '0');
INSERT INTO `zp_auth_rule` VALUES ('494', '491', 'GET', 'Attachment/getFileList', '文件列表', '1', '1', '', '', '1', '1', '1727495147', '0');
INSERT INTO `zp_auth_rule` VALUES ('495', '491', 'POST', 'Attachment/upload', '上传文件', '1', '1', '', '', '2', '1', '1727495372', '0');
INSERT INTO `zp_auth_rule` VALUES ('497', '491', 'POST', 'Attachment/delFiles', '批量删除', '1', '1', '', '', '4', '1', '1727495606', '0');
INSERT INTO `zp_auth_rule` VALUES ('498', '491', 'POST', 'Attachment/handleSort', '添加分类', '1', '1', '', '', '6', '1', '1727495637', '0');
INSERT INTO `zp_auth_rule` VALUES ('499', '491', 'POST', 'Attachment/delSort', '删除分类', '1', '1', '', '', '7', '1', '1727495678', '0');
INSERT INTO `zp_auth_rule` VALUES ('500', '491', 'GET', 'Attachment/getAttachSort', '素材分类', '1', '1', '', '', '7', '1', '1727495714', '0');
INSERT INTO `zp_auth_rule` VALUES ('501', '491', 'POST', 'Attachment/download', '素材下载', '1', '1', '', '', '8', '1', '1727495779', '0');
INSERT INTO `zp_auth_rule` VALUES ('502', '278', 'POST', 'Agent/setup', '代理-设置', '1', '1', '', '', '3', '1', '1728179788', '0');
INSERT INTO `zp_auth_rule` VALUES ('503', '481', 'GET', 'Widget/tagpages', '前端页面-分类', '1', '1', '', '', '9', '1', '1728274924', '0');
INSERT INTO `zp_auth_rule` VALUES ('504', '481', 'GET', 'Widget/tagpagechild', '前端页面-列表', '1', '1', '', '', '8', '1', '1728274967', '0');
INSERT INTO `zp_auth_rule` VALUES ('507', '481', 'GET', 'Widget/tagNoticeSort', '文章分类', '1', '1', null, '', '13', '1', '1632884245', '0');
INSERT INTO `zp_auth_rule` VALUES ('508', '273', 'GET', 'Config/index', '参数列表', '1', '1', '', '', '0', '1', '1740383169', '0');
INSERT INTO `zp_auth_rule` VALUES ('509', '273', 'POST', 'Config/del', '删除参数', '1', '1', '', '', '50', '1', '1566920834', '0');
INSERT INTO `zp_auth_rule` VALUES ('510', '273', 'POST', 'Config/setup', '设置参数', '1', '1', '', '', '50', '1', '1740383409', '0');
INSERT INTO `zp_auth_rule` VALUES ('511', '2', 'GET', 'Setting/index', '全局设置', '1', '1', '', '', '1', '1', '1740383711', '0');
INSERT INTO `zp_auth_rule` VALUES ('512', '2', 'POST', 'Setting/index', '设置保存', '1', '1', '', '', '2', '1', '1740384166', '0');
INSERT INTO `zp_auth_rule` VALUES ('625', '337', 'POST', 'Spread/batchMoney', '推广价格保存', '1', '1', '', '', '10', '1', '1741156414', '0');
INSERT INTO `zp_auth_rule` VALUES ('622', '481', 'GET', 'Cuscom/saveTheme', '设置装修页面', '1', '1', '', '', '2', '1', '1741141637', '0');
INSERT INTO `zp_auth_rule` VALUES ('548', '431', 'POST', 'Cuscom/poster', '海报设置保存', '1', '1', '', '', '5', '1', '1740999819', '0');
INSERT INTO `zp_auth_rule` VALUES ('550', '379', 'GET', 'Jump/index', '跳转列表', '1', '1', '', '', '0', '1', '1741000287', '0');
INSERT INTO `zp_auth_rule` VALUES ('547', '431', 'GET', 'Cuscom/poster', '推广海报页面', '1', '1', '', '', '3', '1', '1740997526', '0');
INSERT INTO `zp_auth_rule` VALUES ('553', '460', 'POST', 'Library/synsAll', '资源同步操作', '1', '1', '', '', '1', '1', '1741056306', '0');
INSERT INTO `zp_auth_rule` VALUES ('524', '473', 'POST', 'Wechat/setupw', '设置状态', '1', '1', '', '', '5', '1', '1740983342', '0');
INSERT INTO `zp_auth_rule` VALUES ('513', '472', 'GET', 'Wechat/menus', '公众号菜单页面', '1', '1', '', '', '1', '1', '1740982220', '0');
INSERT INTO `zp_auth_rule` VALUES ('514', '472', 'POST', 'Wechat/menus', '保存菜单配置', '1', '1', '', '', '2', '1', '1740982563', '0');
INSERT INTO `zp_auth_rule` VALUES ('515', '473', 'GET', 'Wechat/words', '关键字列表', '1', '1', '', '', '0', '1', '1740982664', '0');
INSERT INTO `zp_auth_rule` VALUES ('516', '473', 'POST', 'Wechat/addwords', '添加关键字保存', '1', '1', '', '', '1', '1', '1740982705', '0');
INSERT INTO `zp_auth_rule` VALUES ('517', '473', 'POST', 'Wechat/editwords', '编辑关键字保存', '1', '1', '', '', '4', '1', '1740982757', '0');
INSERT INTO `zp_auth_rule` VALUES ('518', '473', 'POST', 'Wechat/delwords', '删除关键字', '1', '1', '', '', '4', '1', '1740982789', '0');
INSERT INTO `zp_auth_rule` VALUES ('519', '474', 'GET', 'Wechat/subscribe', '关注回复页面', '1', '1', '', '', '1', '1', '1740982850', '0');
INSERT INTO `zp_auth_rule` VALUES ('520', '474', 'POST', 'Wechat/subscribe', '保存回复设置', '1', '1', '', '', '2', '1', '1740982900', '0');
INSERT INTO `zp_auth_rule` VALUES ('521', '471', 'POST', 'Wechat/uploadMedia', '上传媒体素材', '1', '1', '', '', '6', '1', '1740982962', '0');
INSERT INTO `zp_auth_rule` VALUES ('522', '475', 'GET', 'Wechat/received', '消息回复页面', '1', '1', '', '', '1', '1', '1740983099', '0');
INSERT INTO `zp_auth_rule` VALUES ('523', '475', 'POST', 'Wechat/received', '保存回复设置', '1', '1', '', '', '2', '1', '1740983128', '0');
INSERT INTO `zp_auth_rule` VALUES ('525', '454', 'GET', 'Upgrade/index', '更新页面', '1', '1', '', '', '1', '1', '1740986375', '0');
INSERT INTO `zp_auth_rule` VALUES ('526', '454', 'POST', 'Upgrade/getUpList', '获取更新文件', '1', '1', '', '', '1', '1', '1740986461', '0');
INSERT INTO `zp_auth_rule` VALUES ('527', '454', 'POST', 'Upgrade/updateFile', '下载更新文件', '1', '1', '', '', '3', '1', '1740986508', '0');
INSERT INTO `zp_auth_rule` VALUES ('528', '18', 'GET', 'Auth/adminRule', '权限列表', '1', '1', '', '', '0', '1', '1740990360', '0');
INSERT INTO `zp_auth_rule` VALUES ('529', '16', 'GET', 'Auth/adminList', '列表页面', '1', '1', '', '', '0', '1', '1740990405', '0');
INSERT INTO `zp_auth_rule` VALUES ('530', '17', 'GET', 'Auth/adminGroup', '列表页面', '1', '1', '', '', '0', '1', '1740990468', '0');
INSERT INTO `zp_auth_rule` VALUES ('531', '481', 'GET', 'Cuscom/index', '装修列表', '1', '1', '', '', '0', '1', '1740991138', '0');
INSERT INTO `zp_auth_rule` VALUES ('532', '481', 'POST', 'Cuscom/saveTheme', '保存装修', '1', '1', '', '', '2', '1', '1740991398', '0');
INSERT INTO `zp_auth_rule` VALUES ('533', '481', 'POST', 'Cuscom/del', '删除装修', '1', '1', '', '', '2', '1', '1740991439', '0');
INSERT INTO `zp_auth_rule` VALUES ('534', '481', 'POST', 'Cuscom/saveUserConfig', '保存个人中心', '1', '1', '', '', '4', '1', '1740991508', '0');
INSERT INTO `zp_auth_rule` VALUES ('535', '481', 'POST', 'Cuscom/saveSortConfig', '保存分类设置', '1', '1', '', '', '5', '1', '1740991545', '0');
INSERT INTO `zp_auth_rule` VALUES ('536', '481', 'POST', 'Cuscom/changetemp', '设置为首页', '1', '1', '', '', '3', '1', '1740991971', '0');
INSERT INTO `zp_auth_rule` VALUES ('537', '423', 'GET', 'Market/index', '资源列表', '1', '1', '', '', '0', '1', '1740992310', '0');
INSERT INTO `zp_auth_rule` VALUES ('538', '423', 'POST', 'Market/register', '入驻资源市场保存', '1', '1', '', '', '2', '1', '1740992401', '0');
INSERT INTO `zp_auth_rule` VALUES ('539', '423', 'GET', 'Market/cart', '购物车列表', '1', '1', '', '', '3', '1', '1740992450', '0');
INSERT INTO `zp_auth_rule` VALUES ('540', '423', 'POST', 'Market/batchCart', '批量到购物车', '1', '1', '', '', '4', '1', '1740992501', '0');
INSERT INTO `zp_auth_rule` VALUES ('541', '423', 'POST', 'Market/addcart', '添加到购物车', '1', '1', '', '', '5', '1', '1740994272', '0');
INSERT INTO `zp_auth_rule` VALUES ('542', '423', 'POST', 'Market/addcart', '购物车结算', '1', '1', '', '', '6', '1', '1740995998', '0');
INSERT INTO `zp_auth_rule` VALUES ('543', '424', 'GET', 'Market/news', '消息列表页面', '1', '1', '', '', '0', '1', '1740996131', '0');
INSERT INTO `zp_auth_rule` VALUES ('544', '337', 'GET', 'Spread/index', '推广列表', '1', '1', '', '', '0', '1', '1740996512', '0');
INSERT INTO `zp_auth_rule` VALUES ('545', '420', 'GET', 'Cuscom/setting', '主题设置页面', '1', '1', '', '', '0', '1', '1740996725', '0');
INSERT INTO `zp_auth_rule` VALUES ('546', '420', 'POST', 'Cuscom/setting', '主题设置保存', '1', '1', '', '', '1', '1', '1740996776', '0');
INSERT INTO `zp_auth_rule` VALUES ('554', '460', 'GET', 'Library/info', '资源详情', '1', '1', '', '', '3', '1', '1741056342', '0');
INSERT INTO `zp_auth_rule` VALUES ('555', '328', 'GET', 'Resource/index', '资源列表页面', '1', '1', '', '', '0', '1', '1741056633', '0');
INSERT INTO `zp_auth_rule` VALUES ('556', '328', 'POST', 'Resource/add', '添加资源保存', '1', '1', '', '', '5', '1', '1741058945', '0');
INSERT INTO `zp_auth_rule` VALUES ('557', '328', 'POST', 'Resource/edit', '编辑资源保存', '1', '1', '', '', '6', '1', '1741058973', '0');
INSERT INTO `zp_auth_rule` VALUES ('558', '329', 'GET', 'Resource/sort', '资源分类列表', '1', '1', '', '', '0', '1', '1741059095', '0');
INSERT INTO `zp_auth_rule` VALUES ('559', '328', 'POST', 'Resource/addkammi', '添加卡密保存', '1', '1', '', '', '17', '1', '1741060294', '0');
INSERT INTO `zp_auth_rule` VALUES ('560', '461', 'GET', 'Level/index', '资源等级列表', '1', '1', '', '', '0', '1', '1741060409', '0');
INSERT INTO `zp_auth_rule` VALUES ('561', '461', 'GET', 'Level/add', '添加资源等级页面', '1', '1', '', '', '1', '1', '1741060457', '0');
INSERT INTO `zp_auth_rule` VALUES ('562', '461', 'POST', 'Level/add', '添加资源等级保存', '1', '1', '', '', '2', '1', '1741060485', '0');
INSERT INTO `zp_auth_rule` VALUES ('563', '461', 'GET', 'Level/edit', '编辑资源等级页面', '1', '1', '', '', '3', '1', '1741060528', '0');
INSERT INTO `zp_auth_rule` VALUES ('564', '461', 'POST', 'Level/edit', '编辑资源等级保存', '1', '1', '', '', '4', '1', '1741060560', '0');
INSERT INTO `zp_auth_rule` VALUES ('565', '461', 'POST', 'Level/del', '删除资源等级', '1', '1', '', '', '5', '1', '1741060587', '0');
INSERT INTO `zp_auth_rule` VALUES ('566', '461', 'POST', 'Level/setUp', '设置等级状态', '1', '1', '', '', '7', '1', '1741065863', '0');
INSERT INTO `zp_auth_rule` VALUES ('567', '278', 'GET', 'Agent/index', '代理列表页面', '1', '1', '', '', '0', '1', '1741069512', '0');
INSERT INTO `zp_auth_rule` VALUES ('568', '278', 'POST', 'Agent/add', '添加代理保存', '1', '1', '', '', '3', '1', '1741070974', '0');
INSERT INTO `zp_auth_rule` VALUES ('569', '278', 'POST', 'Agent/edit', '编辑代理保存', '1', '1', '', '', '4', '1', '1741071020', '0');
INSERT INTO `zp_auth_rule` VALUES ('570', '278', 'POST', 'Agent/setting', '分站设置保存', '1', '1', '', '', '5', '1', '1741071364', '0');
INSERT INTO `zp_auth_rule` VALUES ('571', '278', 'POST', 'Agent/pwd', '修改密码保存', '1', '1', '', '', '3', '1', '1741071897', '0');
INSERT INTO `zp_auth_rule` VALUES ('572', '375', 'GET', 'Cash/index', '提现列表页面', '1', '1', '', '', '0', '1', '1741072520', '0');
INSERT INTO `zp_auth_rule` VALUES ('573', '375', 'POST', 'Cash/passed', '提现审核操作', '1', '1', '', '', '2', '1', '1741072610', '0');
INSERT INTO `zp_auth_rule` VALUES ('574', '375', 'POST', 'Cash/del', '删除提现', '1', '1', '', '', '5', '1', '1741072854', '0');
INSERT INTO `zp_auth_rule` VALUES ('575', '375', 'POST', 'Cash/add', '提现申请保存', '1', '1', '', '', '4', '1', '1741072936', '0');
INSERT INTO `zp_auth_rule` VALUES ('576', '365', 'GET', 'User/index', '用户列表页面', '1', '1', '', '', '0', '1', '1741073171', '0');
INSERT INTO `zp_auth_rule` VALUES ('577', '365', 'GET', 'User/setsvip', '设置会员页面', '1', '1', '', '', '3', '1', '1741073313', '0');
INSERT INTO `zp_auth_rule` VALUES ('578', '365', 'POST', 'User/setsvip', '设置会员保存', '1', '1', '', '', '4', '1', '1741073354', '0');
INSERT INTO `zp_auth_rule` VALUES ('579', '366', 'GET', 'User/sviplist', 'SVIP设置页面', '1', '1', '', '', '0', '1', '1741073510', '0');
INSERT INTO `zp_auth_rule` VALUES ('580', '366', 'POST', 'User/addsvip', '添加SVIP保存', '1', '1', '', '', '6', '1', '1741073614', '0');
INSERT INTO `zp_auth_rule` VALUES ('581', '366', 'POST', 'User/editsvip', '编辑SVIP保存', '1', '1', '', '', '5', '1', '1741073661', '0');
INSERT INTO `zp_auth_rule` VALUES ('582', '367', 'GET', 'User/privilege', '特权列表页面', '1', '1', '', '', '0', '1', '1741073745', '0');
INSERT INTO `zp_auth_rule` VALUES ('585', '373', 'POST', 'Usercash/finished', '完成打款操作', '1', '1', '', '', '3', '1', '1741075997', '0');
INSERT INTO `zp_auth_rule` VALUES ('584', '367', 'GET', 'User/saveprivilege', '添加编辑特权页面', '1', '1', '', '', '4', '1', '1741075092', '0');
INSERT INTO `zp_auth_rule` VALUES ('586', '373', 'POST', 'Usercash/del', '删除提现记录', '1', '1', '', '', '5', '1', '1741076128', '0');
INSERT INTO `zp_auth_rule` VALUES ('587', '381', 'GET', 'Adv/adsense', '广告位管理页面', '1', '1', '', '', '0', '1', '1741076299', '0');
INSERT INTO `zp_auth_rule` VALUES ('588', '381', 'POST', 'Adv/saveadv', '添加/编辑广告位保存', '1', '1', '', '', '2', '1', '1741076427', '0');
INSERT INTO `zp_auth_rule` VALUES ('589', '382', 'GET', 'Adv/advset', '广告位设置页面', '1', '1', '', '', '0', '1', '1741076579', '0');
INSERT INTO `zp_auth_rule` VALUES ('590', '382', 'POST', 'Adv/advset', '广告位设置保存', '1', '1', '', '', '1', '1', '1741076702', '0');
INSERT INTO `zp_auth_rule` VALUES ('591', '368', 'GET', 'Order/list', '订单列表页面', '1', '1', '', '', '0', '1', '1741076840', '0');
INSERT INTO `zp_auth_rule` VALUES ('592', '464', 'GET', 'Swiper/index', '轮播管理页面', '1', '1', '', '', '0', '1', '1741077298', '0');
INSERT INTO `zp_auth_rule` VALUES ('593', '464', 'GET', 'Swiper/add', '添加轮播页面', '1', '1', '', '', '1', '1', '1741077386', '0');
INSERT INTO `zp_auth_rule` VALUES ('594', '464', 'POST', 'Swiper/add', '添加轮播保存', '1', '1', '', '', '2', '1', '1741077405', '0');
INSERT INTO `zp_auth_rule` VALUES ('595', '464', 'GET', 'Swiper/edit', '编辑轮播页面', '1', '1', '', '', '3', '1', '1741077447', '0');
INSERT INTO `zp_auth_rule` VALUES ('596', '464', 'POST', 'Swiper/edit', '编辑轮播保存', '1', '1', '', '', '4', '1', '1741077468', '0');
INSERT INTO `zp_auth_rule` VALUES ('597', '464', 'POST', 'Swiper/del', '删除轮播图片', '1', '1', '', '', '5', '1', '1741077484', '0');
INSERT INTO `zp_auth_rule` VALUES ('598', '464', 'POST', 'Swiper/setUp', '设置轮播图片', '1', '1', '', '', '6', '1', '1741077517', '0');
INSERT INTO `zp_auth_rule` VALUES ('600', '466', 'GET', 'Links/add', '添加链接页面', '1', '1', '', '', '1', '1', '1741077386', '0');
INSERT INTO `zp_auth_rule` VALUES ('601', '466', 'POST', 'Links/add', '添加链接保存', '1', '1', '', '', '2', '1', '1741077405', '0');
INSERT INTO `zp_auth_rule` VALUES ('602', '466', 'GET', 'Links/edit', '编辑链接页面', '1', '1', '', '', '3', '1', '1741077447', '0');
INSERT INTO `zp_auth_rule` VALUES ('603', '466', 'POST', 'Links/edit', '编辑链接保存', '1', '1', '', '', '4', '1', '1741077468', '0');
INSERT INTO `zp_auth_rule` VALUES ('604', '466', 'POST', 'Links/del', '删除友情链接', '1', '1', '', '', '5', '1', '1741077484', '0');
INSERT INTO `zp_auth_rule` VALUES ('605', '466', 'POST', 'Links/setUp', '设置友情链接', '1', '1', '', '', '6', '1', '1741077517', '0');
INSERT INTO `zp_auth_rule` VALUES ('606', '466', 'GET', 'Links/index', '友情链接页面', '1', '1', '', '', '0', '1', '1741077298', '0');
INSERT INTO `zp_auth_rule` VALUES ('607', '415', 'GET', 'Articlesort/add', '添加文章分类', '1', '1', '', '', '1', '1', '1741077386', '0');
INSERT INTO `zp_auth_rule` VALUES ('608', '415', 'POST', 'Articlesort/add', '添加分类保存', '1', '1', '', '', '2', '1', '1741077405', '0');
INSERT INTO `zp_auth_rule` VALUES ('609', '415', 'GET', 'Articlesort/edit', '编辑分类页面', '1', '1', '', '', '3', '1', '1741077447', '0');
INSERT INTO `zp_auth_rule` VALUES ('610', '415', 'POST', 'Articlesort/edit', '编辑分类保存', '1', '1', '', '', '4', '1', '1741077468', '0');
INSERT INTO `zp_auth_rule` VALUES ('611', '415', 'POST', 'Articlesort/del', '删除文章分类', '1', '1', '', '', '5', '1', '1741077484', '0');
INSERT INTO `zp_auth_rule` VALUES ('612', '415', 'POST', 'Articlesort/setUp', '设置文章分类', '1', '1', '', '', '6', '1', '1741077517', '0');
INSERT INTO `zp_auth_rule` VALUES ('613', '415', 'GET', 'Articlesort/index', '文章分类页面', '1', '1', '', '', '0', '1', '1741077298', '0');
INSERT INTO `zp_auth_rule` VALUES ('614', '416', 'POST', 'Article/add', '添加文章保存', '1', '1', '', '', '2', '1', '1741077405', '0');
INSERT INTO `zp_auth_rule` VALUES ('615', '416', 'GET', 'Article/add', '添加文章内容', '1', '1', '', '', '1', '1', '1741077386', '0');
INSERT INTO `zp_auth_rule` VALUES ('616', '416', 'GET', 'Article/edit', '编辑文章页面', '1', '1', '', '', '3', '1', '1741077447', '0');
INSERT INTO `zp_auth_rule` VALUES ('617', '416', 'POST', 'Article/edit', '编辑文章保存', '1', '1', '', '', '4', '1', '1741077468', '0');
INSERT INTO `zp_auth_rule` VALUES ('618', '416', 'POST', 'Article/del', '删除文章内容', '1', '1', '', '', '5', '1', '1741077484', '0');
INSERT INTO `zp_auth_rule` VALUES ('619', '416', 'POST', 'Article/setUp', '设置文章内容', '1', '1', '', '', '6', '1', '1741077517', '0');
INSERT INTO `zp_auth_rule` VALUES ('620', '416', 'GET', 'Article/index', '文章列表页面', '1', '1', '', '', '0', '1', '1741077298', '0');
INSERT INTO `zp_auth_rule` VALUES ('621', '472', 'POST', 'Wechat/menus', '获取菜单配置', '1', '1', '', '', '1', '1', '1740982563', '0');
INSERT INTO `zp_auth_rule` VALUES ('623', '337', 'GET', 'Spread/edit', '编辑资源页面', '1', '1', '', '', '3', '1', '1741146866', '0');
INSERT INTO `zp_auth_rule` VALUES ('624', '337', 'POST', 'Spread/edit', '编辑资源保存', '1', '1', '', '', '3', '1', '1741146897', '0');
INSERT INTO `zp_auth_rule` VALUES ('626', '337', 'POST', 'Spread/batchSvip', '设置会员专享保存', '1', '1', '', '', '13', '1', '1741157710', '0');
INSERT INTO `zp_auth_rule` VALUES ('627', '337', 'POST', 'Spread/batchlevel', '批量资源等级保存', '1', '1', '', '', '19', '1', '1741157994', '0');
INSERT INTO `zp_auth_rule` VALUES ('628', '337', 'POST', 'Spread/selectjump', '批量挂载跳转保存', '1', '1', '', '', '17', '1', '1741158927', '0');
INSERT INTO `zp_auth_rule` VALUES ('629', '337', 'POST', 'Spread/selectgroup', '批量挂载社群保存', '1', '1', '', '', '15', '1', '1741159532', '0');
INSERT INTO `zp_auth_rule` VALUES ('631', '377', 'GET', 'Groups/edit', '编辑社群页面', '1', '1', '', '', '50', '1', '1624419762', '0');
INSERT INTO `zp_auth_rule` VALUES ('632', '337', 'GET', 'Spread/batchRetail', '批量分销页面', '1', '1', '', '', '20', '1', '1741161662', '0');
INSERT INTO `zp_auth_rule` VALUES ('633', '337', 'POST', 'Spread/batchRetail', '批量分销保存', '1', '1', '', '', '21', '1', '1741161708', '0');
INSERT INTO `zp_auth_rule` VALUES ('634', '379', 'GET', 'Jump/add', '添加跳转页面', '1', '1', '', '', '50', '1', '1624420026', '0');
INSERT INTO `zp_auth_rule` VALUES ('635', '379', 'GET', 'Jump/edit', '编辑跳转页面', '1', '1', '', '', '50', '1', '1624420026', '0');
INSERT INTO `zp_auth_rule` VALUES ('636', '432', 'GET', 'kammi/add', '卡密添加页面', '1', '1', '', '', '1', '1', '1700658703', '0');
INSERT INTO `zp_auth_rule` VALUES ('637', '329', 'POST', 'Resource/editsort', '编辑分类保存', '1', '1', '', '', '50', '1', '1624418627', '0');
INSERT INTO `zp_auth_rule` VALUES ('638', '329', 'POST', 'Resource/addsort', '添加分类保存', '1', '1', '', '', '50', '1', '1624418627', '0');
INSERT INTO `zp_auth_rule` VALUES ('639', '365', 'POST', 'User/del', '删除用户', '1', '1', '', '', '5', '1', '1741162913', '0');
INSERT INTO `zp_auth_rule` VALUES ('640', '423', 'GET', 'Market/register', '入驻资源市场页面', '1', '1', '', '', '1', '1', '1741252192', '0');
INSERT INTO `zp_auth_rule` VALUES ('641', '473', 'GET', 'Wechat/addwords', '添加关键字页面', '1', '1', '', '', '2', '1', '1741254002', '0');
INSERT INTO `zp_auth_rule` VALUES ('642', '473', 'GET', 'Wechat/editwords', '编辑关键字页面', '1', '1', '', '', '3', '1', '1741254028', '0');
INSERT INTO `zp_auth_rule` VALUES ('643', '273', 'GET', 'Config/add', '添加参数页面', '1', '1', '', '', '2', '1', '1741254245', '0');
INSERT INTO `zp_auth_rule` VALUES ('644', '273', 'GET', 'Config/edit', '编辑参数页面', '1', '1', '', '', '4', '1', '1741254271', '0');
INSERT INTO `zp_auth_rule` VALUES ('645', '278', 'GET', 'Agent/recharge', '余额充值页面', '1', '1', '', '', '6', '1', '1684745243', '0');
INSERT INTO `zp_auth_rule` VALUES ('646', '278', 'POST', 'Agent/recharge', '余额充值保存', '1', '1', '', '', '5', '1', '1741071364', '0');
INSERT INTO `zp_auth_rule` VALUES ('647', '278', 'GET', 'Agent/personal', '资料编辑页面', '1', '1', '', '', '0', '1', '1576200457', '0');
INSERT INTO `zp_auth_rule` VALUES ('648', '278', 'POST', 'Agent/cleanUp', '清空推广资源', '1', '1', '', '', '0', '1', '1576200457', '0');
INSERT INTO `zp_auth_rule` VALUES ('650', '367', 'POST', 'User/setPriUp', '设置特权', '1', '1', '', '', '50', '1', '1624419444', '0');
INSERT INTO `zp_auth_rule` VALUES ('651', '337', 'POST', 'Spread/clearDel', '清空推广', '1', '1', null, '', '6', '1', '1576200457', '0');
INSERT INTO `zp_auth_rule` VALUES ('652', '1', 'GET', 'Setting/storage', '存储设置', '1', '1', '', '', '3', '1', '1746601442', '1');
INSERT INTO `zp_auth_rule` VALUES ('653', '652', 'GET', 'Setting/storage', '存储设置页面', '1', '1', '', '', '1', '1', '1746601526', '0');
INSERT INTO `zp_auth_rule` VALUES ('654', '652', 'POST', 'Setting/storage', '存储设置保存', '1', '1', '', '', '2', '1', '1746601551', '0');
INSERT INTO `zp_auth_rule` VALUES ('655', '328', 'POST', 'Resource/copys', '资源复制', '1', '1', '', '', '22', '1', '1747897232', '0');
INSERT INTO `zp_auth_rule` VALUES ('656', '328', 'POST', 'Resource/setsort', '批量资源分类', '1', '1', '', '', '23', '1', '1747897340', '0');
INSERT INTO `zp_auth_rule` VALUES ('657', '328', 'GET', 'Resource/batch', '批量导入页面', '1', '1', '', '', '26', '1', '1748330896', '0');
INSERT INTO `zp_auth_rule` VALUES ('658', '328', 'POST', 'Resource/batch', '批量导入保存', '1', '1', '', '', '26', '1', '1748330932', '0');
INSERT INTO `zp_auth_rule` VALUES ('659', '365', 'GET', 'User/spread', '邀请用户页面', '1', '1', '', '', '15', '1', '1749732809', '0');
INSERT INTO `zp_auth_rule` VALUES ('660', '365', 'GET', 'User/usersvip', 'SVIP记录页面', '1', '1', '', '', '50', '1', '1749732870', '0');
INSERT INTO `zp_auth_rule` VALUES ('661', '365', 'GET', 'User/bill', '余额记录页面', '1', '1', '', '', '50', '1', '1749732900', '0');
INSERT INTO `zp_auth_rule` VALUES ('662', '365', 'GET', 'User/userResource', '资源记录页面', '1', '1', '', '', '50', '1', '1749732936', '0');
INSERT INTO `zp_auth_rule` VALUES ('663', '328', 'GET', 'Resource/savecourse', '课程保存页面', '1', '1', '', '', '9', '1', '1749805804', '0');
INSERT INTO `zp_auth_rule` VALUES ('664', '337', 'GET', 'Spread/batchsales', '推广销量页面', '1', '1', '', '', '9', '1', '1576200457', '0');
INSERT INTO `zp_auth_rule` VALUES ('665', '337', 'POST', 'Spread/batchsales', '推广销量保存', '1', '1', '', '', '10', '1', '1741156414', '0');
INSERT INTO `zp_auth_rule` VALUES ('666', '337', 'GET', 'Spread/batchinvites', '推广邀请人数页面', '1', '1', '', '', '9', '1', '1576200457', '0');
INSERT INTO `zp_auth_rule` VALUES ('667', '337', 'POST', 'Spread/batchinvites', '推广邀请人数保存', '1', '1', '', '', '10', '1', '1741156414', '0');

-- ----------------------------
-- Table structure for zp_bill
-- ----------------------------
DROP TABLE IF EXISTS `zp_bill`;
CREATE TABLE `zp_bill` (
`id` int(10) unsigned NOT NULL AUTO_INCREMENT,
`admin_id` int(10) unsigned DEFAULT '0' COMMENT '代理ID',
`pid` int(11) DEFAULT '0' COMMENT '推广人id',
`type` tinyint(3) unsigned DEFAULT '0' COMMENT '类型，1资源收益，2会员收益，3提现',
`mode` tinyint(1) unsigned NOT NULL DEFAULT '0' COMMENT '模式，1：增加，2：减少',
`before` decimal(12,2) unsigned NOT NULL DEFAULT '0.00' COMMENT '操作前余额',
`money` decimal(12,2) unsigned NOT NULL DEFAULT '0.00' COMMENT '金额',
`after` decimal(12,2) unsigned NOT NULL DEFAULT '0.00' COMMENT '操作后余额',
`remark` varchar(200) DEFAULT NULL COMMENT '备注',
`order_id` int(10) unsigned DEFAULT '0' COMMENT '业务ID',
`uid` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '用户ID',
`ctime` int(10) unsigned DEFAULT '0' COMMENT '创建时间',
PRIMARY KEY (`id`),
KEY `idx_user` (`admin_id`,`uid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COMMENT='余额操作日志';

-- ----------------------------
-- Table structure for zp_cash
-- ----------------------------
DROP TABLE IF EXISTS `zp_cash`;
CREATE TABLE `zp_cash` (
`id` int(11) unsigned NOT NULL AUTO_INCREMENT,
`type` tinyint(1) unsigned NOT NULL DEFAULT '0' COMMENT '方式:1=支付宝,2=微信,3=其他',
`pid` int(11) unsigned NOT NULL DEFAULT '0' COMMENT '上级代理ID',
`money` decimal(11,2) unsigned DEFAULT '0.00' COMMENT '提现余额',
`fee` decimal(11,2) unsigned DEFAULT '0.00' COMMENT '手续费',
`amount` decimal(11,2) unsigned DEFAULT '0.00' COMMENT '实际付款金额',
`image` varchar(128) DEFAULT NULL COMMENT '收款码',
`remark` varchar(256) DEFAULT NULL COMMENT '备注',
`bank` varchar(64) DEFAULT NULL COMMENT '开户行',
`truename` varchar(32) DEFAULT NULL COMMENT '开户名',
`bankno` varchar(32) DEFAULT NULL COMMENT '银行卡号',
`reason` varchar(256) DEFAULT NULL COMMENT '审核操作原因',
`status` tinyint(2) NOT NULL DEFAULT '0' COMMENT '审核状态:0=审核中,1=通过,-1=不通过,2=已打款(完成)',
`uid` int(11) unsigned NOT NULL DEFAULT '0' COMMENT '申请提现用户',
`utime` int(11) unsigned NOT NULL DEFAULT '0' COMMENT '审核时间',
`ctime` int(11) unsigned NOT NULL DEFAULT '0' COMMENT '申请时间',
PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COMMENT='代理提现明细';

-- ----------------------------
-- Records of zp_cash
-- ----------------------------

-- ----------------------------
-- Table structure for zp_config
-- ----------------------------
DROP TABLE IF EXISTS `zp_config`;
CREATE TABLE `zp_config` (
 `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
 `group` varchar(50) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '所属分组',
 `types` varchar(20) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '类型',
 `title` varchar(35) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '配置标题',
 `name` varchar(35) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '配置项名称',
 `values` varchar(280) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '配置值',
 `default` varchar(500) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '默认值',
 `remark` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '备注说明',
 `indexid` int(10) unsigned DEFAULT '0' COMMENT '排序',
 `status` tinyint(1) unsigned DEFAULT NULL COMMENT '状态，1启用，0禁用',
 `ctime` int(10) unsigned DEFAULT NULL COMMENT '0',
 PRIMARY KEY (`id`),
 KEY `idx_group` (`group`) USING BTREE
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='参数配置表';

-- ----------------------------
-- Records of zp_config
-- ----------------------------
INSERT INTO `zp_config` VALUES ('1', 'system', 'array', '配置分组', 'group', '', '项目设置|web\n系统设置|system\n微信小程序|wechat\n微信公众号|account\n支付宝设置|alipay\n提现设置|cash\n短信设置|sms\n业务设置|other\n代理分站设置|agent\n电脑端设置|coms', '', '1', '1', null);
INSERT INTO `zp_config` VALUES ('2', 'web', 'text', '项目名称', 'web_name', '', '智创云享', '', '1', '1', null);
INSERT INTO `zp_config` VALUES ('4', 'web', 'image', '项目LOGO', 'web_logo', '', '/static/admin/images/default.png', '项目LOGO，尺寸：208px×208px', '2', '1', '1566211774');
INSERT INTO `zp_config` VALUES ('5', 'web', 'text', '项目域名', 'web_domain', '', '', '域名例：www.baidu.com', '4', '1', '1566211857');
INSERT INTO `zp_config` VALUES ('55', 'wechat', 'text', '小程序AppSecret', 'app_secret', '', '', '小程序AppSecret', '2', '1', null);
INSERT INTO `zp_config` VALUES ('73', 'cash', 'number', '每日提现次数', 'cash_num', '', '1', '次，每日可提现次数', '12', '1', null);
INSERT INTO `zp_config` VALUES ('74', 'cash', 'number', '每日提现时间', 'cash_time', '', '09:00-17:00', '', '13', '1', null);
INSERT INTO `zp_config` VALUES ('57', 'wechat', 'text', '微信支付商户号', 'mch_id', '', '', '微信支付商户号', '4', '1', null);
INSERT INTO `zp_config` VALUES ('58', 'wechat', 'text', '微信支付密钥', 'secret_key', '', '', '微信支付密钥', '5', '1', null);
INSERT INTO `zp_config` VALUES ('88', 'cash', 'number', '提现手续费', 'cash_fee', '', '5', '%,用户提现手续费比例', '9', '1', null);
INSERT INTO `zp_config` VALUES ('54', 'wechat', 'text', '小程序APPID', 'app_id', '', '', '小程序APPID', '1', '1', null);
INSERT INTO `zp_config` VALUES ('10', 'web', 'text', '联系人', 'web_contact', '朱先生', '朱先生', '', '9', '1', '1566212263');
INSERT INTO `zp_config` VALUES ('86', 'web', 'text', '客服电话', 'web_phone', '', '', '', '12', '1', null);
INSERT INTO `zp_config` VALUES ('59', 'cash', 'textarea', '微信支付证书key', 'client_key', '', '', '微信支付证书key.pem内容', '7', '1', null);
INSERT INTO `zp_config` VALUES ('14', 'upload', 'select', '存储方式', 'upload_storage', '本地存储|local\n阿里云存储|aliyun\n腾讯云存储|qcloud\n七牛云存储|qiniu', 'local', '图片存储方式', '1', '1', '1566212614');
INSERT INTO `zp_config` VALUES ('15', 'upload', 'text', '绑定域名', 'upload_domain', '', '', '图片分离时使用，例如：image.zhipall.com', '2', '1', '1566212655');
INSERT INTO `zp_config` VALUES ('16', 'upload', 'text', 'AccessKeyId', 'upload_keyid', '', '', '阿里云AccessKeyId，申请地址：https://usercenter.console.aliyun.com/#/manage/ak', '3', '1', '1566212759');
INSERT INTO `zp_config` VALUES ('17', 'upload', 'text', 'AccessSecret', 'upload_secret', '', '', '阿里云accessKeySecret', '4', '1', '1566212837');
INSERT INTO `zp_config` VALUES ('18', 'upload', 'text', '存储节点', 'upload_endpoint', '', 'zhipall', '阿里云OSS的endpoint，例如：oss-cn-beijing.aliyuncs.com', '5', '1', '1566212904');
INSERT INTO `zp_config` VALUES ('19', 'upload', 'text', '空间名称', 'upload_bucket', '', 'zhicms', '阿里云OSS的 zhipall-zhicms', '6', '1', '1566212937');
INSERT INTO `zp_config` VALUES ('91', 'cash', 'radio', '微信提现方式', 'cash_iswechat', '关闭通道|0\n收款码通道|1\n自动转账接口|2', '0', '微信提现方式', '1', '1', null);
INSERT INTO `zp_config` VALUES ('90', 'cash', 'number', '提现起审核金额', 'cash_passed', '', '100', '元，用户提现起审金额', '11', '1', null);
INSERT INTO `zp_config` VALUES ('215', 'cash', 'text', '微信证书序列号', 'cash_weixin_serial_no', '', '', '微信支付证书序列号', '5', '1', null);
INSERT INTO `zp_config` VALUES ('61', 'wechat', 'text', '微信支付回调', 'notify_url', '', '', '', '8', '1', null);
INSERT INTO `zp_config` VALUES ('62', 'cash', 'textarea', '微信支付证书cert', 'client_cert', '', '', '微信支付证书cert.pem内容', '8', '1', null);
INSERT INTO `zp_config` VALUES ('87', 'wechat', 'number', '激励视频ID', 'video_ids', '', '', '小程序端会随机读取激励视频，最多10个', '19', '1', null);
INSERT INTO `zp_config` VALUES ('66', 'wechat', 'text', '微信退款回调', 'pay_refund', '', '', '微信支付退款回调', '9', '1', null);
INSERT INTO `zp_config` VALUES ('89', 'cash', 'number', '提现最小金额', 'cash_min', '', '5', '元，用户最小提现金额', '10', '1', null);
INSERT INTO `zp_config` VALUES ('84', 'web', 'image', '客服二维码', 'web_qrcode', '', '', '客服微信二维码', '10', '1', null);
INSERT INTO `zp_config` VALUES ('81', 'wechat', 'image', '首页分享图标', 'wechat_share_img', '', '', '', '16', '1', null);
INSERT INTO `zp_config` VALUES ('82', 'wechat', 'text', '首页分享标题', 'wechat_share_title', '', '', '小程序默认分享标题', '17', '1', null);
INSERT INTO `zp_config` VALUES ('83', 'wechat', 'text', '首页分享描述', 'wechat_share_desc', '', '', '小程序默认分享描述', '18', '1', null);
INSERT INTO `zp_config` VALUES ('85', 'web', 'text', '客服微信号', 'web_wechat', '', '', '', '11', '1', null);
INSERT INTO `zp_config` VALUES ('92', 'cash', 'radio', '支付宝提现方式', 'cash_isalipay', '关闭通道|0\n收款码通道|1\n转账到支付宝|2', '0', '支付宝提现方式', '2', '1', null);
INSERT INTO `zp_config` VALUES ('93', 'wechat', 'text', '任务订阅消息ID', 'subscribe_task_id', '', '', '说明：订阅消息ID需要先在小程序管理后台申请，搜索“任务”，选用“任务接收通知”，然后将添加“任务标题”、“任务内容”、“任务状态”、“接收时间”字段，完成后将模板ID复制到这里即可', '25', '1', null);
INSERT INTO `zp_config` VALUES ('94', 'wechat', 'text', '上新订阅消息ID', 'subscribe_new_id', '', '', '说明：订阅消息ID需要先在小程序管理后台申请，搜索“新项目”，选用“新项目上线提醒”，然后添加“项目名称、上线时间、项目简介”字段，完成后将模板ID复制到这里即可', '26', '1', null);
INSERT INTO `zp_config` VALUES ('95', 'wechat', 'text', '提现订阅信息ID', 'subscribe_cashed_id', '', '', '说明：订阅消息ID需要先在小程序管理后台申请，搜索“提现”，选用“提现成功通知”，然后添加“订单号、金额、备注、到账时间”字段，完成后将模板ID复制到这里即可', '27', '1', null);
INSERT INTO `zp_config` VALUES ('96', 'other', 'number', '每日助力限制', 'hand_day_max', '', '5', '次，每个人每日为别人助力的上限值。（默认为5次）', '119', '1', null);
INSERT INTO `zp_config` VALUES ('97', 'other', 'number', '每日资源获取次数', 'hand_day_num', '', '0', '次， 每个人每日通过任务获取资源次数。（0为不限制）', '120', '1', null);
INSERT INTO `zp_config` VALUES ('98', 'wechat', 'number', '插屏广告弹出设置', 'adv_eject', '', '15', '秒，插屏广告弹出时间', '28', '1', null);
INSERT INTO `zp_config` VALUES ('99', 'other', 'radio', '是否显示时间', 'is_uptime', '显示原价|0\n显示更新时间|1', '0', '列表是否显示更新时间，默认显示原价', '89', '1', null);
INSERT INTO `zp_config` VALUES ('100', 'wechat', 'switchs', '关闭IOS虚拟支付', 'ios_close', '开启|关闭', '1', '微信小程序IOS不支持虚拟物品支付，默认开启关闭微信支付', '20', '1', null);
INSERT INTO `zp_config` VALUES ('101', 'wechat', 'select', 'IOS支付方式', 'ios_type', '默认提示|0\n联系客服|1\n卡密兑换|3', '0', '小程序IOS端支付处理方式', '21', '1', null);
INSERT INTO `zp_config` VALUES ('104', 'account', 'text', '公众号APPID', 'account_appid', '', '', '', '1', '1', null);
INSERT INTO `zp_config` VALUES ('105', 'account', 'text', '公众号Secret', 'account_secret', '', '', '', '2', '1', null);
INSERT INTO `zp_config` VALUES ('106', 'sms', 'text', '阿里短信AId', 'sms_keyid', '', '', '阿里云短信通道AccessKeyId', '1', '1', null);
INSERT INTO `zp_config` VALUES ('107', 'sms', 'text', '阿里短信ASecret', 'sms_secret', '', '', '阿里云短信通道AccessSecret', '2', '1', null);
INSERT INTO `zp_config` VALUES ('108', 'sms', 'text', '阿里短信模板注册', 'TemplateCode', '', '', '阿里短信用户注册短信验证模板', '3', '1', null);
INSERT INTO `zp_config` VALUES ('109', 'sms', 'text', '阿里短信签名', 'sms_sign', '', '', '阿里短信签名', '4', '1', null);
INSERT INTO `zp_config` VALUES ('110', 'alipay', 'text', '支付宝APPID', 'ali_pay_appid', '', '', '支付宝appid', '2', '1', null);
INSERT INTO `zp_config` VALUES ('111', 'alipay', 'textarea', '支付宝公钥', 'ali_pay_public_key', '', '', '支付宝公钥', '4', '1', null);
INSERT INTO `zp_config` VALUES ('112', 'alipay', 'textarea', '商户应用私钥', 'ali_pay_private_key', '', '', '商户应用私钥', '9', '1', null);
INSERT INTO `zp_config` VALUES ('113', 'alipay', 'text', '支付宝回调地址', 'ali_pay_notify', '', '', '支付宝回调地址', '10', '1', null);
INSERT INTO `zp_config` VALUES ('114', 'account', 'text', '微信支付商户号', 'wxpay_mch_id', '', '', '微信支付商户号', '9', '1', null);
INSERT INTO `zp_config` VALUES ('115', 'account', 'text', '微信支付密钥', 'wxpay_secret_key', '', '', '微信支付密钥', '10', '1', null);
INSERT INTO `zp_config` VALUES ('116', 'account', 'text', '公众号h5域名', 'account_domain', '', '', '域名为公众号网页授权域名，H5端运行域名，微信H5支付域名', '3', '1', null);
INSERT INTO `zp_config` VALUES ('117', 'account', 'text', '微信支付回调', 'wxpay_notify', '', '', '微信公众号支付回调地址', '11', '1', null);
INSERT INTO `zp_config` VALUES ('118', 'other', 'switchs', '显示打开网盘', 'is_opendisk', '开启|关闭', '1', '小程序端是否显示打开网盘按钮，开启为显示（前提申请了百度网盘插件）', '83', '1', null);
INSERT INTO `zp_config` VALUES ('135', 'other', 'number', '用户服务协议ID', 'service_artice_id', '', '3', '用户注册服务协议文章ID', '93', '1', null);
INSERT INTO `zp_config` VALUES ('119', 'other', 'switchs', '开放站群加入', 'is_groups', '开启|关闭', '1', '开放站群加入，关闭为购买资源后才能进入', '80', '1', null);
INSERT INTO `zp_config` VALUES ('120', 'other', 'radio', '资源排列方式', 'list_type', '单列排版|1\n双列排版|2', '1', '资源列表排列方式：单列排版，双列排版', '90', '1', null);
INSERT INTO `zp_config` VALUES ('214', 'cash', 'text', '微信支付v3KEY', 'pay_weixin_v3_key', '', '', '微信支付V3支付密钥', '6', '1', null);
INSERT INTO `zp_config` VALUES ('122', 'other', 'switchs', '开启卡密支付', 'is_cdkey_pay', '开启|关闭', '0', '安卓端是否开启卡密兑换支付', '82', '1', null);
INSERT INTO `zp_config` VALUES ('123', 'other', 'number', 'VIP介绍文章ID', 'vip_article_id', '', '0', '自定义VIP介绍读取文章内容，此处填写文章内容ID', '91', '1', null);
INSERT INTO `zp_config` VALUES ('124', 'other', 'number', '销量自定义单位', 'sale_unit_text', '', '人学习', '销量后面的自定义文字', '100', '1', null);
INSERT INTO `zp_config` VALUES ('134', 'other', 'switchs', '开放跳转加入', 'is_jumps', '开启|关闭', '1', '开放跳转进入，关闭为购买资源后才能进入', '81', '1', null);
INSERT INTO `zp_config` VALUES ('136', 'other', 'number', '用户隐私协议ID', 'privacy_artice_id', '', '2', '用户隐私协议文章ID', '92', '1', null);
INSERT INTO `zp_config` VALUES ('137', 'account', 'radio', '微信支付方式', 'wechat_pay_type', '微信支付商户|1\n虎皮椒个人支付|2\n易支付|3', '1', '微信支付收款方式', '8', '1', null);
INSERT INTO `zp_config` VALUES ('138', 'account', 'text', '虎皮椒支付网关', 'xunhu_api_url', '', 'https://api.xunhupay.com/payment/do.html', '一般不用动，如虎皮椒官方有调整手动更新即可', '12', '1', null);
INSERT INTO `zp_config` VALUES ('139', 'account', 'text', '虎皮椒appid', 'xunhu_appid', '', '', '虎皮椒微信支付通道Appid', '13', '1', null);
INSERT INTO `zp_config` VALUES ('140', 'account', 'text', '虎皮椒密钥', 'xunhu_secret', '', '', '虎皮椒微信支付密钥', '14', '1', null);
INSERT INTO `zp_config` VALUES ('141', 'account', 'text', '虎皮椒店铺域名', 'xunhu_domain', '', '', '需要添加http://或https://，末尾不加/', '15', '1', null);
INSERT INTO `zp_config` VALUES ('142', 'account', 'text', '虎皮椒店铺名称', 'xunhu_name', '', '', '虎皮椒店铺名称', '16', '1', null);
INSERT INTO `zp_config` VALUES ('143', 'alipay', 'radio', '支付宝支付方式', 'alipay_pay_type', '支付宝商户|1\n虎皮椒个人支付|2\n易支付|3', '1', '支付宝支付通道', '1', '1', null);
INSERT INTO `zp_config` VALUES ('144', 'alipay', 'text', '虎皮椒支付网关', 'xunhu_ali_api_url', '', 'https://api.xunhupay.com/payment/do.html', '一般不用动，如虎皮椒官方有调整手动更新即可', '11', '1', null);
INSERT INTO `zp_config` VALUES ('145', 'alipay', 'text', '虎皮椒appid', 'xunhu_ali_appid', '', '', '虎皮椒支付宝通道Appid', '12', '1', null);
INSERT INTO `zp_config` VALUES ('146', 'alipay', 'text', '虎皮椒密钥', 'xunhu_ali_secret', '', '', '虎皮椒支付宝密钥', '13', '1', null);
INSERT INTO `zp_config` VALUES ('147', 'alipay', 'text', '虎皮椒店铺域名', 'xunhu_ali_domain', '', '', '需要添加http://或https://，末尾不加/', '14', '1', null);
INSERT INTO `zp_config` VALUES ('148', 'alipay', 'text', '虎皮椒店铺名称', 'xunhu_ali_name', '', '', '虎皮椒店铺名称', '15', '1', null);
INSERT INTO `zp_config` VALUES ('149', 'alipay', 'radio', '开启支付宝支付', 'alipay_open', '开启|1\n关闭|2', '1', '是否开启支付宝收款，仅H5支付有效', '0', '1', null);
INSERT INTO `zp_config` VALUES ('150', 'account', 'radio', '开启微信支付', 'wechat_open', '开启|1\n关闭|2', '1', '是否开启微信支付收款，仅H5支付有效', '7', '1', null);
INSERT INTO `zp_config` VALUES ('151', 'other', 'text', '主资源库地址', 'master_url', '', '', '上级主资源库接口地址', '95', '1', null);
INSERT INTO `zp_config` VALUES ('152', 'cash', 'switchs', '银行卡提现', 'cash_isbank', '开启|关闭', '0', '银行卡提现', '3', '1', null);
INSERT INTO `zp_config` VALUES ('153', 'other', 'switchs', '开启微信支付', 'is_wechat_pay', '开启|关闭', '1', '安卓端是否开启微信支付，默认为开启', '82', '1', null);
INSERT INTO `zp_config` VALUES ('155', 'other', 'radio', '是否绑定手机', 'is_bind_mobile', '不绑定手机号码|1\n绑定手机号码|2', '1', '登录是否强制绑定手机号码，如设置绑定请先配置短信参数', '0', '1', null);
INSERT INTO `zp_config` VALUES ('156', 'sms', 'radio', '短信通道', 'sms_channel', '阿里云短信|1\n短信宝|2', '1', '短信通道', '0', '1', null);
INSERT INTO `zp_config` VALUES ('157', 'sms', 'text', '短信宝用户名', 'dxb_user', '', '', '短信宝申请地址：http://www.smsbao.com/reg?r=3SHS', '5', '1', null);
INSERT INTO `zp_config` VALUES ('158', 'sms', 'text', '短信宝ApiKey', 'dxb_apikey', '', '', '短信宝的ApiKey', '6', '1', null);
INSERT INTO `zp_config` VALUES ('159', 'sms', 'text', '短信宝API网关', 'dxb_apiurl', '', '', '短信宝网关API接口地址', '7', '1', null);
INSERT INTO `zp_config` VALUES ('160', 'sms', 'text', '短信宝模板内容', 'dxb_temp', '', '', '短信宝模板内容', '8', '1', null);
INSERT INTO `zp_config` VALUES ('161', 'account', 'radio', '访问方式', 'view_type', '不限制访问|0\n微信内访问|1\n手机浏览器内访问|2', '0', '公众号H5端访问方式', '0', '1', null);
INSERT INTO `zp_config` VALUES ('162', 'agent', 'textarea', '代理分站域名', 'account_domains', '', '', '代理分站顶级域名库，一行一个<br/>域名请做泛解析<br/>域名请绑定在H5站点上', '1', '1', null);
INSERT INTO `zp_config` VALUES ('163', 'agent', 'number', '代理抽成比例', 'agent_min_take', '', '5', '%，代理默认抽成比例', '2', '1', null);
INSERT INTO `zp_config` VALUES ('164', 'agent', 'number', '提现手续费', 'agent_cash_fee', '', '10', '%，代理提现默认手续费比例', '3', '1', null);
INSERT INTO `zp_config` VALUES ('165', 'agent', 'number', '资源发布价格', 'agent_min_pub', '', '5', '元，代理推广资源最低发布价格', '8', '1', null);
INSERT INTO `zp_config` VALUES ('166', 'agent', 'number', '最低提现金额', 'agent_min_cash', '', '100', '元，代理提现最低起提金额', '12', '1', null);
INSERT INTO `zp_config` VALUES ('167', 'agent', 'number', '每日提现时间', 'agent_cash_time', '', '09:00-17:00', '', '11', '1', null);
INSERT INTO `zp_config` VALUES ('168', 'agent', 'number', '每日提现次数', 'agent_cash_num', '', '1', '次，代理每日提现次数', '15', '1', null);
INSERT INTO `zp_config` VALUES ('169', 'agent', 'number', '最高提现金额', 'agent_max_cash', '', '1000', '元，代理提现单笔最高金额', '14', '1', null);
INSERT INTO `zp_config` VALUES ('170', 'wechat', 'textarea', '代码上传密钥', 'private_key', '', '--', '微信小程序代码上传密钥，请勿开启IP白名单', '10', '1', null);
INSERT INTO `zp_config` VALUES ('171', 'coms', 'image', '网站LOGO', 'coms_logo', '', '', '网站LOGO，尺寸：180px×48px', '1', '1', null);
INSERT INTO `zp_config` VALUES ('172', 'coms', 'text', '网站标题', 'coms_title', '', '', '电脑端网站首页标题', '4', '1', null);
INSERT INTO `zp_config` VALUES ('173', 'coms', 'text', 'SEO关键字', 'coms_keys', '', '', '电脑端SEO关键字', '5', '1', null);
INSERT INTO `zp_config` VALUES ('174', 'coms', 'text', 'SEO描述', 'coms_desc', '', '', '电脑端SEO描述', '6', '1', null);
INSERT INTO `zp_config` VALUES ('175', 'coms', 'textarea', '网站底部版权', 'coms_copy', '', '', '网站底部版权信息', '10', '1', null);
INSERT INTO `zp_config` VALUES ('176', 'coms', 'text', 'SVIP页面标语', 'coms_svip_title', '', '', 'SVIP页面Banner标题', '7', '1', null);
INSERT INTO `zp_config` VALUES ('177', 'coms', 'image', '登录页BANNER', 'coms_login_banner', '', '', '登录页左侧BANNER，尺寸：380px×450px', '0', '1', null);
INSERT INTO `zp_config` VALUES ('186', 'coms', 'text', 'SVIP页面描述', 'coms_svip_desc', '', '', 'SVIP页面banner描述', '8', '1', null);
INSERT INTO `zp_config` VALUES ('187', 'coms', 'image', '微信公众号', 'coms_wechat', '', '', '公众号二维码图片，尺寸：320px×320px', '3', '1', null);
INSERT INTO `zp_config` VALUES ('188', 'coms', 'textarea', '网站统计代码', 'coms_stat_code', '', '--', '网站统计代码', '9', '1', null);
INSERT INTO `zp_config` VALUES ('189', 'coms', 'ueditor', '温馨提示内容', 'coms_tips', '', '', '详情温馨提示内容', '11', null, null);
INSERT INTO `zp_config` VALUES ('190', 'coms', 'image', '网站ICO图标', 'coms_favicon', '', '', '网站ICO图标后缀为.ico，尺寸：32px×32px，显示在浏览器的地址栏、收藏栏等位置', '2', '1', null);
INSERT INTO `zp_config` VALUES ('191', 'account', 'text', '消息通知URL', 'account_url', '', 'https://www.domain.com/api/wechat', '消息推送服务器接口URL', '4', '1', null);
INSERT INTO `zp_config` VALUES ('192', 'account', 'text', '消息通知令牌', 'account_token', '', '', 'TOKEN，消息通知令牌', '5', '1', null);
INSERT INTO `zp_config` VALUES ('193', 'account', 'text', '消息加解密密钥', 'account_aeskey', '', '', 'EncodingAESKey，消息加解密密钥', '6', '1', null);
INSERT INTO `zp_config` VALUES ('194', 'other', 'radio', '分销层级设置', 'commission_fee', '一级分销|1\n二级分销|2', '1', '用户分销层级设置，默认一级', '86', '1', null);
INSERT INTO `zp_config` VALUES ('195', 'alipay', 'textarea', '支付宝根证书', 'ali_pay_root_key', '', '--', '支付宝接口公钥证书模式可获得', '5', '1', null);
INSERT INTO `zp_config` VALUES ('196', 'alipay', 'textarea', '商户应用公钥', 'ali_pay_app_public', '', '--', '支付宝接口公钥证书模式可获得', '6', '1', null);
INSERT INTO `zp_config` VALUES ('197', 'account', 'switchs', '开启一键登录', 'is_quick_login', '开启|关闭', '0', '是否开启一键注册登录，购买时无需跳转到注册登录，仅公众号H5端有效', '0', '1', null);
INSERT INTO `zp_config` VALUES ('198', 'other', 'switchs', '卡密计算收益', 'is_cdkey_income', '开启|关闭', '1', '卡密兑换是否计算收益，开启为计算，默认开启', '85', '1', null);
INSERT INTO `zp_config` VALUES ('199', 'agent', 'number', '前台抽成比例', 'agent_front_take', '', '0', '%，前端开通代理分站默认抽成比例', '13', '1', null);
INSERT INTO `zp_config` VALUES ('200', 'account', 'text', '易支付网关', 'epay_api_url', '', '', '易支付网关地址', '10', '1', null);
INSERT INTO `zp_config` VALUES ('201', 'account', 'text', '易支付商户号', 'epay_api_mchid', '', '', '易支付商户号', '11', '1', null);
INSERT INTO `zp_config` VALUES ('202', 'account', 'text', '易支付密钥', 'epay_api_key', '', '', '易支付商户密钥', '12', '1', null);
INSERT INTO `zp_config` VALUES ('203', 'alipay', 'text', '易支付网关', 'alipay_epay_url', '', '', '易支付网关', '3', '1', null);
INSERT INTO `zp_config` VALUES ('204', 'alipay', 'text', '易支付商户号', 'alipay_epay_mchid', '', '', '易支付商户号', '4', '1', null);
INSERT INTO `zp_config` VALUES ('205', 'alipay', 'text', '易支付密钥', 'alipay_epay_key', '', '', '易支付商户密钥', '5', '1', null);
INSERT INTO `zp_config` VALUES ('206', 'agent', 'number', '资源发布原价', 'agent_dis_pub', '', '10', '元，代理推广资源最低发布原价', '7', '1', null);
INSERT INTO `zp_config` VALUES ('209', 'agent', 'radio', '同步价格方式', 'agent_price_type', '按最低发布价格|1\n按平台资源价格|2', '1', '代理推广资源时价格的同步方式，默认按照代理最低发布资源价格', '4', '1', null);
INSERT INTO `zp_config` VALUES ('208', 'agent', 'number', 'SVIP最低价格', 'agent_min_svip', '', '60', '元，代理设置SVIP套餐最低价格', '9', '1', null);
INSERT INTO `zp_config` VALUES ('210', 'other', 'radio', '用户助力类型', 'spread_hand_type', '新用户助力|0\n新老用户助力|1', '0', '资源要求任务助力限制，默认新用户', '118', '1', null);
INSERT INTO `zp_config` VALUES ('211', 'account', 'radio', '微信登录方式', 'is_wechat_login', '不限制登录方式|0\n只显示微信登录|1\n不显示微信登录|2', '0', '公众号端微信登录显示，默认不限制', '0', '1', null);
INSERT INTO `zp_config` VALUES ('218', 'account', 'text', '无分站跳转', 'view_nosite', '', '', '公众号H5端访问没有开通分站的域名跳转地址', '0', '1', null);
INSERT INTO `zp_config` VALUES ('212', 'other', 'text', 'H5投诉客服链接', 'kefu_link', '', '', 'H5端平台投诉客服链接，建议填写企业微信客服链接', '94', '1', null);
INSERT INTO `zp_config` VALUES ('213', 'other', 'radio', '课程展示方式', 'course_type', '课程目录在后|0\n课程目录在前|1', '0', '课程详情页课程目录展示方式', '87', '1', null);
INSERT INTO `zp_config` VALUES ('216', 'cash', 'radio', '微信自动转账接口', 'cash_weixin_type', '企业转账到零钱|0\n商家转账到零钱|1', '0', '微信用户提现自动转账接口', '4', '1', null);
INSERT INTO `zp_config` VALUES ('217', 'other', 'number', '主资源库授权码', 'master_token', '', '', '上级主资源库接口授权码', '96', '1', null);
INSERT INTO `zp_config` VALUES ('219', 'wechat', 'radio', '微信支付方式', 'wxnini_pay_type', '微信支付商户|0\n虎皮椒个人支付|1', '0', '微信支付收款方式', '3', '1', null);
INSERT INTO `zp_config` VALUES ('220', 'wechat', 'text', '虎皮椒支付网关', 'wxnini_xunhu_url', '', 'https://api.xunhupay.com/payment/do.html', '一般不用动，如虎皮椒官方有调整手动更新即可', '7', '1', null);
INSERT INTO `zp_config` VALUES ('221', 'wechat', 'text', '虎皮椒渠道appid', 'wxnini_xunhu_appid', '', '', '虎皮椒微信支付通道Appid', '7', '1', null);
INSERT INTO `zp_config` VALUES ('222', 'wechat', 'text', '虎皮椒密钥', 'wxnini_xunhu_secret', '', '', '虎皮椒微信支付密钥', '7', '1', null);
INSERT INTO `zp_config` VALUES ('224', 'wechat', 'text', '虎皮椒APPID', 'wxnini_xunhu_miniappid', '', '', '虎皮椒小程序APPID', '7', '1', null);
INSERT INTO `zp_config` VALUES ('234', 'agent', 'radio', '是否同步资源', 'agent_auto_spread', '手动同步资源|1\n自动同步资源|2', '1', '开通代理分站时，是否自动同步推广平台的资源', '5', '1', null);
INSERT INTO `zp_config` VALUES ('233', 'web', 'image', '后台LOGO', 'admin_logo', '', '', '后台左侧顶部LOGO', '3', '1', null);
INSERT INTO `zp_config` VALUES ('235', 'agent', 'radio', '卡密功能权限', 'kammi_type', '不允许创建|0\n允许自行创建|1', '0', '选择自行创建前，在【系统设置-全局设置-业务设置】-卡密计算收益 配置项，将此配置关闭', '6', '1', null);
INSERT INTO `zp_config` VALUES ('236', 'web', 'text', '网站备案号', 'web_icp', '', '', '网站备案号', '15', '1', null);
INSERT INTO `zp_config` VALUES ('237', 'upload', 'text', '绑定域名', 'upload_domain_qcloud', '', '', '图片分离时使用，例如：image.zhipall.com', '10', '1', '1566212655');
INSERT INTO `zp_config` VALUES ('245', 'upload', 'number', '上传大小', 'upload_size', '', '100', 'MB，文件上传大小限制', '15', '1', '1566212837');
INSERT INTO `zp_config` VALUES ('238', 'upload', 'text', 'AccessKeyId', 'upload_keyid_qcloud', '', '', '腾讯云AccessKeyId', '7', '1', '1566212759');
INSERT INTO `zp_config` VALUES ('239', 'upload', 'text', 'AccessSecret', 'upload_secret_qcloud', '', '', '腾讯云AccessKeySecret', '8', '1', '1566212837');
INSERT INTO `zp_config` VALUES ('240', 'upload', 'text', '存储节点', 'upload_endpoint_qcloud', '', 'zhipall', '腾讯云COS的endpoint，例如：ap-beijing', '9', '1', '1566212904');
INSERT INTO `zp_config` VALUES ('241', 'upload', 'text', '空间名称', 'upload_bucket_qiniu', '', 'zhicms', '腾讯云COS的bucket，例如：zhipall-13405811', '14', '1', '1566212937');
INSERT INTO `zp_config` VALUES ('242', 'upload', 'text', '绑定域名', 'upload_domain_qiniu', '', '', '绑定域名,例如：image.zhipall.com', '11', '1', '1566212655');
INSERT INTO `zp_config` VALUES ('243', 'upload', 'text', 'AccessKeyId', 'upload_keyid_qiniu', '', '', '腾讯云AccessKeyId', '12', '1', '1566212759');
INSERT INTO `zp_config` VALUES ('244', 'upload', 'text', 'AccessSecret', 'upload_secret_qiniu', '', '', '腾讯云AccessKeySecret', '13', '1', '1566212837');
INSERT INTO `zp_config` VALUES ('246', 'upload', 'text', '文件后缀', 'upload_ext', '', 'jpg,png,gif,jpeg,doc,docx', '上传文件允许的后缀', '16', '1', '1566212837');
INSERT INTO `zp_config` VALUES ('247', 'upload', 'switchs', '开启缩略图', 'upload_thumb_open', '开启|关闭', '1', '是否开启缩略图', '17', '1', '1566212837');
INSERT INTO `zp_config` VALUES ('248', 'upload', 'number', '缩略图宽度', 'upload_thumb_width', '', '640', 'PX，缩略图宽度', '19', '1', null);
INSERT INTO `zp_config` VALUES ('249', 'upload', 'number', '缩略图高度', 'upload_thumb_height', '', '480', 'PX,缩略图高度', '18', '1', null);
INSERT INTO `zp_config` VALUES ('250', 'upload', 'select', '缩放类型', 'upload_thumb_types', '等比例缩放|1\n缩放后填充|2\n居中裁剪|3\n左上角裁剪|4\n右下角裁剪|5\n固定尺寸缩放|6', '6', '缩略图缩放类型', '20', '1', null);
INSERT INTO `zp_config` VALUES ('251', 'upload', 'switchs', '开启水印', 'upload_water_open', '开启|关闭', '1', '是否开启水印', '21', '1', null);
INSERT INTO `zp_config` VALUES ('252', 'upload', 'radio', '水印类型', 'upload_water_types', '图片|1\n文字|2', '2', '原图上的水印类型', '22', '1', null);
INSERT INTO `zp_config` VALUES ('253', 'upload', 'image', '水印图片', 'upload_water_image', '', '', '水印图片', '23', '1', null);
INSERT INTO `zp_config` VALUES ('254', 'upload', 'text', '水印文字', 'upload_water_text', '', '', '水印文字', '24', '1', null);
INSERT INTO `zp_config` VALUES ('255', 'upload', 'number', '水印文字大小', 'upload_water_size', '', '30', 'px，水印文字大小', '25', '1', null);
INSERT INTO `zp_config` VALUES ('256', 'upload', 'color', '水印文字颜色', 'upload_water_color', '', '#4c4c4c', '水印文字颜色', '26', '1', null);
INSERT INTO `zp_config` VALUES ('257', 'upload', 'number', '水印透明度', 'upload_water_alpha', '', '20', '水印透明度', '27', '1', null);
INSERT INTO `zp_config` VALUES ('258', 'upload', 'number', '水印倾斜度', 'upload_water_angle', '', '0', '水印倾斜度', '28', '1', null);
INSERT INTO `zp_config` VALUES ('259', 'upload', 'select', '水印位置', 'upload_water_locate', '左上角水印|1\n上居中水印|2\n右上角水印|3\n左居中水印|4\n居中水印|5\n右居中水印|6\n左下角水印|7\n下居中水印|8\n右下角水印|9', '9', '水印位置', '29', '1', null);
INSERT INTO `zp_config` VALUES ('260', 'upload', 'number', '偏移量横坐标', 'upload_water_posx', '', '0', 'px，水印偏移量横坐标', '30', '1', null);
INSERT INTO `zp_config` VALUES ('261', 'upload', 'number', '偏移量纵坐标', 'upload_water_posy', '', '0', 'px，水印偏移量纵坐标', '31', '1', null);
INSERT INTO `zp_config` VALUES ('262', 'wechat', 'switchs', '个人过审模式', 'is_passed_mode', '开启|关闭', '1', '开启过审模式，个人小程序提交审核开启此开关', '23', '1', null);

-- ----------------------------
-- Table structure for zp_groups
-- ----------------------------
DROP TABLE IF EXISTS `zp_groups`;
CREATE TABLE `zp_groups` (
 `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
 `name` varchar(32) DEFAULT NULL COMMENT '社群名称',
 `desc` varchar(256) DEFAULT NULL COMMENT '简介',
 `thumb` varchar(128) DEFAULT NULL COMMENT '社群图片',
 `url` varchar(128) DEFAULT NULL COMMENT '社区二维码',
 `status` tinyint(2) unsigned DEFAULT '0' COMMENT '状态，1上线，0下线',
 `uid` int(10) unsigned DEFAULT '0' COMMENT '代理ID',
 `exp_time` int(10) unsigned DEFAULT '0' COMMENT '过期时间',
 `ctime` int(10) unsigned DEFAULT '0' COMMENT '添加时间',
 PRIMARY KEY (`id`),
 KEY `idx_union` (`uid`,`exp_time`,`ctime`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COMMENT='社群';

-- ----------------------------
-- Table structure for zp_invite
-- ----------------------------
DROP TABLE IF EXISTS `zp_invite`;
CREATE TABLE `zp_invite` (
 `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
 `admin_id` int(10) unsigned DEFAULT '0' COMMENT '代理ID',
 `rid` int(10) unsigned DEFAULT '0' COMMENT '资源ID，大于0为通过资源邀请助力',
 `pid` int(10) unsigned DEFAULT '0' COMMENT '邀请人ID',
 `uid` int(10) unsigned DEFAULT '0' COMMENT '被邀请人ID',
 `ctime` int(10) unsigned DEFAULT '0' COMMENT '添加时间',
 PRIMARY KEY (`id`),
 KEY `idx_union` (`pid`,`uid`,`ctime`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COMMENT='邀请用户助力表';

-- ----------------------------
-- Table structure for zp_jump
-- ----------------------------
DROP TABLE IF EXISTS `zp_jump`;
CREATE TABLE `zp_jump` (
`id` int(10) unsigned NOT NULL AUTO_INCREMENT,
`name` varchar(32) NOT NULL COMMENT '跳转名称',
`desc` varchar(256) DEFAULT NULL COMMENT '简介',
`appid` varchar(50) DEFAULT NULL,
`url` varchar(128) DEFAULT NULL COMMENT '链接地址',
`type` tinyint(4) unsigned DEFAULT '1' COMMENT '1外部链接2小程序',
`thumb` varchar(128) DEFAULT NULL COMMENT '封面图标',
`status` tinyint(2) unsigned DEFAULT '0' COMMENT '状态，1启用，0禁用',
`uid` int(10) unsigned DEFAULT '0' COMMENT '代理ID',
`ctime` int(10) unsigned DEFAULT '0' COMMENT '添加时间',
PRIMARY KEY (`id`),
KEY `idx_union` (`uid`,`ctime`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COMMENT='社群';

-- ----------------------------
-- Table structure for zp_kammi
-- ----------------------------
DROP TABLE IF EXISTS `zp_kammi`;
CREATE TABLE `zp_kammi` (
`id` int(11) NOT NULL AUTO_INCREMENT,
`admin_id` int(10) unsigned DEFAULT '0' COMMENT '代理ID',
`type` tinyint(1) unsigned DEFAULT '1' COMMENT '卡密类型：1资源，2会员',
`cdkey` varchar(100) DEFAULT NULL,
`money` decimal(11,2) DEFAULT NULL COMMENT '价格',
`rid` int(10) unsigned DEFAULT '0' COMMENT '资源ID',
`vid` int(10) unsigned DEFAULT '0' COMMENT '会员ID',
`uid` int(11) unsigned DEFAULT '0' COMMENT '使用用户',
`status` tinyint(2) DEFAULT '0' COMMENT '0未使用1已使用',
`utime` int(10) unsigned DEFAULT '0' COMMENT '使用时间',
`ctime` int(11) DEFAULT NULL,
PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COMMENT='卡密表';

-- ----------------------------
-- Table structure for zp_links
-- ----------------------------
DROP TABLE IF EXISTS `zp_links`;
CREATE TABLE `zp_links` (
`id` int(10) unsigned NOT NULL AUTO_INCREMENT,
`type` tinyint(1) unsigned DEFAULT '0' COMMENT '类型，0首页',
`name` varchar(48) DEFAULT NULL COMMENT '链接名称',
`url` varchar(128) DEFAULT NULL COMMENT '链接',
`remark` varchar(256) DEFAULT NULL COMMENT '备注',
`indexid` int(10) unsigned DEFAULT '0' COMMENT '排序',
`status` tinyint(1) unsigned DEFAULT '1' COMMENT '状态，1启用，0禁用',
`ctime` int(10) unsigned DEFAULT '0' COMMENT '添加时间',
PRIMARY KEY (`id`),
KEY `idx_indexid` (`indexid`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb4 COMMENT='友情链接表';

-- ----------------------------
-- Records of zp_links
-- ----------------------------
INSERT INTO `zp_links` VALUES ('1', '0', '智创云享', 'https://wccem.51zhanma.cn', '官网', '1', '1', '1684304560');
INSERT INTO `zp_links` VALUES ('2', '0', '站码网', 'https://www.51zhanma.cn', '源码站', '2', '1', '1684304658');
INSERT INTO `zp_links` VALUES ('3', '0', '智派科技', 'https://www.zhipall.com', '智派科技官网', '3', '1', '1684304689');

-- ----------------------------
-- Table structure for zp_market_log
-- ----------------------------
DROP TABLE IF EXISTS `zp_market_log`;
CREATE TABLE `zp_market_log` (
 `id` int(11) NOT NULL AUTO_INCREMENT,
 `title` varchar(150) DEFAULT NULL COMMENT '标题',
 `content` varchar(450) DEFAULT NULL COMMENT '内容',
 `ctime` int(11) DEFAULT NULL,
 PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 ROW_FORMAT=DYNAMIC COMMENT='资源市场记录';

-- ----------------------------
-- Table structure for zp_order
-- ----------------------------
DROP TABLE IF EXISTS `zp_order`;
CREATE TABLE `zp_order` (
    `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
    `ordno` char(48) DEFAULT NULL COMMENT '订单号',
    `admin_id` int(11) unsigned DEFAULT '0' COMMENT '代理id',
    `pid` int(11) unsigned DEFAULT '0' COMMENT '会员邀请人ID',
    `uid` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '用户ID',
    `is_kl` tinyint(1) unsigned NOT NULL DEFAULT '0' COMMENT '是否扣量:1=扣量,0=不扣量',
    `nickname` varchar(50) DEFAULT NULL COMMENT '昵称',
    `type` tinyint(1) unsigned DEFAULT '1' COMMENT '付费类型:1购买资源2购买会员',
    `vid` int(11) DEFAULT '0' COMMENT 'svipID',
    `rid` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '资源ID',
    `pay_type` int(11) unsigned DEFAULT '0' COMMENT '支付类型：1微信2支付宝3卡密4抖音',
    `platform` varchar(24) DEFAULT NULL COMMENT '支付平台:,wechat_mini:微信小程序,wechat_official:微信公众号，wechat_h5:微信H5，wechat_native:微信扫码，alipay_h5:支付宝H5，alipay_pc:支付宝网页，douyin:抖音支付',
    `money` decimal(10,2) unsigned NOT NULL DEFAULT '0.00' COMMENT '支付金额',
    `pt_money` decimal(10,2) unsigned DEFAULT '0.00' COMMENT '实际收入',
    `hr_money` decimal(10,2) unsigned DEFAULT '0.00' COMMENT '会员抽成',
    `sr_money` decimal(10,2) unsigned DEFAULT '0.00' COMMENT '二级分佣金额',
    `tc_money` decimal(11,2) unsigned DEFAULT '0.00' COMMENT '上级代理提成',
    `tp_money` decimal(12,2) unsigned DEFAULT '0.00' COMMENT '上上级代理抽成',
    `ps_money` decimal(12,2) unsigned DEFAULT '0.00' COMMENT '分账金额',
    `is_profit` tinyint(2) unsigned DEFAULT '0' COMMENT '是否分账',
    `trade_id` varchar(64) DEFAULT NULL COMMENT '第三方订单号',
    `status` tinyint(1) unsigned NOT NULL DEFAULT '0' COMMENT '支付状态:1=已支付,0=未支付,2已取消',
    `refund_status` tinyint(2) DEFAULT '0' COMMENT '退款状态，0正常，1退款中，2退款成功，-1退款失败',
    `remark` varchar(128) DEFAULT NULL COMMENT '备注',
    `ptime` int(11) unsigned DEFAULT '0' COMMENT '支付时间',
    `utime` int(11) unsigned NOT NULL DEFAULT '0' COMMENT '修改时间',
    `ctime` int(11) unsigned NOT NULL DEFAULT '0' COMMENT '下单时间',
    PRIMARY KEY (`id`) USING BTREE,
    UNIQUE KEY `order` (`ordno`) USING BTREE,
    KEY `uid` (`uid`) USING BTREE,
    KEY `uids` (`status`,`uid`) USING BTREE,
    KEY `uc` (`uid`,`status`,`ctime`) USING BTREE,
    KEY `idx_uid_kl` (`uid`,`is_kl`,`money`),
    KEY `idx_uid_status` (`uid`,`money`,`status`),
    KEY `idx_status` (`status`),
    KEY `idx_uid_ctime` (`uid`,`ctime`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COMMENT='订单记录';

-- ----------------------------
-- Table structure for zp_pages
-- ----------------------------
DROP TABLE IF EXISTS `zp_pages`;
CREATE TABLE `zp_pages` (
`id` int(11) NOT NULL AUTO_INCREMENT,
`type` tinyint(1) unsigned DEFAULT '0' COMMENT '类型，0目录，1普通，2列表，3链接',
`pid` int(10) unsigned DEFAULT '0' COMMENT '父级ID',
`name` varchar(48) DEFAULT NULL COMMENT '页面名称',
`path` varchar(128) DEFAULT NULL COMMENT '页面路径',
`is_tab` tinyint(1) unsigned DEFAULT '0' COMMENT 'tab导航页，1导航页,普通页',
`remark` varchar(128) DEFAULT NULL COMMENT '备注说明',
`ctime` int(11) unsigned DEFAULT '0' COMMENT '添加时间',
PRIMARY KEY (`id`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb4 COMMENT='前端页面表';

-- ----------------------------
-- Records of zp_pages
-- ----------------------------
INSERT INTO `zp_pages` VALUES ('1', '3', '26', '首页', '/pages/tabbar/home/index', '1', null, '1621324175');
INSERT INTO `zp_pages` VALUES ('2', '3', '26', '资源', '/pages/tabbar/sort/index', '1', null, '1621324175');
INSERT INTO `zp_pages` VALUES ('3', '3', '26', '会员', '/pages/tabbar/vip/index', '1', null, '1621324175');
INSERT INTO `zp_pages` VALUES ('4', '3', '26', '我的', '/pages/tabbar/my/index', '1', null, '1621324175');
INSERT INTO `zp_pages` VALUES ('5', '3', '26', '最新资源', '/pages/resource/index?type=2', '0', null, '1621324175');
INSERT INTO `zp_pages` VALUES ('6', '3', '26', '推荐资源', '/pages/resource/index?type=1', '0', null, '1621324175');
INSERT INTO `zp_pages` VALUES ('7', '3', '26', '所有分类', '/pages/resource/sorts', '0', null, '1621324175');
INSERT INTO `zp_pages` VALUES ('8', '3', '26', '我的资源', '/pages/my/resource', '0', null, '1621324175');
INSERT INTO `zp_pages` VALUES ('9', '3', '26', '我的收藏', '/pages/my/favs', '0', null, '1621324175');
INSERT INTO `zp_pages` VALUES ('11', '3', '26', '我的钱袋', '/pages/my/wallet', '0', null, '1621324175');
INSERT INTO `zp_pages` VALUES ('10', '3', '26', '我的好友', '/pages/my/team', '0', null, '1621324175');
INSERT INTO `zp_pages` VALUES ('31', '0', '0', '文章页面', null, '0', null, '0');
INSERT INTO `zp_pages` VALUES ('32', '2', '31', '文章分类', null, '0', null, '0');
INSERT INTO `zp_pages` VALUES ('29', '2', '28', '资料分类', null, '0', null, '0');
INSERT INTO `zp_pages` VALUES ('30', '2', '28', '资源课程', null, '0', null, '0');
INSERT INTO `zp_pages` VALUES ('28', '0', '0', '资源页面', null, '0', null, '0');
INSERT INTO `zp_pages` VALUES ('18', '3', '26', '自主开通分站', '/pages/subsite/index', '0', '用户自主开通代理分站', '1621324175');
INSERT INTO `zp_pages` VALUES ('19', '3', '26', '自定义专题页', '/custom/subject/index', '0', '调用需要加?id=专题页ID', '1621324175');
INSERT INTO `zp_pages` VALUES ('20', '3', '26', '帮助中心', '/pages/article/list?sort_id=2', '0', null, '1621324175');
INSERT INTO `zp_pages` VALUES ('21', '3', '26', '联系我们', '/pages/my/contact', '0', null, '1621324175');
INSERT INTO `zp_pages` VALUES ('25', '0', '0', '系统页面', null, '0', null, '1621324175');
INSERT INTO `zp_pages` VALUES ('26', '1', '25', '系统链接', null, '0', null, '1621324175');
INSERT INTO `zp_pages` VALUES ('27', '2', '25', '专题页', null, '0', null, '1621324175');
INSERT INTO `zp_pages` VALUES ('33', '2', '31', '文章内容', null, '0', null, '0');

-- ----------------------------
-- Table structure for zp_poster_config
-- ----------------------------
DROP TABLE IF EXISTS `zp_poster_config`;
CREATE TABLE `zp_poster_config` (
`id` int(10) unsigned NOT NULL AUTO_INCREMENT,
`type` tinyint(2) unsigned NOT NULL DEFAULT '1' COMMENT '海报类型，1为资源海报，2推广海报',
`admin_id` int(10) unsigned DEFAULT '0' COMMENT '代理用户ID',
`setting` text COMMENT '配置信息',
`utime` int(10) unsigned DEFAULT '0' COMMENT '更新时间',
`ctime` int(10) unsigned DEFAULT '0' COMMENT '创建时间',
PRIMARY KEY (`id`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb4 COMMENT='资源分享海报自定义';

-- ----------------------------
-- Table structure for zp_privilege
-- ----------------------------
DROP TABLE IF EXISTS `zp_privilege`;
CREATE TABLE `zp_privilege` (
`id` int(11) NOT NULL AUTO_INCREMENT,
`name` varchar(48) DEFAULT NULL COMMENT '特权名称',
`type` int(5) unsigned DEFAULT '1' COMMENT '1资源级别2资源数量3资源分类4广告5佣金',
`rule` text COMMENT '权限配置',
`url` varchar(128) DEFAULT NULL COMMENT '权益图标',
`desc` varchar(256) DEFAULT NULL COMMENT '权益简介',
`status` tinyint(1) unsigned DEFAULT '0' COMMENT '状态，1启用，0禁用',
`ctime` int(11) DEFAULT NULL,
PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COMMENT='特权表';

-- ----------------------------
-- Records of zp_privilege
-- ----------------------------
INSERT INTO `zp_privilege` VALUES ('5', '资源等级', '1', 'a:3:{i:0;a:2:{s:5:\"level\";i:1;s:4:\"name\";s:6:\"初级\";}i:1;a:2:{s:5:\"level\";i:2;s:4:\"name\";s:6:\"中级\";}i:2;a:2:{s:5:\"level\";i:3;s:4:\"name\";s:6:\"高级\";}}', 'https://zpcms.oss-cn-beijing.aliyuncs.com/public/uploads/20240221/3093ca440e071664a12daae64d7cd65f.png', '所有等级资源免费', '1', '1622544441');
INSERT INTO `zp_privilege` VALUES ('7', '资源分类', '3', 'a:1:{i:0;a:2:{s:2:\"id\";i:0;s:4:\"name\";s:12:\"全部分类\";}}', 'https://zpcms.oss-cn-beijing.aliyuncs.com/public/uploads/20240221/0fefbf41fd53a8a5175ac189d19fecab.png', '所有分类资源免费', '1', '1622544572');
INSERT INTO `zp_privilege` VALUES ('9', '推广佣金', '5', 'a:2:{s:4:\"sell\";s:4:\"0.20\";s:5:\"sell2\";s:3:\"0.1\";}', 'https://zpcms.oss-cn-beijing.aliyuncs.com/public/uploads/20240221/c4e1bda4214a6345d67bf6e4b8e2b3ad.png', '推广资源享有佣金', '1', '1622544615');
INSERT INTO `zp_privilege` VALUES ('10', '推广佣金', '5', 'a:2:{s:4:\"sell\";s:4:\"0.55\";s:5:\"sell2\";s:4:\"0.21\";}', 'https://zpcms.oss-cn-beijing.aliyuncs.com/public/uploads/20240221/b898fadd29ce0ca705013625a60f9b2b.png', '推广资源享有佣金', '1', '1624194668');
INSERT INTO `zp_privilege` VALUES ('11', '资源数量', '2', 's:2:\"15\";', 'https://zpcms.oss-cn-beijing.aliyuncs.com/public/uploads/20240221/2679410c70e377b1e2a82bef96b01ee8.png', '资源数量特权', '1', '1693880403');

-- ----------------------------
-- Table structure for zp_refund_log
-- ----------------------------
DROP TABLE IF EXISTS `zp_refund_log`;
CREATE TABLE `zp_refund_log` (
 `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
 `type` tinyint(1) unsigned DEFAULT '0' COMMENT '1微信支付，2支付宝',
 `ordno` char(48) DEFAULT NULL COMMENT '订单号',
 `refund_ordno` char(48) DEFAULT NULL COMMENT '退款单号',
 `money` decimal(11,2) unsigned DEFAULT '0.00' COMMENT '订单金额',
 `refund_money` decimal(11,2) unsigned DEFAULT '0.00' COMMENT '退款金额',
 `trade_id` varchar(64) DEFAULT NULL COMMENT '第三方交易流水号',
 `status` tinyint(2) DEFAULT '0' COMMENT '0待处理，1提交成功，2退款成功，-1提交失败，-2退款失败',
 `remark` varchar(64) DEFAULT NULL COMMENT '退款备注',
 `reason` varchar(64) DEFAULT NULL COMMENT '退款失败原因',
 `utime` int(10) unsigned DEFAULT '0' COMMENT '退款成功时间',
 `ctime` int(10) unsigned DEFAULT '0' COMMENT '退款提交时间',
 PRIMARY KEY (`id`),
 KEY `idx_ordno` (`ordno`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COMMENT='订单退款记录表';

-- ----------------------------
-- Table structure for zp_resource
-- ----------------------------
DROP TABLE IF EXISTS `zp_resource`;
CREATE TABLE `zp_resource` (
`id` int(11) NOT NULL AUTO_INCREMENT,
`type` tinyint(4) DEFAULT '1' COMMENT '资源类型：1网盘，2视频，3文章',
`admin_id` int(11) unsigned NOT NULL DEFAULT '0' COMMENT '代理ID',
`title` varchar(255) NOT NULL COMMENT '标题',
`thumb` varchar(255) NOT NULL COMMENT '封面图',
`views` int(11) DEFAULT '0' COMMENT '阅读次数',
`favs` int(11) DEFAULT '0' COMMENT '收藏',
`link` varchar(256) DEFAULT NULL COMMENT '资源地址',
`ext_code` varchar(15) DEFAULT NULL COMMENT '提取码',
`status` tinyint(4) DEFAULT '1' COMMENT '状态，0禁用，1上架',
`price` decimal(10,2) DEFAULT '0.00' COMMENT '价格',
`dis_price` decimal(10,2) DEFAULT '0.00' COMMENT '划线价格',
`is_top` tinyint(4) DEFAULT '0' COMMENT '置顶:0否1是',
`desc` varchar(255) DEFAULT NULL COMMENT '简介',
`is_show` tinyint(255) DEFAULT '0' COMMENT '内容显示：0否1是',
`is_fenxiao` tinyint(4) DEFAULT '0' COMMENT '参与分销：0否1是',
`sell_set` tinyint(4) DEFAULT '1' COMMENT '佣金设置：1合伙人设置2商品设置',
`sell_type` tinyint(4) DEFAULT '1' COMMENT '佣金分配方式：1百分比2固定金额',
`sell` varchar(10) DEFAULT NULL COMMENT '佣金',
`sell_type2` tinyint(2) unsigned DEFAULT '0' COMMENT '二级分销设置方式',
`sell2` varchar(10) DEFAULT NULL COMMENT '二级佣金设置',
`sales` int(11) DEFAULT '0' COMMENT '销量',
`edition` int(10) unsigned DEFAULT '0' COMMENT '定制功能的版本',
`level` int(11) DEFAULT '1' COMMENT '1低级2中级3高级',
`invite` tinyint(4) DEFAULT '0' COMMENT '邀请任务：0关闭1开启',
`invite_num` int(11) DEFAULT '0' COMMENT '邀请人数',
`is_buy` tinyint(4) DEFAULT '0' COMMENT '购买，0否1是',
`is_sell` tinyint(4) DEFAULT '0' COMMENT '出售，0否1是-1未通过',
`pages` int(10) unsigned DEFAULT '0' COMMENT '文档页数',
`exc_video` tinyint(4) DEFAULT '0' COMMENT '激励视频：0关闭1开启',
`sync_id` int(10) unsigned DEFAULT '0' COMMENT '同步资源ID',
`uid` int(11) DEFAULT '0',
`utime` int(11) DEFAULT '0',
`ctime` int(11) DEFAULT '0',
PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='资源表';

-- ----------------------------
-- Table structure for zp_resource_info
-- ----------------------------
DROP TABLE IF EXISTS `zp_resource_info`;
CREATE TABLE `zp_resource_info` (
`id` int(11) NOT NULL AUTO_INCREMENT,
`rid` int(10) unsigned DEFAULT '0' COMMENT '资源关联ID',
`free_content` text CHARACTER SET utf8 COMMENT '免费资源介绍',
`content` text CHARACTER SET utf8 COMMENT '资源介绍',
PRIMARY KEY (`id`),
KEY `idx_rid` (`rid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_bin COMMENT='资源介绍内容表';



-- ----------------------------
-- Table structure for zp_resource_kammi
-- ----------------------------
DROP TABLE IF EXISTS `zp_resource_kammi`;
CREATE TABLE `zp_resource_kammi` (
 `id` int(11) NOT NULL AUTO_INCREMENT,
 `cdkey` varchar(128) DEFAULT NULL COMMENT '卡密',
 `rid` int(11) unsigned NOT NULL DEFAULT '0' COMMENT '资源ID',
 `uid` int(11) unsigned DEFAULT '0' COMMENT '用户ID',
 `status` tinyint(2) unsigned DEFAULT '0' COMMENT '0未使用1已使用',
 `utime` int(10) unsigned DEFAULT '0' COMMENT '更新时间',
 `ctime` int(11) DEFAULT '0',
 PRIMARY KEY (`id`),
 KEY `idx_where` (`rid`,`uid`,`ctime`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COMMENT='卡密资源';


-- ----------------------------
-- Table structure for zp_resource_level
-- ----------------------------
DROP TABLE IF EXISTS `zp_resource_level`;
CREATE TABLE `zp_resource_level` (
 `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
 `name` varchar(48) DEFAULT NULL COMMENT '等级名称',
 `indexid` int(11) unsigned DEFAULT '0' COMMENT '排序',
 `status` tinyint(2) unsigned DEFAULT '1' COMMENT '状态',
 `ctime` int(11) unsigned DEFAULT '0',
 PRIMARY KEY (`id`),
 KEY `idx_index` (`indexid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COMMENT='资源等级';

-- ----------------------------
-- Records of zp_resource_level
-- ----------------------------
INSERT INTO `zp_resource_level` VALUES ('1', '初级', '100', '1', '1656906210');
INSERT INTO `zp_resource_level` VALUES ('2', '中级', '101', '1', '1656906438');
INSERT INTO `zp_resource_level` VALUES ('3', '高级', '102', '1', '1656906460');

-- ----------------------------
-- Table structure for zp_resource_sort
-- ----------------------------
DROP TABLE IF EXISTS `zp_resource_sort`;
CREATE TABLE `zp_resource_sort` (
    `id` int(11) NOT NULL AUTO_INCREMENT,
    `pid` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '父ID',
    `name` varchar(48) NOT NULL COMMENT '分类名称',
    `thumb` varchar(128) DEFAULT NULL COMMENT '封面图',
    `status` tinyint(4) DEFAULT '1' COMMENT '是否启用：0禁用1启用',
    `indexid` tinyint(4) DEFAULT '0' COMMENT '排序',
    `ctime` int(11) DEFAULT NULL,
    PRIMARY KEY (`id`),
    KEY `idx_pid` (`pid`),
    KEY `idx_sort` (`indexid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='资源类型表';

-- ----------------------------
-- Records of zp_resource_sort
-- ----------------------------
INSERT INTO `zp_resource_sort` VALUES ('1', '0', '今日头条', 'http://zpcms.oss-cn-beijing.aliyuncs.com/public/uploads/20210611/10556535ecf90fe5ca797b1d7de7cb36.png', '1', '1', '1622169364');
INSERT INTO `zp_resource_sort` VALUES ('2', '0', '闲鱼电商', 'http://zpcms.oss-cn-beijing.aliyuncs.com/public/uploads/20210611/ab3c1a8d9ff72fc4ad4946d10be58c79.png', '1', '2', '1622169364');
INSERT INTO `zp_resource_sort` VALUES ('3', '0', '抖音快手', 'http://zpcms.oss-cn-beijing.aliyuncs.com/public/uploads/20210611/fe8d042e84836728a9272e6fe410253e.png', '1', '3', '1623334406');
INSERT INTO `zp_resource_sort` VALUES ('4', '0', '社群营销', 'http://zpcms.oss-cn-beijing.aliyuncs.com/public/uploads/20210611/1de3be60258cb8314aa865d6e51dd8f5.png', '1', '4', '1623334448');
INSERT INTO `zp_resource_sort` VALUES ('5', '0', '淘宝运营', 'http://zpcms.oss-cn-beijing.aliyuncs.com/public/uploads/20210611/c2c21e072dc903dd0e459d0c57684219.png', '1', '5', '1623334559');
INSERT INTO `zp_resource_sort` VALUES ('6', '0', '爆粉引流', 'http://zpcms.oss-cn-beijing.aliyuncs.com/public/uploads/20210611/696115ad50173edf44f71b1d8f17bd5e.png', '1', '6', '1623334610');
INSERT INTO `zp_resource_sort` VALUES ('7', '0', '自媒体', 'http://zpcms.oss-cn-beijing.aliyuncs.com/public/uploads/20210611/66733e8cc3aec77e7d9a3f4ac7fa4fd1.png', '1', '7', '1623334644');
INSERT INTO `zp_resource_sort` VALUES ('8', '0', '贴吧引流', 'http://zpcms.oss-cn-beijing.aliyuncs.com/public/uploads/20210611/05ce684223a3e67c3e4d6724da5d18a1.png', '1', '8', '1623334679');
INSERT INTO `zp_resource_sort` VALUES ('9', '0', '广告营销', 'http://zpcms.oss-cn-beijing.aliyuncs.com/public/uploads/20210611/033b5993f2d54d1ff9a3e75c9709621e.png', '1', '15', '1623334723');
INSERT INTO `zp_resource_sort` VALUES ('10', '0', '社交电商', 'http://zpcms.oss-cn-beijing.aliyuncs.com/public/uploads/20210611/ea6ef22fd51b51f5143e2f795a0c09cc.png', '1', '10', '1623334779');
INSERT INTO `zp_resource_sort` VALUES ('11', '0', '微信营销', 'http://zpcms.oss-cn-beijing.aliyuncs.com/public/uploads/20210611/02d92f128d58f0a30c2c9bcc2a980cdf.png', '1', '6', '1623334805');
INSERT INTO `zp_resource_sort` VALUES ('12', '0', '淘宝客', 'http://zpcms.oss-cn-beijing.aliyuncs.com/public/uploads/20210611/883412722f401d44fc070b327c0c2eaf.png', '1', '12', '1623334878');

-- ----------------------------
-- Table structure for zp_resource_task
-- ----------------------------
DROP TABLE IF EXISTS `zp_resource_task`;
CREATE TABLE `zp_resource_task` (
    `id` int(11) NOT NULL AUTO_INCREMENT,
    `rid` int(11) NOT NULL COMMENT '资源ID',
    `admin_id` int(11) NOT NULL COMMENT '代理ID',
    `uid` int(11) NOT NULL,
    `invite_num` int(11) DEFAULT '0' COMMENT '邀请人数',
    `is_video` int(11) DEFAULT '0' COMMENT '视频任务',
    `status` tinyint(2) unsigned DEFAULT '0' COMMENT '任务完成情况，0未完成，1已完成',
    `utime` int(10) unsigned DEFAULT '0' COMMENT '更新时间',
    `ctime` int(11) unsigned DEFAULT '0' COMMENT '创建时间',
    PRIMARY KEY (`id`),
    KEY `idx_task` (`uid`,`rid`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COMMENT='邀请任务表';

-- ----------------------------
-- Table structure for zp_resource_type
-- ----------------------------
DROP TABLE IF EXISTS `zp_resource_type`;
CREATE TABLE `zp_resource_type` (
    `id` int(11) NOT NULL AUTO_INCREMENT,
    `rid` int(11) NOT NULL COMMENT '资源ID',
    `sid` int(11) NOT NULL COMMENT '资源类型ID',
    `ctime` int(11) DEFAULT NULL,
    PRIMARY KEY (`id`),
    KEY `idx_sid` (`sid`),
    KEY `idx_rid` (`rid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='资源分类关联表';

-- ----------------------------
-- Table structure for zp_setting
-- ----------------------------
DROP TABLE IF EXISTS `zp_setting`;
CREATE TABLE `zp_setting` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `skey` varchar(30) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '键值',
  `value` text COLLATE utf8mb4_unicode_ci COMMENT '数据',
  PRIMARY KEY (`id`),
  UNIQUE KEY `idx_keys` (`skey`) USING BTREE
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='配置数据表';

-- ----------------------------
-- Records of zp_setting
-- ----------------------------
INSERT INTO `zp_setting` VALUES ('23', 'web_name', '智创云享');
INSERT INTO `zp_setting` VALUES ('77', 'client_key', '----');
INSERT INTO `zp_setting` VALUES ('25', 'web_logo', 'https://zpcms.oss-cn-beijing.aliyuncs.com/uploads/20241007/c514fd92769122adcbc96d94a919f659.png');
INSERT INTO `zp_setting` VALUES ('27', 'web_domain', 'www.domain.com');
INSERT INTO `zp_setting` VALUES ('93', 'agent_day_min', '1');
INSERT INTO `zp_setting` VALUES ('94', 'agent_week_min', '1');
INSERT INTO `zp_setting` VALUES ('95', 'agent_month_min', '1');
INSERT INTO `zp_setting` VALUES ('70', 'app_id', '--');
INSERT INTO `zp_setting` VALUES ('71', 'app_secret', '--');
INSERT INTO `zp_setting` VALUES ('92', 'try_see', '10');
INSERT INTO `zp_setting` VALUES ('73', 'mch_id', '--');
INSERT INTO `zp_setting` VALUES ('74', 'secret_key', '--');
INSERT INTO `zp_setting` VALUES ('85', 'pay_refund', 'https://www.domain.com/index/Notify/wechatRefund');
INSERT INTO `zp_setting` VALUES ('32', 'web_contact', '');
INSERT INTO `zp_setting` VALUES ('33', 'web_phone', '028-60225332');
INSERT INTO `zp_setting` VALUES ('34', 'web_qq', '888888888');
INSERT INTO `zp_setting` VALUES ('36', 'upload_storage', 'local');
INSERT INTO `zp_setting` VALUES ('37', 'upload_domain', '');
INSERT INTO `zp_setting` VALUES ('38', 'upload_keyid', '--');
INSERT INTO `zp_setting` VALUES ('39', 'upload_secret', '--');
INSERT INTO `zp_setting` VALUES ('40', 'upload_endpoint', '--');
INSERT INTO `zp_setting` VALUES ('41', 'upload_bucket', '--');
INSERT INTO `zp_setting` VALUES ('89', 'cash_num', '5');
INSERT INTO `zp_setting` VALUES ('62', 'web_email', '10002@qq.com');
INSERT INTO `zp_setting` VALUES ('63', 'upload_isthumb', '1');
INSERT INTO `zp_setting` VALUES ('64', 'web_qrcode', 'https://zpcms.oss-cn-beijing.aliyuncs.com/uploads/20250524/40efd6c86c974a7031f7e0206891d105.jpg');
INSERT INTO `zp_setting` VALUES ('65', 'web_wechat', '');
INSERT INTO `zp_setting` VALUES ('78', 'client_cert', '----');
INSERT INTO `zp_setting` VALUES ('79', 'notify_url', 'https://www.domain.com/index/Notify/wechatPay');
INSERT INTO `zp_setting` VALUES ('90', 'cash_time', '09:00-23:00');
INSERT INTO `zp_setting` VALUES ('101', 'switch_1', '1');
INSERT INTO `zp_setting` VALUES ('102', 'restc', '0.03');
INSERT INTO `zp_setting` VALUES ('103', 'wechat_share_img', 'http://zpcms.oss-cn-beijing.aliyuncs.com/public/uploads/20210520/a4ad53ad225876bbec6d337c48730726.jpg');
INSERT INTO `zp_setting` VALUES ('104', 'wechat_share_title', '智创云享为您提供各类知识付费资源可免费领取！');
INSERT INTO `zp_setting` VALUES ('105', 'wechat_share_desc', '智创云享为您提供副业项目、创业项目、技能、知识等资源');
INSERT INTO `zp_setting` VALUES ('106', 'video_ids', '--');
INSERT INTO `zp_setting` VALUES ('107', 'cash_fee', '0');
INSERT INTO `zp_setting` VALUES ('108', 'cash_min', '1');
INSERT INTO `zp_setting` VALUES ('109', 'cash_passed', '100');
INSERT INTO `zp_setting` VALUES ('110', 'cash_iswechat', '2');
INSERT INTO `zp_setting` VALUES ('111', 'cash_isalipay', '1');
INSERT INTO `zp_setting` VALUES ('112', 'subscribe_task_id', '--');
INSERT INTO `zp_setting` VALUES ('113', 'subscribe_new_id', '--');
INSERT INTO `zp_setting` VALUES ('114', 'subscribe_cashed_id', '--');
INSERT INTO `zp_setting` VALUES ('115', 'hand_day_max', '10');
INSERT INTO `zp_setting` VALUES ('116', 'hand_day_num', '0');
INSERT INTO `zp_setting` VALUES ('117', 'adv_eject', '15');
INSERT INTO `zp_setting` VALUES ('118', 'adv_refresh', '30');
INSERT INTO `zp_setting` VALUES ('119', 'ios_close', '1');
INSERT INTO `zp_setting` VALUES ('120', 'ios_type', '3');
INSERT INTO `zp_setting` VALUES ('122', 'h5_payurl', 'https://www.domain.com/api/payorder/index');
INSERT INTO `zp_setting` VALUES ('123', 'account_appid', '--');
INSERT INTO `zp_setting` VALUES ('124', 'account_secret', '--');
INSERT INTO `zp_setting` VALUES ('125', 'sms_keyid', '--');
INSERT INTO `zp_setting` VALUES ('126', 'sms_secret', '--');
INSERT INTO `zp_setting` VALUES ('127', 'TemplateCode', 'SMS_000000');
INSERT INTO `zp_setting` VALUES ('128', 'sms_sign', '--');
INSERT INTO `zp_setting` VALUES ('129', 'alipay_appid', '--');
INSERT INTO `zp_setting` VALUES ('130', 'alipay_public_key', '----');
INSERT INTO `zp_setting` VALUES ('131', 'alipay_private_key', '--');
INSERT INTO `zp_setting` VALUES ('132', 'alipay_notify', 'https://www.domain.com/index/Notify/alipay');
INSERT INTO `zp_setting` VALUES ('133', 'account_domain', 'https://h5.27book.cn');
INSERT INTO `zp_setting` VALUES ('134', 'account_mch_id', '--');
INSERT INTO `zp_setting` VALUES ('135', 'account_secret_key', '--');
INSERT INTO `zp_setting` VALUES ('136', 'account_notify', 'https://www.domain.com/index/Notify/accountPay');
INSERT INTO `zp_setting` VALUES ('137', 'is_groups', '1');
INSERT INTO `zp_setting` VALUES ('138', 'is_opendisk', '0');
INSERT INTO `zp_setting` VALUES ('139', 'list_type', '1');
INSERT INTO `zp_setting` VALUES ('141', 'is_cdkey_pay', '1');
INSERT INTO `zp_setting` VALUES ('142', 'vip_article_id', '11');
INSERT INTO `zp_setting` VALUES ('143', 'sale_unit_text', '人学习');
INSERT INTO `zp_setting` VALUES ('150', 'is_jumps', '1');
INSERT INTO `zp_setting` VALUES ('151', 'privacy_artice_id', '2');
INSERT INTO `zp_setting` VALUES ('152', 'service_artice_id', '3');
INSERT INTO `zp_setting` VALUES ('153', 'wechat_open', '2');
INSERT INTO `zp_setting` VALUES ('154', 'wechat_pay_type', '1');
INSERT INTO `zp_setting` VALUES ('155', 'xunhu_api_url', 'https://api.xunhupay.com/payment/do.html');
INSERT INTO `zp_setting` VALUES ('156', 'xunhu_appid', '--');
INSERT INTO `zp_setting` VALUES ('157', 'xunhu_secret', '--');
INSERT INTO `zp_setting` VALUES ('158', 'xunhu_domain', 'https://h5.27book.cn');
INSERT INTO `zp_setting` VALUES ('159', 'xunhu_name', '智创云享');
INSERT INTO `zp_setting` VALUES ('160', 'alipay_open', '1');
INSERT INTO `zp_setting` VALUES ('161', 'alipay_pay_type', '2');
INSERT INTO `zp_setting` VALUES ('162', 'xunhu_ali_api_url', 'https://api.xunhupay.com/payment/do.html');
INSERT INTO `zp_setting` VALUES ('163', 'xunhu_ali_appid', '--');
INSERT INTO `zp_setting` VALUES ('164', 'xunhu_ali_secret', '--');
INSERT INTO `zp_setting` VALUES ('165', 'xunhu_ali_domain', 'https://h5.27book.cn');
INSERT INTO `zp_setting` VALUES ('166', 'xunhu_ali_name', '智创云享');
INSERT INTO `zp_setting` VALUES ('167', 'cash_isbank', '1');
INSERT INTO `zp_setting` VALUES ('168', 'master_url', '');
INSERT INTO `zp_setting` VALUES ('169', 'is_uptime', '1');
INSERT INTO `zp_setting` VALUES ('170', 'vip_cdkey_pay', '0');
INSERT INTO `zp_setting` VALUES ('171', 'is_wallet_person', '1');
INSERT INTO `zp_setting` VALUES ('172', 'is_bind_mobile', '2');
INSERT INTO `zp_setting` VALUES ('173', 'sms_channel', '2');
INSERT INTO `zp_setting` VALUES ('174', 'dxb_user', '--');
INSERT INTO `zp_setting` VALUES ('175', 'dxb_apikey', '--');
INSERT INTO `zp_setting` VALUES ('176', 'dxb_apiurl', 'https://api.smsbao.com/sms');
INSERT INTO `zp_setting` VALUES ('177', 'dxb_temp', '【智创云享】您的验证码是{code}，{time}分钟内有效，如非本人操作，请忽略本短信');
INSERT INTO `zp_setting` VALUES ('178', 'view_type', '0');
INSERT INTO `zp_setting` VALUES ('179', 'account_domains', 'baidu.com\nweixin.com');
INSERT INTO `zp_setting` VALUES ('180', 'agent_min_take', '2');
INSERT INTO `zp_setting` VALUES ('181', 'agent_cash_fee', '10');
INSERT INTO `zp_setting` VALUES ('182', 'agent_min_pub', '5');
INSERT INTO `zp_setting` VALUES ('183', 'agent_cash_num', '1');
INSERT INTO `zp_setting` VALUES ('184', 'agent_cash_time', '09:00-17:00');
INSERT INTO `zp_setting` VALUES ('185', 'agent_min_cash', '100');
INSERT INTO `zp_setting` VALUES ('186', 'agent_max_cash', '1000');
INSERT INTO `zp_setting` VALUES ('187', 'private_key', '--');
INSERT INTO `zp_setting` VALUES ('188', 'coms_logo', 'https://zpcms.oss-cn-beijing.aliyuncs.com/uploads/20250522/b663d7910cebf0d23f120001d5832444.png');
INSERT INTO `zp_setting` VALUES ('189', 'coms_title', '智创云享-知识付费系统服务商-10分钟快速安装赚钱');
INSERT INTO `zp_setting` VALUES ('190', 'coms_keys', '智创云享知识付费系统');
INSERT INTO `zp_setting` VALUES ('191', 'coms_desc', '智创云享知识付费系统');
INSERT INTO `zp_setting` VALUES ('192', 'coms_cppy', 'Copyright © 2025 智创云享 版权所有 &lt;a href=&quot;http://beian.miit.gov.cn/&quot; rel=&quot;nofollow&quot; target=&quot;_blank&quot; class=&quot;footer-yxw-gxb&quot;&gt;蜀ICP备19028294号-3&lt;/a&gt;');
INSERT INTO `zp_setting` VALUES ('193', 'coms_icp', '京ICP10000号');
INSERT INTO `zp_setting` VALUES ('194', 'coms_login_banner', 'https://zpcms.oss-cn-beijing.aliyuncs.com/uploads/20250522/3d979b4b6258ae71cf80afeef1a15652.png');
INSERT INTO `zp_setting` VALUES ('203', 'coms_svip_title', 'SVIP会员边学变赚 - 助你攀登人生高峰');
INSERT INTO `zp_setting` VALUES ('204', 'coms_svip_desc', 'SVIP用户可获取:营销课程+自媒体运营+短视频项目+等在线1000+知识付费类的各类资源课程');
INSERT INTO `zp_setting` VALUES ('205', 'coms_copy', 'Copyright © 2023 智创云享 版权所有 &lt;a href=&quot;http://beian.miit.gov.cn/&quot; rel=&quot;nofollow&quot; target=&quot;_blank&quot;&gt;蜀ICP备19028294号-3&lt;/a&gt;');
INSERT INTO `zp_setting` VALUES ('206', 'coms_wechat', 'https://zpcms.oss-cn-beijing.aliyuncs.com/uploads/20250522/930e8247f12ed1682a404fea1cd32c31.jpg');
INSERT INTO `zp_setting` VALUES ('207', 'coms_stat_code', '--');
INSERT INTO `zp_setting` VALUES ('208', 'coms_tips', '&lt;p&gt;1. 本站所有资源来源于用户上传和网络收集，因此不包含技术服务请大家谅解！&lt;br/&gt;2.本站部分资源包有加密，加密统一密码为：www.51zhanma.cn&lt;br/&gt;3. 本站不保证所提供下载的资源的准确性、安全性和完整性，资源仅供下载学习之用！如有链接无法下载、失效或广告，请联系客服处理！&lt;br/&gt;4. 您必须在下载后的24个小时之内，从您的电脑中彻底删除上述内容资源！如用于商业或者非法用途，与本站无关，一切后果请用户自负！&lt;br/&gt;5. 如果您也有好的资源或教程，您可以投稿发布，用户购买后有销售金额的50%以上的分成收入！&lt;br/&gt;6.如有侵权请联系客服邮件service@zhipall.com&lt;span style=&quot;color: rgb(30, 135, 240); font-family: Lato, sans-serif; font-size: 12px; text-wrap: wrap; background-color: rgb(216, 234, 252);&quot;&gt;&lt;/span&gt;&lt;/p&gt;');
INSERT INTO `zp_setting` VALUES ('209', 'coms_favicon', 'https://zpcms.oss-cn-beijing.aliyuncs.com/uploads/20250522/3c755bc3a195c6fa60d622a5161abf20.ico');
INSERT INTO `zp_setting` VALUES ('210', 'account_url', 'https://www.domain.com/api/wechat');
INSERT INTO `zp_setting` VALUES ('211', 'account_token', '--');
INSERT INTO `zp_setting` VALUES ('212', 'account_aeskey', '--');
INSERT INTO `zp_setting` VALUES ('213', 'is_wechat_pay', '1');
INSERT INTO `zp_setting` VALUES ('214', 'commission_fee', '2');
INSERT INTO `zp_setting` VALUES ('215', 'alipay_root_key', '-----');
INSERT INTO `zp_setting` VALUES ('216', 'alipay_app_public', '-----');
INSERT INTO `zp_setting` VALUES ('217', 'is_quick_login', '0');
INSERT INTO `zp_setting` VALUES ('218', 'is_cdkey_income', '1');
INSERT INTO `zp_setting` VALUES ('219', 'epay_api_url', '--');
INSERT INTO `zp_setting` VALUES ('220', 'epay_api_mchid', '--');
INSERT INTO `zp_setting` VALUES ('221', 'epay_api_key', '--');
INSERT INTO `zp_setting` VALUES ('222', 'alipay_epay_url', '--');
INSERT INTO `zp_setting` VALUES ('223', 'alipay_epay_mchid', '--');
INSERT INTO `zp_setting` VALUES ('224', 'alipay_epay_key', '--');
INSERT INTO `zp_setting` VALUES ('225', 'agent_front_take', '0');
INSERT INTO `zp_setting` VALUES ('226', 'agent_dis_pub', '10');
INSERT INTO `zp_setting` VALUES ('228', 'agent_min_svip', '60');
INSERT INTO `zp_setting` VALUES ('229', 'spread_hand_type', '1');
INSERT INTO `zp_setting` VALUES ('230', 'agent_price_type', '1');
INSERT INTO `zp_setting` VALUES ('231', 'is_wechat_login', '1');
INSERT INTO `zp_setting` VALUES ('232', 'course_type', '0');
INSERT INTO `zp_setting` VALUES ('233', 'kefu_link', 'https://www.hao123.com');
INSERT INTO `zp_setting` VALUES ('234', 'wxpay_mch_id', '--');
INSERT INTO `zp_setting` VALUES ('235', 'wxpay_secret_key', '--');
INSERT INTO `zp_setting` VALUES ('236', 'wxpay_notify', 'https://www.domain.com/index/Notify/accountPay');
INSERT INTO `zp_setting` VALUES ('237', 'ali_pay_appid', '--');
INSERT INTO `zp_setting` VALUES ('238', 'ali_pay_public_key', '--');
INSERT INTO `zp_setting` VALUES ('239', 'ali_pay_root_key', '--');
INSERT INTO `zp_setting` VALUES ('240', 'ali_pay_app_public', '--');
INSERT INTO `zp_setting` VALUES ('241', 'ali_pay_private_key', '--');
INSERT INTO `zp_setting` VALUES ('242', 'ali_pay_notify', '--');
INSERT INTO `zp_setting` VALUES ('243', 'cash_weixin_type', '1');
INSERT INTO `zp_setting` VALUES ('244', 'pay_weixin_serial_no', '');
INSERT INTO `zp_setting` VALUES ('245', 'v3_pay_weixin_key', '');
INSERT INTO `zp_setting` VALUES ('246', 'cash_weixin_serial_no', '--');
INSERT INTO `zp_setting` VALUES ('247', 'pay_weixin_v3_key', '--');
INSERT INTO `zp_setting` VALUES ('250', 'wxnini_xunhu_url', 'https://api.xunhupay.com');
INSERT INTO `zp_setting` VALUES ('249', 'wxnini_pay_type', '0');
INSERT INTO `zp_setting` VALUES ('251', 'wxnini_xunhu_appid', '--');
INSERT INTO `zp_setting` VALUES ('252', 'wxnini_xunhu_secret', '--');
INSERT INTO `zp_setting` VALUES ('253', 'wxnini_xunhu_domain', 'https://api.dpweixin.com');
INSERT INTO `zp_setting` VALUES ('254', 'wxnini_xunhu_name', '智创云享');
INSERT INTO `zp_setting` VALUES ('255', 'view_nosite', 'https://h5.27book.cn');
INSERT INTO `zp_setting` VALUES ('256', 'wxnini_xunhu_miniappid', 'wx2574b5c5ee8da56b');
INSERT INTO `zp_setting` VALUES ('264', 'admin_logo', 'https://zpcms.oss-cn-beijing.aliyuncs.com/uploads/20250327/07f7a6fe4a50aef9f5e384e38306f5e1.png');
INSERT INTO `zp_setting` VALUES ('265', 'agent_auto_spread', '1');
INSERT INTO `zp_setting` VALUES ('266', 'kammi_type', '0');
INSERT INTO `zp_setting` VALUES ('267', 'web_icp', '京ICP10000号');
INSERT INTO `zp_setting` VALUES ('268', 'upload_size', '100');
INSERT INTO `zp_setting` VALUES ('269', 'upload_ext', 'jpg,png,gif,jpeg,ico,zip,rar,doc,docx,xls,xlsx,ppt,pptx,pdf,txt,csv,mp3,mp4,wav,wmv,avi,mov,flv,mkv');
INSERT INTO `zp_setting` VALUES ('270', 'upload_thumb_open', '0');
INSERT INTO `zp_setting` VALUES ('271', 'upload_thumb_width', '640');
INSERT INTO `zp_setting` VALUES ('272', 'upload_thumb_height', '480');
INSERT INTO `zp_setting` VALUES ('273', 'upload_thumb_types', '3');
INSERT INTO `zp_setting` VALUES ('274', 'upload_water_types', '2');
INSERT INTO `zp_setting` VALUES ('275', 'upload_water_image', 'https://zpcms.oss-cn-beijing.aliyuncs.com/uploads/20240719/0d2d5e46e8d7d1f7b52d825b7c3c0f89.png');
INSERT INTO `zp_setting` VALUES ('276', 'upload_water_text', '智创云享');
INSERT INTO `zp_setting` VALUES ('277', 'upload_water_size', '30');
INSERT INTO `zp_setting` VALUES ('278', 'upload_water_color', '#ffffff');
INSERT INTO `zp_setting` VALUES ('279', 'upload_water_alpha', '50');
INSERT INTO `zp_setting` VALUES ('280', 'upload_water_angle', '0');
INSERT INTO `zp_setting` VALUES ('281', 'upload_water_locate', '9');
INSERT INTO `zp_setting` VALUES ('282', 'upload_water_posx', '20');
INSERT INTO `zp_setting` VALUES ('283', 'upload_water_posy', '20');
INSERT INTO `zp_setting` VALUES ('284', 'upload_keyid_qcloud', '--');
INSERT INTO `zp_setting` VALUES ('285', 'upload_secret_qcloud', '--');
INSERT INTO `zp_setting` VALUES ('286', 'upload_domain_qcloud', '--');
INSERT INTO `zp_setting` VALUES ('287', 'upload_bucket_qcloud', '--');
INSERT INTO `zp_setting` VALUES ('288', 'upload_endpoint_qcloud', '--');
INSERT INTO `zp_setting` VALUES ('289', 'upload_keyid_qiniu', '--');
INSERT INTO `zp_setting` VALUES ('290', 'upload_secret_qiniu', '--');
INSERT INTO `zp_setting` VALUES ('291', 'upload_domain_qiniu', '--');
INSERT INTO `zp_setting` VALUES ('292', 'upload_bucket_qiniu', '--');
INSERT INTO `zp_setting` VALUES ('293', 'upload_water_open', '0');
INSERT INTO `zp_setting` VALUES ('294', 'is_passed_mode', '0');
-- ----------------------------
-- Table structure for zp_shopping_cart
-- ----------------------------
DROP TABLE IF EXISTS `zp_shopping_cart`;
CREATE TABLE `zp_shopping_cart` (
`id` int(11) NOT NULL AUTO_INCREMENT,
`thumb` varchar(255) DEFAULT NULL COMMENT '封面图',
`title` varchar(255) DEFAULT NULL COMMENT '标题',
`money` decimal(10,2) DEFAULT NULL COMMENT '价格',
`rid` int(11) DEFAULT NULL COMMENT '资源ID',
`ctime` int(11) DEFAULT NULL,
PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 ROW_FORMAT=DYNAMIC COMMENT='购物车';

-- ----------------------------
-- Records of zp_shopping_cart
-- ----------------------------

-- ----------------------------
-- Table structure for zp_site_order
-- ----------------------------
DROP TABLE IF EXISTS `zp_site_order`;
CREATE TABLE `zp_site_order` (
 `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
 `admin_id` int(10) unsigned DEFAULT '0' COMMENT '上级代理ID',
 `ordno` varchar(24) DEFAULT NULL COMMENT '订单号',
 `money` decimal(12,2) unsigned DEFAULT '0.00' COMMENT '金额',
 `svip_id` int(10) unsigned DEFAULT '0' COMMENT 'svipID',
 `prefix` varchar(64) DEFAULT NULL COMMENT '前缀名称',
 `username` varchar(48) DEFAULT NULL COMMENT '用户名',
 `password` varchar(48) DEFAULT NULL COMMENT '密码',
 `suffix` varchar(48) DEFAULT NULL COMMENT '域名后缀',
 `mobile` varchar(24) DEFAULT NULL COMMENT '手机号码',
 `webname` varchar(64) DEFAULT NULL COMMENT '分站名称',
 `uid` int(10) unsigned DEFAULT '0' COMMENT '用户ID',
 `status` tinyint(2) unsigned DEFAULT '0' COMMENT '0未支付，1已支付',
 `utime` int(11) DEFAULT '0' COMMENT '更新时间',
 `ctime` int(10) unsigned DEFAULT '0' COMMENT '创建时间',
 PRIMARY KEY (`id`),
 KEY `idx_ordno` (`ordno`) USING BTREE,
 KEY `idx_svip_id` (`svip_id`),
 KEY `idx_site` (`uid`,`status`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COMMENT='自助分站订单';

-- ----------------------------
-- Table structure for zp_spread
-- ----------------------------
DROP TABLE IF EXISTS `zp_spread`;
CREATE TABLE `zp_spread` (
 `id` int(11) NOT NULL AUTO_INCREMENT,
 `admin_id` int(10) unsigned DEFAULT '0' COMMENT '代理ID',
 `type` tinyint(4) DEFAULT '1' COMMENT '资源类型：1网盘，2视频，3文章',
 `title` varchar(64) NOT NULL COMMENT '标题',
 `thumb` varchar(128) NOT NULL COMMENT '封面图',
 `views` int(11) unsigned DEFAULT '0' COMMENT '阅读次数',
 `favs` int(11) unsigned DEFAULT '0' COMMENT '收藏',
 `link` varchar(256) DEFAULT NULL COMMENT '资源地址',
 `ext_code` varchar(15) DEFAULT NULL COMMENT '提取码',
 `status` tinyint(2) unsigned DEFAULT '1' COMMENT '状态，0禁用，1上架',
 `price` decimal(10,2) DEFAULT '0.00' COMMENT '价格',
 `dis_price` decimal(10,2) DEFAULT '0.00' COMMENT '划线价格',
 `is_top` tinyint(4) DEFAULT '0' COMMENT '置顶:0否1是',
 `edition` int(10) unsigned DEFAULT '0' COMMENT '定制功能的版本',
 `desc` varchar(256) DEFAULT NULL COMMENT '简介',
 `is_vip` tinyint(4) DEFAULT '-1' COMMENT '是否VIP专属，指定会员，0所有会员，-1普通',
 `is_fenxiao` tinyint(1) DEFAULT '0' COMMENT '参与分销：0否1是',
 `sell_set` tinyint(4) DEFAULT '1' COMMENT '佣金设置：1合伙人设置2商品设置',
 `sell_type` tinyint(2) DEFAULT '1' COMMENT '佣金分配方式：1百分比2固定金额',
 `sell` varchar(10) DEFAULT NULL COMMENT '佣金',
 `sell_type2` tinyint(2) unsigned DEFAULT '0' COMMENT '二级分销设置方式',
 `sell2` varchar(10) DEFAULT NULL COMMENT '二级佣金设置',
 `sales` int(11) unsigned DEFAULT '0' COMMENT '销量',
 `level` tinyint(1) unsigned DEFAULT '1' COMMENT '1低级2中级3高级',
 `invite` tinyint(1) unsigned DEFAULT '0' COMMENT '邀请任务：0关闭1开启',
 `invite_num` int(11) unsigned DEFAULT '0' COMMENT '邀请人数',
 `exc_video` tinyint(1) unsigned DEFAULT '0' COMMENT '激励视频：0关闭，1开启',
 `try_see` int(10) unsigned DEFAULT '0' COMMENT '视频试看时间',
 `pages` int(10) unsigned DEFAULT '0' COMMENT '文档页数',
 `rid` int(11) unsigned DEFAULT '0' COMMENT '资源ID',
 `uid` int(11) unsigned DEFAULT '0' COMMENT '代理用户ID',
 `utime` int(11) unsigned DEFAULT '0' COMMENT '更新时间',
 `ctime` int(11) unsigned DEFAULT '0' COMMENT '创建时间',
 PRIMARY KEY (`id`),
 KEY `idx_type` (`status`,`type`),
 KEY `uid` (`uid`),
 KEY `idx_where` (`id`,`status`),
 KEY `idx_adminid` (`admin_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='资源推广表';

-- ----------------------------
-- Table structure for zp_spread_group
-- ----------------------------
DROP TABLE IF EXISTS `zp_spread_group`;
CREATE TABLE `zp_spread_group` (
   `id` int(11) NOT NULL AUTO_INCREMENT,
   `rid` int(10) unsigned DEFAULT '0' COMMENT '推广资源ID',
   `gid` int(10) unsigned DEFAULT '0' COMMENT '社区ID',
   `ctime` int(10) unsigned DEFAULT '0' COMMENT '添加时间',
   PRIMARY KEY (`id`),
   KEY `idx_union` (`rid`,`gid`,`ctime`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COMMENT='推广资源关联社群';


-- ----------------------------
-- Table structure for zp_spread_hand
-- ----------------------------
DROP TABLE IF EXISTS `zp_spread_hand`;
CREATE TABLE `zp_spread_hand` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `admin_id` int(10) unsigned DEFAULT '0',
  `rid` int(10) unsigned DEFAULT '0' COMMENT '资源ID',
  `r_uid` int(10) unsigned DEFAULT '0' COMMENT '被助力用户',
  `uid` int(10) unsigned DEFAULT '0' COMMENT '助力用户',
  `ctime` int(10) unsigned DEFAULT '0',
  PRIMARY KEY (`id`),
  KEY `idx_where` (`r_uid`,`uid`,`rid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_bin COMMENT='用户助力表';


-- ----------------------------
-- Table structure for zp_spread_jump
-- ----------------------------
DROP TABLE IF EXISTS `zp_spread_jump`;
CREATE TABLE `zp_spread_jump` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `rid` int(10) unsigned DEFAULT '0' COMMENT '推广资源ID',
  `jid` int(10) unsigned DEFAULT '0' COMMENT '跳转ID',
  `ctime` int(10) unsigned DEFAULT '0' COMMENT '添加时间',
  PRIMARY KEY (`id`),
  KEY `idx_union` (`rid`,`jid`,`ctime`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COMMENT='推广资源关联跳转';


-- ----------------------------
-- Table structure for zp_spread_type
-- ----------------------------
DROP TABLE IF EXISTS `zp_spread_type`;
CREATE TABLE `zp_spread_type` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `rid` int(11) NOT NULL COMMENT '资源ID',
  `sid` int(11) NOT NULL COMMENT '资源类型ID',
  `ctime` int(11) DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `idx_sid` (`sid`),
  KEY `idx_rid` (`rid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='推广资源分类关联表';


-- ----------------------------
-- Table structure for zp_spread_view
-- ----------------------------
DROP TABLE IF EXISTS `zp_spread_view`;
CREATE TABLE `zp_spread_view` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `admin_id` int(10) unsigned DEFAULT '0' COMMENT '代理ID',
  `r_id` int(10) unsigned DEFAULT '0' COMMENT '视频ID',
  `num` int(10) unsigned DEFAULT '0' COMMENT '累计数量',
  `ip` varchar(48) DEFAULT NULL COMMENT 'ip地址',
  `uid` int(10) unsigned DEFAULT '0' COMMENT '所属用户ID',
  `ctime` int(10) unsigned DEFAULT '0' COMMENT '创建时间',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb4 COMMENT='访问记录';

-- ----------------------------
-- Table structure for zp_svip
-- ----------------------------
DROP TABLE IF EXISTS `zp_svip`;
CREATE TABLE `zp_svip` (
   `id` int(11) NOT NULL AUTO_INCREMENT,
   `admin_id` int(10) unsigned DEFAULT '1' COMMENT '所属代理ID',
   `type` tinyint(2) unsigned DEFAULT '0' COMMENT '0，默认会员VIP,1为代理套餐',
   `name` varchar(32) DEFAULT NULL COMMENT '套餐名称',
   `days` int(11) unsigned DEFAULT '0' COMMENT '套餐天数',
   `price` decimal(10,2) unsigned DEFAULT '0.00' COMMENT '价格',
   `invite_num` int(11) unsigned DEFAULT '0' COMMENT '邀请任务',
   `level` tinyint(4) unsigned DEFAULT '0' COMMENT '套餐级别',
   `discount` decimal(10,2) unsigned DEFAULT '0.00' COMMENT '折扣',
   `content` varchar(256) DEFAULT NULL COMMENT '会员权益介绍',
   `open` tinyint(1) unsigned DEFAULT '1' COMMENT '前端显示状态，1显示，2隐藏',
   `status` tinyint(2) unsigned DEFAULT '0' COMMENT '状态：0，禁用，1启用',
   `ctime` int(11) unsigned DEFAULT '0' COMMENT '添加时间',
   PRIMARY KEY (`id`),
   KEY `idx_admin_id` (`admin_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COMMENT='SVIP设置';

-- ----------------------------
-- Records of zp_svip
-- ----------------------------
INSERT INTO `zp_svip` VALUES ('1', '1', '0', '黄金月会员', '30', '1.00', '5', '1', '0.00', '在30天的有效期内各等级资源不限类目均可免费获取，且站内免广告', '1', '1', '1621420524');
INSERT INTO `zp_svip` VALUES ('5', '1', '0', '铂金季会员', '90', '98.00', '0', '2', '0.00', '在90天的有效期内各等级资源不限类目均可免费获取，且站内免广告', '1', '1', '1622623514');
INSERT INTO `zp_svip` VALUES ('6', '1', '0', '钻石年会员', '365', '198.00', '0', '3', '0.00', '在365天的有效期内各等级资源不限类目均可免费获取，且免除广告打扰，推广佣金为20%', '1', '1', '1624191743');
INSERT INTO `zp_svip` VALUES ('7', '1', '1', '合伙年会员', '365', '368.00', '0', '4', '0.00', '在365天的有效期内各等级资源不限类目均可免费获取，且免除广告打扰', '1', '1', '1624194861');

-- ----------------------------
-- Table structure for zp_svip_log
-- ----------------------------
DROP TABLE IF EXISTS `zp_svip_log`;
CREATE TABLE `zp_svip_log` (
       `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
       `admin_id` int(10) unsigned DEFAULT '0' COMMENT '代理ID',
       `type` tinyint(2) unsigned DEFAULT '0' COMMENT '升级方式，1购买，2任务，3手动',
       `vid` int(10) unsigned DEFAULT '0' COMMENT '会员等级ID',
       `exp_time` int(10) unsigned DEFAULT '0' COMMENT '过期时间',
       `uid` int(10) unsigned DEFAULT '0' COMMENT '用户ID',
       `ctime` int(10) unsigned DEFAULT '0' COMMENT '升级时间',
       PRIMARY KEY (`id`),
       KEY `idx_admin_id` (`admin_id`),
       KEY `idx_uid` (`uid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COMMENT='会员升级记录';

-- ----------------------------
-- Table structure for zp_svip_privilege
-- ----------------------------
DROP TABLE IF EXISTS `zp_svip_privilege`;
CREATE TABLE `zp_svip_privilege` (
     `id` int(11) NOT NULL AUTO_INCREMENT,
     `vid` int(11) NOT NULL COMMENT '会员类型ID',
     `pid` int(11) NOT NULL COMMENT '特权ID',
     `ctime` int(11) DEFAULT NULL,
     PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COMMENT='会员特权关联表';

-- ----------------------------
-- Records of zp_svip_privilege
-- ----------------------------
INSERT INTO `zp_svip_privilege` VALUES ('62', '5', '5', '1624194989');
INSERT INTO `zp_svip_privilege` VALUES ('63', '5', '7', '1624194989');
INSERT INTO `zp_svip_privilege` VALUES ('85', '7', '5', '1684917392');
INSERT INTO `zp_svip_privilege` VALUES ('86', '7', '7', '1684917392');
INSERT INTO `zp_svip_privilege` VALUES ('105', '6', '5', '1708495010');
INSERT INTO `zp_svip_privilege` VALUES ('106', '6', '7', '1708495010');
INSERT INTO `zp_svip_privilege` VALUES ('107', '6', '11', '1708495010');
INSERT INTO `zp_svip_privilege` VALUES ('120', '1', '7', '1728100904');

-- ----------------------------
-- Table structure for zp_svip_task
-- ----------------------------
DROP TABLE IF EXISTS `zp_svip_task`;
CREATE TABLE `zp_svip_task` (
    `id` int(11) NOT NULL AUTO_INCREMENT,
    `admin_id` int(11) unsigned NOT NULL DEFAULT '0' COMMENT '代理ID',
    `uid` int(11) unsigned NOT NULL DEFAULT '0' COMMENT '用户ID',
    `nums` int(11) unsigned DEFAULT '0' COMMENT '升级数量',
    `vid` int(11) unsigned NOT NULL DEFAULT '0' COMMENT '会员类型ID',
    `ctime` int(11) DEFAULT NULL,
    PRIMARY KEY (`id`),
    KEY `idx_union` (`uid`,`vid`,`ctime`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COMMENT='SVIP会员任务';

-- ----------------------------
-- Records of zp_svip_task
-- ----------------------------

-- ----------------------------
-- Table structure for zp_swiper
-- ----------------------------
DROP TABLE IF EXISTS `zp_swiper`;
CREATE TABLE `zp_swiper` (
     `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
     `type` tinyint(1) unsigned DEFAULT '0' COMMENT '类型，0代理分站申请，1PC首页轮播',
     `title` varchar(50) DEFAULT NULL COMMENT '广告标题',
     `url` varchar(150) DEFAULT NULL COMMENT '广告图片',
     `link` varchar(50) DEFAULT NULL COMMENT '广告链接',
     `style` varchar(150) DEFAULT NULL COMMENT '背景颜色值',
     `status` tinyint(1) unsigned DEFAULT '1' COMMENT '状态，1启用，0禁用',
     `ctime` int(10) unsigned DEFAULT '0' COMMENT '添加时间',
     PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=6 DEFAULT CHARSET=utf8mb4 COMMENT='轮播广告图';

-- ----------------------------
-- Records of zp_swiper
-- ----------------------------
INSERT INTO `zp_swiper` VALUES ('1', '0', '智创云享', 'http://zpcms.oss-cn-beijing.aliyuncs.com/public/uploads/20210627/5b83000ae40f92174b42c92a7e52e298.jpg', '#', null, '1', '1574132170');
INSERT INTO `zp_swiper` VALUES ('2', '0', '分站加盟', 'http://zpcms.oss-cn-beijing.aliyuncs.com/public/uploads/20210627/12d1875233e4b97bf6124c779b4c8a1b.jpg', '#', null, '1', '1574132379');
INSERT INTO `zp_swiper` VALUES ('4', '1', '智创云享', 'https://zpcms.oss-cn-beijing.aliyuncs.com/uploads/20250522/b09a2ba327d3464e466e8b927d6d9e9c.jpg', 'https://wccem.51zhanma.cn/', 'background-color:#2A7EFF;', '1', '1684305835');

-- ----------------------------
-- Table structure for zp_theme
-- ----------------------------
DROP TABLE IF EXISTS `zp_theme`;
CREATE TABLE `zp_theme` (
    `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
    `admin_id` int(10) unsigned DEFAULT '0' COMMENT '所属代理ID',
    `code` varchar(50) CHARACTER SET utf8 DEFAULT NULL COMMENT '可视化区域编码',
    `name` varchar(32) CHARACTER SET utf8 DEFAULT NULL COMMENT '可编辑区域名称',
    `style` varchar(200) DEFAULT NULL COMMENT '页面样式',
    `thumb` varchar(128) DEFAULT NULL COMMENT '模板封面',
    `desc` varchar(255) CHARACTER SET utf8 DEFAULT NULL COMMENT '描述',
    `type` tinyint(1) unsigned DEFAULT '1' COMMENT '1手机端，2PC端',
    `layout` tinyint(2) unsigned DEFAULT '1' COMMENT '布局样式1，首页，2专题页',
    `utime` int(10) unsigned DEFAULT '0' COMMENT '更新日期',
    `ctime` int(10) unsigned DEFAULT '0' COMMENT '添加时间',
    PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 ROW_FORMAT=COMPACT COMMENT='自定义布局表';

-- ----------------------------
-- Records of zp_theme
-- ----------------------------
INSERT INTO `zp_theme` VALUES ('1', '1', 'mobile_home', '移动端首页', '{\"openColor\":\"0\",\"bgColor\":\"#EE2222\",\"openImage\":\"1\",\"bgImage\":\"https:\\/\\/img.51zhanma.cn\\/fee497eec99754876d3f62a84c42481c.jpg\"}', 'http://zpcms.oss-cn-beijing.aliyuncs.com/public/uploads/20210930/4321d4210a3780e5bcfa3cb9c10524ae.jpg', '移动端首页相关操作，可视化移动端、小程序端首页布局', '1', '1', '1745981141', '1624347996');
-- ----------------------------
-- Table structure for zp_theme_config
-- ----------------------------
DROP TABLE IF EXISTS `zp_theme_config`;
CREATE TABLE `zp_theme_config` (
   `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
   `admin_id` int(10) unsigned DEFAULT '0' COMMENT '所属代理ID',
   `name` varchar(32) DEFAULT NULL,
   `page` int(10) unsigned DEFAULT '0' COMMENT '页面名称,默认0，主题颜色，1个人中心，2分类',
   `params` text COMMENT '参数',
   `utime` int(10) unsigned DEFAULT '0' COMMENT '更新时间',
   `ctime` int(10) unsigned DEFAULT '0' COMMENT '添加时间',
   PRIMARY KEY (`id`),
   KEY `idx_admin_id` (`admin_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COMMENT='主题配置表';

-- ----------------------------
-- Records of zp_theme_config
-- ----------------------------
INSERT INTO `zp_theme_config` VALUES ('1', '1', 'default', '0', '{\"title\":\"\\u9ed8\\u8ba4\\u4e3b\\u9898\",\"name\":\"default\",\"themeColor\":{\"nav_bg_color\":\"#ffc037\",\"nav_text_color\":\"#000000\",\"home_bg_color\":\"#ffc037\",\"svip_bg_color\":\"#ffc037\",\"team_bg_color\":\"#ffc037\",\"tab_bg_color\":\"#ffffff\",\"tab_text_color\":\"#999999\",\"tab_text_color_on\":\"#ffc037\",\"tab_border_color\":\"black\",\"show_nav_bg_color\":\"#000000\",\"show_nav_text_color\":\"#ffffff\",\"show_top_bg_color\":\"#ffffff\",\"show_top_text_color\":\"#000000\"},\"tabbar\":{\"limit\":\"5\",\"list\":[{\"image\":\"https:\\/\\/zpcms.oss-cn-beijing.aliyuncs.com\\/icon\\/tabbar\\/default\\/home.png\",\"image_on\":\"https:\\/\\/zpcms.oss-cn-beijing.aliyuncs.com\\/icon\\/tabbar\\/yellow\\/home.png\",\"text\":\"\\u9996\\u9875\",\"linkType\":\"6\",\"linkValue\":\"\\/pages\\/tabbar\\/home\\/index\"},{\"image\":\"https:\\/\\/zpcms.oss-cn-beijing.aliyuncs.com\\/icon\\/tabbar\\/default\\/sort.png\",\"image_on\":\"https:\\/\\/zpcms.oss-cn-beijing.aliyuncs.com\\/icon\\/tabbar\\/yellow\\/sort.png\",\"text\":\"\\u8bfe\\u7a0b\",\"linkType\":\"6\",\"linkValue\":\"\\/pages\\/tabbar\\/sort\\/index\"},{\"image\":\"https:\\/\\/zpcms.oss-cn-beijing.aliyuncs.com\\/icon\\/tabbar\\/default\\/vip.png\",\"image_on\":\"https:\\/\\/zpcms.oss-cn-beijing.aliyuncs.com\\/icon\\/tabbar\\/yellow\\/vip.png\",\"text\":\"\\u4f1a\\u5458\",\"linkType\":\"6\",\"linkValue\":\"\\/pages\\/tabbar\\/vip\\/index\"},{\"image\":\"https:\\/\\/zpcms.oss-cn-beijing.aliyuncs.com\\/icon\\/tabbar\\/default\\/my.png\",\"image_on\":\"https:\\/\\/zpcms.oss-cn-beijing.aliyuncs.com\\/icon\\/tabbar\\/yellow\\/my.png\",\"text\":\"\\u6211\\u7684\",\"linkType\":\"6\",\"linkValue\":\"\\/pages\\/tabbar\\/my\\/index\"}]},\"maincolor\":\"#ffc037\",\"subcolor\":\"#fcc44b\",\"textcolor\":\"#2c2c2c\",\"thumb\":\"https:\\/\\/zpcms.oss-cn-beijing.aliyuncs.com\\/icon\\/theme\\/default.jpg\"}', '1728626730', '1631671377');
INSERT INTO `zp_theme_config` VALUES ('2', '1', null, '2', '{\"search\":{\"style\":\"style1\",\"placeholder\":\"点击搜索资源\"},\"style\":\"style3\",\"color\":{\"bg\":\"#FFF3E9\",\"text\":\"#FF6E3E\"},\"isTop\":0,\"limit\":10}', '1730549980', '1706068149');
INSERT INTO `zp_theme_config` VALUES ('3', '1', null, '1', '{\"topBgcolor\":{\"start\":\"#ffc037\",\"end\":\"#fcc44b\"},\"topTextColor\":\"#000000\",\"cardStyle\":\"style1\",\"list\":[{\"image\":\"https:\\/\\/zpcms.oss-cn-beijing.aliyuncs.com\\/public\\/uploads\\/20240124\\/018272d431f75e36c493d30d49aff686.png\",\"name\":\"\\u6211\\u7684\\u8d44\\u6e90\",\"link\":\"\\/pages\\/my\\/resource\"},{\"image\":\"https:\\/\\/zpcms.oss-cn-beijing.aliyuncs.com\\/public\\/uploads\\/20240124\\/f447dd9726269c1a51e9b0acc0297405.png\",\"name\":\"\\u6211\\u7684\\u56e2\\u961f\",\"link\":\"\\/pages\\/my\\/team\"},{\"image\":\"https:\\/\\/zpcms.oss-cn-beijing.aliyuncs.com\\/public\\/uploads\\/20240124\\/6569a2166ae4406df75349b7b58910a0.png\",\"name\":\"\\u6211\\u7684\\u94b1\\u888b\",\"link\":\"\\/pages\\/my\\/wallet\"},{\"image\":\"https:\\/\\/zpcms.oss-cn-beijing.aliyuncs.com\\/public\\/uploads\\/20240124\\/931d81f6dd313d74c426bf971dc70e38.png\",\"name\":\"\\u6211\\u7684\\u6536\\u85cf\",\"link\":\"\\/pages\\/my\\/favs\"},{\"image\":\"https:\\/\\/zpcms.oss-cn-beijing.aliyuncs.com\\/public\\/uploads\\/20240124\\/198d36f49a6d2c882bdb3c41ee97c945.png\",\"name\":\"\\u5e2e\\u52a9\\u4e2d\\u5fc3\",\"link\":\"\\/pages\\/article\\/list?sort_id=2\"},{\"image\":\"https:\\/\\/zpcms.oss-cn-beijing.aliyuncs.com\\/public\\/uploads\\/20240124\\/2333d2260886b402dec66a9fadcaf0b8.png\",\"name\":\"\\u8054\\u7cfb\\u6211\\u4eec\",\"link\":\"\\/pages\\/my\\/contact\"}]}', '1706513323', '1728626730');

-- ----------------------------
-- Table structure for zp_theme_items
-- ----------------------------
DROP TABLE IF EXISTS `zp_theme_items`;
CREATE TABLE `zp_theme_items` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `admin_id` int(11) unsigned DEFAULT '0' COMMENT '代理ID',
  `widget_code` varchar(50) CHARACTER SET utf8 NOT NULL DEFAULT '' COMMENT '组件编码',
  `page_code` varchar(50) CHARACTER SET utf8 NOT NULL DEFAULT '' COMMENT '页面编码',
  `position_id` tinyint(2) unsigned NOT NULL DEFAULT '1' COMMENT '布局位置',
  `sort` tinyint(2) unsigned NOT NULL DEFAULT '1' COMMENT '排序，越小越靠前',
  `params` text CHARACTER SET utf8 COMMENT '组件配置内容',
  `ctime` int(10) unsigned DEFAULT '0' COMMENT '添加时间',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 ROW_FORMAT=COMPACT COMMENT='自定义布局配置项';

INSERT INTO `zp_theme_items` VALUES ('1', '1', 'search', 'mobile_home', '0', '1', '{\"keywords\":\"搜索资源\",\"style\":\"round\"}', '1745981141');
INSERT INTO `zp_theme_items` VALUES ('2', '1', 'imgSlide', 'mobile_home', '1', '2', '{\"duration\":\"2500\",\"list\":[{\"image\":\"https:\\/\\/we.51zhanma.cn\\/uploads\\/20210908\\/4afcf40228e0dbd18b45241cd28a7f1c.jpg\",\"linkType\":\"3\",\"linkValue\":\"\"},{\"image\":\"http:\\/\\/we.51zhanma.cn\\/uploads\\/20210901\\/0ac1477a23de715a9bc4746dcd1b28c1.jpg\",\"linkType\":\"6\",\"linkValue\":\"\\/pages\\/tabbar\\/vip\\/index\"},{\"url\":\"\",\"image\":\"https:\\/\\/we.51zhanma.cn\\/uploads\\/20210908\\/4bb5fdb7eb15a79b6b3bf6722c447e5f.jpg\",\"linkType\":\"6\",\"linkValue\":\"\\/pages\\/resource\\/index?id=3\"}]}', '1745981141');
INSERT INTO `zp_theme_items` VALUES ('3', '1', 'notice', 'mobile_home', '2', '3', '{\"type\":\"auto\",\"list\":[{\"id\":1,\"thumb\":\"\",\"title\":\"学习网络创业，选择智创云享\",\"views\":19,\"ctime\":\"1970-01-01\",\"ctime_text\":\"1970-01-01 08:00:00\"}]}', '1745981141');
INSERT INTO `zp_theme_items` VALUES ('4', '1', 'imgWindow', 'mobile_home', '3', '4', '{\"style\":2,\"margin\":4,\"list\":[{\"image\":\"https:\\/\\/zpcms.oss-cn-beijing.aliyuncs.com\\/uploads\\/20240719\\/cbc61f0aae840c82967b49dd657c1be9.png\",\"linkType\":\"6\",\"linkValue\":\"\\/pages\\/subsite\\/index\",\"status\":1},{\"image\":\"https:\\/\\/zpcms.oss-cn-beijing.aliyuncs.com\\/uploads\\/20240719\\/ff307b0d3e25d59f33661c31632047f7.png\",\"linkType\":\"6\",\"linkValue\":\"\\/pages\\/article\\/show?id=5\",\"status\":1}]}', '1745981141');
INSERT INTO `zp_theme_items` VALUES ('5', '1', 'navBar', 'mobile_home', '5', '6', '{\"limit\":\"5\",\"style\":\"round\",\"list\":[{\"image\":\"https:\\/\\/we.51zhanma.cn\\/uploads\\/20210901\\/c1ae2aae156342129447bc485154f99f.png\",\"text\":\"今日头条\",\"linkType\":\"1\",\"linkValue\":\"\"},{\"image\":\"https:\\/\\/we.51zhanma.cn\\/uploads\\/20210901\\/2e7ecb47acba4caa138a7c10ed56fc37.png\",\"text\":\"闲鱼电商\",\"linkType\":\"3\",\"linkValue\":\"2\"},{\"image\":\"https:\\/\\/we.51zhanma.cn\\/uploads\\/20210901\\/523c1556b1b45b20a91dd4804ecb3ba9.png\",\"text\":\"社群营销\",\"linkType\":\"3\",\"linkValue\":\"4\"},{\"image\":\"https:\\/\\/we.51zhanma.cn\\/uploads\\/20210901\\/eaa5adf22c629383726c69d26b1fae77.png\",\"text\":\"淘宝电商\",\"linkType\":\"3\",\"linkValue\":\"5\"},{\"url\":\"\",\"image\":\"https:\\/\\/we.51zhanma.cn\\/uploads\\/20210901\\/9b6a298047927749b7b99d394175d115.png\",\"text\":\"抖音快手\",\"linkType\":\"3\",\"linkValue\":\"3\"}]}', '1745981141');
INSERT INTO `zp_theme_items` VALUES ('6', '1', 'navBar', 'mobile_home', '6', '7', '{\"limit\":\"5\",\"style\":\"round\",\"list\":[{\"image\":\"https:\\/\\/we.51zhanma.cn\\/uploads\\/20210901\\/c17e5d773641e609a42afb5e67343744.png\",\"text\":\"微信营销\",\"linkType\":\"3\",\"linkValue\":\"11\"},{\"image\":\"https:\\/\\/we.51zhanma.cn\\/uploads\\/20210901\\/29a048474e5c80342ef5cbe228ff6d42.png\",\"text\":\"爆粉引流\",\"linkType\":\"3\",\"linkValue\":\"6\"},{\"image\":\"https:\\/\\/we.51zhanma.cn\\/uploads\\/20210901\\/569fd362784091aeb44aadfe969725f3.png\",\"text\":\"自媒体\",\"linkType\":\"3\",\"linkValue\":\"7\"},{\"image\":\"http:\\/\\/zpcms.oss-cn-beijing.aliyuncs.com\\/public\\/uploads\\/20210930\\/7f39e4dfcad6f3f7029427ee546ee962.png\",\"text\":\"社交电商\",\"linkType\":\"3\",\"linkValue\":\"10\"},{\"url\":\"\",\"image\":\"https:\\/\\/we.51zhanma.cn\\/uploads\\/20210901\\/099102950db32e4b545fde1cf87fe38d.png\",\"text\":\"所有分类\",\"linkType\":\"6\",\"linkValue\":\"\\/pages\\/resource\\/sorts\"}]}', '1745981141');
INSERT INTO `zp_theme_items` VALUES ('7', '1', 'resource', 'mobile_home', '7', '8', '{\"title\":\"推荐资源\",\"lookMore\":\"true\",\"is_top\":\"1\",\"type\":\"auto\",\"classifyId\":0,\"limit\":\"10\",\"display\":\"slide\",\"column\":\"2\",\"list\":[]}', '1745981141');
INSERT INTO `zp_theme_items` VALUES ('8', '1', 'resource', 'mobile_home', '8', '9', '{\"title\":\"副业项目\",\"lookMore\":\"true\",\"is_top\":\"0\",\"type\":\"auto\",\"classifyId\":1,\"limit\":\"4\",\"display\":\"list\",\"column\":\"2\",\"list\":[]}', '1745981141');
INSERT INTO `zp_theme_items` VALUES ('9', '1', 'resource', 'mobile_home', '9', '10', '{\"title\":\"最新资源\",\"lookMore\":\"true\",\"is_top\":\"0\",\"type\":\"auto\",\"classifyId\":0,\"limit\":\"20\",\"display\":\"list\",\"column\":\"2\",\"list\":[{\"id\":16723,\"title\":\"用Claude写小说：从27万字“废稿”到3天签约的逆袭秘籍\",\"thumb\":\"https:\\/\\/i.visvn.com\\/uploads\\/20250411\\/8080395aff1d1a7ef2230a082f2473da.png\",\"price\":\"1.00\",\"dis_price\":\"0.00\",\"sales\":230,\"level\":2,\"type\":3,\"utime\":1745226130,\"ctime\":\"2025-04-21 17:02:10\",\"is_vip\":-1},{\"id\":16724,\"title\":\"用AI做人生感悟视频，经过测试4条视频收益782\",\"thumb\":\"https:\\/\\/i.visvn.com\\/uploads\\/20250411\\/120f8ca64595846f6d7565257129e983.png\",\"price\":\"1.00\",\"dis_price\":\"0.00\",\"sales\":237,\"level\":2,\"type\":1,\"utime\":1745226130,\"ctime\":\"2025-04-21 17:02:10\",\"is_vip\":-1},{\"id\":16725,\"title\":\"直播间实时转播可带货可赚打赏，轻副业重收入，玩法简单\",\"thumb\":\"https:\\/\\/i.visvn.com\\/uploads\\/20250411\\/fc6df6584f0e5970773180dfdee6d139.png\",\"price\":\"1.00\",\"dis_price\":\"0.00\",\"sales\":217,\"level\":2,\"type\":1,\"utime\":1745226130,\"ctime\":\"2025-04-21 17:02:10\",\"is_vip\":-1},{\"id\":16726,\"title\":\"用AI做古医反向吐槽养生视频，条条10w+，4000字详细教程！\",\"thumb\":\"https:\\/\\/i.visvn.com\\/uploads\\/20250410\\/398c3c817eb0717b861c1f49ab203ad9.png\",\"price\":\"1.00\",\"dis_price\":\"0.00\",\"sales\":229,\"level\":2,\"type\":3,\"utime\":1745226130,\"ctime\":\"2025-04-21 17:02:10\",\"is_vip\":-1},{\"id\":16727,\"title\":\"赚到的第 1 美金，AI 开发 iOS 付费 APP 全流程\",\"thumb\":\"https:\\/\\/i.visvn.com\\/uploads\\/20250410\\/fde2bcdc2e8ac799fcc220c0e4ec7c3c.png\",\"price\":\"1.00\",\"dis_price\":\"0.00\",\"sales\":246,\"level\":2,\"type\":3,\"utime\":1745226130,\"ctime\":\"2025-04-21 17:02:10\",\"is_vip\":-1},{\"id\":16728,\"title\":\"DY影视搬运手搓教程，搬运新号10个作品必爆\",\"thumb\":\"https:\\/\\/i.visvn.com\\/uploads\\/20250410\\/79db719a7ee20f827f45c930392ee092.png\",\"price\":\"1.00\",\"dis_price\":\"0.00\",\"sales\":242,\"level\":2,\"type\":1,\"utime\":1745226130,\"ctime\":\"2025-04-21 17:02:10\",\"is_vip\":-1},{\"id\":16729,\"title\":\"AI赋能历史人物复活术：从0到1打造爆款短视频\",\"thumb\":\"https:\\/\\/i.visvn.com\\/uploads\\/20250410\\/74592985b4bbac9395de022643b8fe8c.png\",\"price\":\"1.00\",\"dis_price\":\"0.00\",\"sales\":225,\"level\":2,\"type\":1,\"utime\":1745226130,\"ctime\":\"2025-04-21 17:02:10\",\"is_vip\":-1},{\"id\":16730,\"title\":\"10万+治愈奶奶图文用Coze一键量产，附工作流教学\",\"thumb\":\"https:\\/\\/i.visvn.com\\/uploads\\/20250409\\/1d7ce2f389ec33e1a2780c1c270b411c.png\",\"price\":\"1.00\",\"dis_price\":\"0.00\",\"sales\":207,\"level\":1,\"type\":3,\"utime\":1745226130,\"ctime\":\"2025-04-21 17:02:10\",\"is_vip\":-1},{\"id\":16731,\"title\":\"DeepSeek+项目拆解做知识付费创业类 AIP，全链路实操教程\",\"thumb\":\"https:\\/\\/i.visvn.com\\/uploads\\/20250409\\/280af0b9d475fbbfbdfd597c9437832c.png\",\"price\":\"1.00\",\"dis_price\":\"0.00\",\"sales\":255,\"level\":2,\"type\":3,\"utime\":1745226130,\"ctime\":\"2025-04-21 17:02:10\",\"is_vip\":-1},{\"id\":16732,\"title\":\"上市公司2 万培训单，从需求对接到交付，全流程复盘\",\"thumb\":\"https:\\/\\/i.visvn.com\\/uploads\\/20250409\\/e34919eb64a9ea87443d5af582b0005f.png\",\"price\":\"1.00\",\"dis_price\":\"0.00\",\"sales\":244,\"level\":2,\"type\":3,\"utime\":1745226130,\"ctime\":\"2025-04-21 17:02:10\",\"is_vip\":-1},{\"id\":16733,\"title\":\"测试\",\"thumb\":\"https:\\/\\/zpcms.oss-cn-beijing.aliyuncs.com\\/uploads\\/20240810\\/7c74a410ad0ead88a8a7fe467dfcaf26.png\",\"price\":\"1.00\",\"dis_price\":\"0.00\",\"sales\":95,\"level\":1,\"type\":1,\"utime\":1745226130,\"ctime\":\"2025-04-21 17:02:10\",\"is_vip\":-1}],\"fresh\":\"1\"}', '1745981141');
INSERT INTO `zp_theme_items` VALUES ('10', '1', 'textarea', 'mobile_home', '10', '11', '\"<p style=\\\"text-align: center;\\\"><a href=\\\"https:\\/\\/beian.miit.gov.cn\\/\\\" target=\\\"_self\\\">蜀ICP备101901910号<\\/a><\\/p>\"', '1745981141');
INSERT INTO `zp_theme_items` VALUES ('11', '1', 'tabbar', 'mobile_home', '11', '12', '{\"limit\":\"5\",\"list\":[{\"image\":\"https:\\/\\/zpcms.oss-cn-beijing.aliyuncs.com\\/icon\\/tabbar\\/default\\/home.png\",\"image_on\":\"https:\\/\\/zpcms.oss-cn-beijing.aliyuncs.com\\/icon\\/tabbar\\/yellow\\/home.png\",\"text\":\"首页\",\"linkType\":\"6\",\"linkValue\":\"\\/pages\\/tabbar\\/home\\/index\"},{\"image\":\"https:\\/\\/zpcms.oss-cn-beijing.aliyuncs.com\\/icon\\/tabbar\\/default\\/sort.png\",\"image_on\":\"https:\\/\\/zpcms.oss-cn-beijing.aliyuncs.com\\/icon\\/tabbar\\/yellow\\/sort.png\",\"text\":\"课程\",\"linkType\":\"6\",\"linkValue\":\"\\/pages\\/tabbar\\/sort\\/index\"},{\"image\":\"https:\\/\\/zpcms.oss-cn-beijing.aliyuncs.com\\/icon\\/tabbar\\/default\\/vip.png\",\"image_on\":\"https:\\/\\/zpcms.oss-cn-beijing.aliyuncs.com\\/icon\\/tabbar\\/yellow\\/vip.png\",\"text\":\"会员\",\"linkType\":\"6\",\"linkValue\":\"\\/pages\\/tabbar\\/vip\\/index\"},{\"image\":\"https:\\/\\/zpcms.oss-cn-beijing.aliyuncs.com\\/icon\\/tabbar\\/default\\/my.png\",\"image_on\":\"https:\\/\\/zpcms.oss-cn-beijing.aliyuncs.com\\/icon\\/tabbar\\/yellow\\/my.png\",\"text\":\"我的\",\"linkType\":\"6\",\"linkValue\":\"\\/pages\\/tabbar\\/my\\/index\"}]}', '1745981141');

-- ----------------------------
-- Table structure for zp_user
-- ----------------------------
DROP TABLE IF EXISTS `zp_user`;
CREATE TABLE `zp_user` (
   `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
   `pid` int(11) DEFAULT '0' COMMENT '上级ID',
   `admin_id` int(10) unsigned DEFAULT '0' COMMENT '代理ID',
   `username` varchar(50) DEFAULT NULL COMMENT '用户名',
   `avatar` varchar(200) DEFAULT NULL COMMENT '头像',
   `pwd` varchar(32) DEFAULT NULL COMMENT '密码',
   `salt` varchar(6) DEFAULT NULL COMMENT '盐值',
   `balance` decimal(11,2) unsigned DEFAULT '0.00' COMMENT '余额',
   `mobile` varchar(11) DEFAULT NULL COMMENT '手机号码',
   `nickname` varchar(50) DEFAULT NULL COMMENT '昵称',
   `realname` varchar(50) DEFAULT NULL COMMENT '真实姓名',
   `account` varchar(64) DEFAULT NULL COMMENT '支付宝账户',
   `company` varchar(50) DEFAULT NULL COMMENT '公司名称',
   `province_id` int(10) unsigned DEFAULT '0',
   `city_id` int(10) unsigned DEFAULT '0',
   `county_id` int(255) unsigned DEFAULT '0',
   `address` varchar(80) DEFAULT NULL COMMENT '地址',
   `is_rzbiz` tinyint(1) unsigned DEFAULT '0' COMMENT '认证，0未认证，1待审核，2审核，-1拒绝',
   `token` varchar(32) DEFAULT NULL COMMENT '用户登录后token',
   `acc_openid` varchar(64) DEFAULT NULL COMMENT '公众号用户openid',
   `openid` varchar(50) DEFAULT NULL COMMENT '微信openid',
   `unionid` varchar(50) DEFAULT NULL COMMENT 'unionid',
   `tt_openid` varchar(64) DEFAULT NULL COMMENT '头条用户openid',
   `r_nums` int(10) unsigned DEFAULT '0' COMMENT '当天已获取资源数量，SVIP方式',
   `site_uid` int(10) unsigned DEFAULT '0' COMMENT '代理ID',
   `status` tinyint(1) unsigned DEFAULT '1' COMMENT '状态，1正常，0禁用',
   `login_time` int(11) unsigned DEFAULT '0' COMMENT '登录时间',
   `ctime` int(11) unsigned DEFAULT '0' COMMENT '注册时间',
   `utime` int(11) unsigned DEFAULT '0' COMMENT '登录时间',
   `vid` int(11) DEFAULT '0' COMMENT '会员类型ID',
   `level` tinyint(4) DEFAULT '0' COMMENT '用户等级：0普通1会员2合伙人',
   `exp_time` int(11) unsigned NOT NULL DEFAULT '0' COMMENT '会员过期时间',
   `bankname` varchar(64) DEFAULT NULL COMMENT '银行名称',
   `bankno` varchar(48) DEFAULT NULL COMMENT '银行账号',
   PRIMARY KEY (`id`),
   UNIQUE KEY `openid` (`openid`),
   KEY `idx_token` (`token`),
   KEY `idx_admin_id` (`admin_id`),
   KEY `idx_pid` (`pid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COMMENT='用户表';

-- ----------------------------
-- Table structure for zp_user_cash
-- ----------------------------
DROP TABLE IF EXISTS `zp_user_cash`;
CREATE TABLE `zp_user_cash` (
    `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
    `admin_id` int(10) unsigned DEFAULT '0',
    `ordno` char(48) DEFAULT NULL COMMENT '提现订单号',
    `type` tinyint(1) unsigned NOT NULL DEFAULT '0' COMMENT '方式:1=支付宝,2=微信,3=其他',
    `money` decimal(11,2) unsigned DEFAULT '0.00' COMMENT '提现余额',
    `fee` decimal(11,2) unsigned DEFAULT '0.00' COMMENT '手续费',
    `amount` decimal(11,2) unsigned DEFAULT '0.00' COMMENT '实际付款金额',
    `account` varchar(64) DEFAULT NULL COMMENT '支付宝账户名',
    `bankname` varchar(64) DEFAULT NULL COMMENT '银行名称',
    `realname` varchar(48) DEFAULT NULL COMMENT '真实姓名',
    `bankno` varchar(48) DEFAULT NULL COMMENT '银行账号',
    `image` varchar(128) DEFAULT NULL COMMENT '收款二维码',
    `remark` varchar(256) DEFAULT NULL COMMENT '备注',
    `package` varchar(256) DEFAULT NULL COMMENT '微信商家转账页面信息',
    `confirm` tinyint(1) unsigned DEFAULT '0' COMMENT '商家确认收款状态',
    `reason` varchar(256) DEFAULT NULL COMMENT '审核操作原因',
    `status` tinyint(2) NOT NULL DEFAULT '0' COMMENT '审核状态:0=审核中,1=通过,-1=不通过,2=已打款(完成)',
    `uid` int(11) unsigned NOT NULL DEFAULT '0' COMMENT '申请提现用户',
    `utime` int(11) unsigned NOT NULL DEFAULT '0' COMMENT '审核时间',
    `ctime` int(11) unsigned NOT NULL DEFAULT '0' COMMENT '申请时间',
    PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COMMENT='提现明细';

-- ----------------------------
-- Table structure for zp_user_coll
-- ----------------------------
DROP TABLE IF EXISTS `zp_user_coll`;
CREATE TABLE `zp_user_coll` (
    `id` int(11) NOT NULL AUTO_INCREMENT,
    `uid` int(11) DEFAULT NULL,
    `rid` int(11) DEFAULT NULL COMMENT '资源id',
    `ctime` int(11) DEFAULT NULL,
    PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COMMENT='收藏表';

-- ----------------------------
-- Table structure for zp_user_level
-- ----------------------------
DROP TABLE IF EXISTS `zp_user_level`;
CREATE TABLE `zp_user_level` (
     `id` smallint(4) unsigned NOT NULL AUTO_INCREMENT COMMENT '表id',
     `name` varchar(30) DEFAULT NULL COMMENT '头衔名称',
     `indexid` int(3) DEFAULT '0' COMMENT '排序',
     `min` int(5) DEFAULT '0' COMMENT '积分下限',
     `max` int(5) DEFAULT '0' COMMENT '积分上限',
     `status` tinyint(1) unsigned DEFAULT '1' COMMENT '状态，1启用，0禁用',
     PRIMARY KEY (`id`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COMMENT='  用户等级表';


-- ----------------------------
-- Table structure for zp_user_qrcode
-- ----------------------------
DROP TABLE IF EXISTS `zp_user_qrcode`;
CREATE TABLE `zp_user_qrcode` (
      `id` int(11) NOT NULL AUTO_INCREMENT,
      `uid` int(10) unsigned DEFAULT '0' COMMENT '用户ID',
      `ticket` varchar(128) DEFAULT NULL COMMENT '二维码的ticket',
      `key` varchar(48) DEFAULT NULL COMMENT '用户登录IP',
      `from_id` int(10) unsigned DEFAULT '0' COMMENT '分站ID',
      `rid` int(10) unsigned DEFAULT '0' COMMENT '资源ID',
      `invite_uid` int(10) unsigned DEFAULT '0' COMMENT '邀请人ID',
      `utime` int(10) unsigned DEFAULT '0' COMMENT '更新时间',
      `ctime` int(10) unsigned DEFAULT '0' COMMENT '创建时间',
      PRIMARY KEY (`id`),
      KEY `idx_key` (`key`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- ----------------------------
-- Table structure for zp_user_resource
-- ----------------------------
DROP TABLE IF EXISTS `zp_user_resource`;
CREATE TABLE `zp_user_resource` (
    `id` int(11) NOT NULL AUTO_INCREMENT,
    `admin_id` int(11) NOT NULL DEFAULT '0' COMMENT '代理ID',
    `rid` int(11) NOT NULL COMMENT '资源ID',
    `type` tinyint(4) unsigned DEFAULT '1' COMMENT '1购买，2任务获取，3会员获取',
    `uid` int(11) unsigned NOT NULL DEFAULT '0',
    `work_id` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '卡密资源ID',
    `ctime` int(11) NOT NULL,
    PRIMARY KEY (`id`),
    KEY `idx_res` (`uid`,`rid`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COMMENT='我的资源';


-- ----------------------------
-- Table structure for zp_user_subscribe
-- ----------------------------
DROP TABLE IF EXISTS `zp_user_subscribe`;
CREATE TABLE `zp_user_subscribe` (
     `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
     `admin_id` int(10) unsigned DEFAULT '0' COMMENT '代理商ID',
     `rid` int(10) unsigned DEFAULT '0' COMMENT '资源ID',
     `name` varchar(32) DEFAULT NULL COMMENT '模板名称',
     `temp_id` varchar(64) DEFAULT NULL COMMENT '模板ID',
     `result` varchar(12) DEFAULT NULL COMMENT '订阅结果',
     `uid` int(11) unsigned DEFAULT '0' COMMENT '用户订阅',
     `ctime` int(11) unsigned DEFAULT '0',
     PRIMARY KEY (`id`),
     KEY `idx_uid` (`uid`),
     KEY `idx_where` (`temp_id`,`rid`,`uid`,`result`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb4 COMMENT='用户微信模板订阅消息结果';

-- ----------------------------
-- Table structure for zp_user_third
-- ----------------------------
DROP TABLE IF EXISTS `zp_user_third`;
CREATE TABLE `zp_user_third` (
     `id` int(10) unsigned NOT NULL AUTO_INCREMENT COMMENT '用户ID',
     `type` tinyint(1) unsigned DEFAULT '1' COMMENT '第三方登录类型:1微信小程序,2微信公众号,3,抖音,4百度,5APP',
     `uid` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '关联用户表',
     `openid` varchar(50) DEFAULT NULL COMMENT '第三方openid',
     `session_key` varchar(50) DEFAULT NULL,
     `unionid` varchar(50) DEFAULT NULL,
     `avatar` varchar(256) DEFAULT NULL COMMENT '头像',
     `nickname` varchar(50) DEFAULT NULL COMMENT '昵称',
     `gender` smallint(1) unsigned NOT NULL DEFAULT '0' COMMENT '性别 0：未知、1：男、2：女',
     `language` varchar(50) DEFAULT NULL COMMENT '语言',
     `city` varchar(80) DEFAULT NULL COMMENT '城市',
     `province` varchar(80) DEFAULT NULL COMMENT '省',
     `country` varchar(80) DEFAULT NULL COMMENT '国家',
     `country_code` varchar(20) DEFAULT NULL COMMENT '手机号码国家编码',
     `mobile` varchar(20) DEFAULT NULL COMMENT '手机号码',
     `ctime` int(11) unsigned DEFAULT '0' COMMENT '创建时间',
     `utime` int(11) unsigned DEFAULT '0' COMMENT '更新时间',
     PRIMARY KEY (`id`) USING BTREE,
     KEY `idx_type` (`type`),
     KEY `idx_uid` (`uid`),
     KEY `idx_openid` (`openid`),
     KEY `idx_union` (`unionid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 ROW_FORMAT=COMPACT COMMENT='第三方平台登录用户表';

-- ----------------------------
-- Table structure for zp_validate
-- ----------------------------
DROP TABLE IF EXISTS `zp_validate`;
CREATE TABLE `zp_validate` (
   `id` int(11) NOT NULL AUTO_INCREMENT,
   `mobile` varchar(15) DEFAULT NULL,
   `code` varchar(10) DEFAULT NULL COMMENT '验证码',
   `status` tinyint(2) unsigned DEFAULT '0' COMMENT '0未使用1已使用',
   `ctime` int(11) unsigned DEFAULT '0',
   PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COMMENT='验证码表';

-- ----------------------------
-- Table structure for zp_versions
-- ----------------------------
DROP TABLE IF EXISTS `zp_versions`;
CREATE TABLE `zp_versions` (
   `id` int(11) NOT NULL AUTO_INCREMENT,
   `versions` varchar(64) DEFAULT NULL COMMENT '版本名称',
   `versions_nums` int(10) unsigned DEFAULT NULL COMMENT '实际版本号',
   `content` text COMMENT '更新说明',
   `package` varchar(128) DEFAULT NULL COMMENT '更新包地址',
   `vnums` varchar(32) DEFAULT NULL COMMENT '常规版本号',
   `ptime` int(11) unsigned DEFAULT '0' COMMENT '发布时间',
   `ctime` int(11) unsigned DEFAULT '0' COMMENT '更新时间',
   PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COMMENT='版本信息';

INSERT INTO `zp_versions` VALUES ('1', 'v5.0.15', '5015', '本次更新需要先安装swoole_loader扩展，联系客服获取扩展 \n 1、新增：个人主体微信小程序虎皮椒微信支付\n 2、新增：用户提现支持新版商家转账功能 \n 3、新增：存储设置支持缩略图、图片水印功能\n 4、新增：系统更新日志、下载更新包功能\n 5、新增：资源管理支持资源复制功能\n 6、新增：代理分站支持生成卡密功能 7、新增：主站支持下发和控制分站生成卡密功能\n 8、新增：总站和代理的管理后台分离\n 9、新增：PC小程序支持文档直接下载功能\n 10、新增：代理分站支持开通时设置自动同步推广资源功能\n 11、新增：素材管理支持多文件上传和文件检索\n 12、新增：个人小程序支持过审模式\n 13、优化：系统架构优化，增强系统负载能力\n 14、优化：文档转发下载、在线预览显示文档名称\n 15、优化：PC端支持虎皮椒微信和支付宝扫码支付\n 16、优化：管理后台UI界面优化\n 17、优化：助力记录根据助力类型优化显示\n 18、优化：优化在线更新进度和更新流程\n 19、优化：权限管理使权限控制更细致\n 20、修复：老浏览器访问后台部分页面显示异常问题\n 21、修复：PC端显示代理分站设置的SVIP套餐问题\n 22、修复：分站海报左侧预览设置后没有实时显示\n 23、修复：分站推广海报生成缓存问题\n 24、修复：用户提现列表搜索功能异常\n 25、修复：腾讯云存储素材删除失败问题\n 温馨提示：本次更新微信小程序需要重新提交代码提审，PC端配置需要在后台点击垃圾桶图标清除缓存，定制版本的客户请勿更新', '', '5.0.15', '1734952138', '1743057617');

-- ----------------------------
-- Table structure for zp_video_course
-- ----------------------------
DROP TABLE IF EXISTS `zp_video_course`;
CREATE TABLE `zp_video_course` (
   `id` int(11) NOT NULL AUTO_INCREMENT,
   `title` varchar(150) DEFAULT NULL COMMENT '课程标题',
   `thumb` varchar(128) DEFAULT NULL COMMENT '封面图',
   `url` varchar(255) DEFAULT NULL COMMENT '课程地址',
   `desc` varchar(255) DEFAULT NULL COMMENT '简介',
   `rid` int(11) DEFAULT NULL COMMENT '资源ID',
   `times` varchar(24) DEFAULT NULL COMMENT '时长',
   `is_try` tinyint(1) DEFAULT '0' COMMENT '是否试看',
   `indexid` int(11) DEFAULT NULL COMMENT '排序',
   `ctime` int(11) DEFAULT NULL,
   PRIMARY KEY (`id`),
   KEY `idx_rid` (`rid`),
   KEY `union_whre` (`rid`,`indexid`,`id`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COMMENT='视频课程';

-- ----------------------------
-- Records of zp_video_course
-- ----------------------------

-- ----------------------------
-- Table structure for zp_view_log
-- ----------------------------
DROP TABLE IF EXISTS `zp_view_log`;
CREATE TABLE `zp_view_log` (
       `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
       `admin_id` int(10) unsigned DEFAULT '0' COMMENT '所属代理ID',
       `rid` int(10) unsigned DEFAULT '0' COMMENT '资源ID',
       `type` tinyint(3) unsigned DEFAULT '0' COMMENT '1、视频章节，2音频章节，3小说章节',
       `cid` int(10) unsigned DEFAULT '0' COMMENT '章节ID关联章节表',
       `uid` int(10) unsigned DEFAULT '0' COMMENT '用户ID',
       `nums` int(10) unsigned DEFAULT '0' COMMENT '观看次数',
       `status` tinyint(3) unsigned DEFAULT '0' COMMENT '浏览状态，1浏览完成，0未浏览完',
       `utime` int(10) unsigned DEFAULT '0' COMMENT '更新时间',
       `ctime` int(10) unsigned DEFAULT '0' COMMENT '记录时间',
       PRIMARY KEY (`id`),
       KEY `idx_where` (`rid`,`type`,`cid`) USING BTREE,
       KEY `idx_rid` (`rid`) USING BTREE
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb4 COMMENT='章节播放记录';

-- ----------------------------
-- Table structure for zp_wechat_key
-- ----------------------------
DROP TABLE IF EXISTS `zp_wechat_key`;
CREATE TABLE `zp_wechat_key` (
     `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
     `name` varchar(258) DEFAULT NULL COMMENT '名称',
     `type` varchar(16) DEFAULT NULL COMMENT '消息类型：text,image,video,voice,news',
     `content` text COMMENT '消息内容',
     `status` tinyint(2) unsigned DEFAULT '1' COMMENT '状态：1启用：禁用',
     `utime` int(10) unsigned DEFAULT '0',
     `ctime` int(10) unsigned DEFAULT '0',
     PRIMARY KEY (`id`),
     KEY `idx_type` (`type`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COMMENT='微信公众号关键字回复';

-- ----------------------------
-- Table structure for zp_wechat_rece
-- ----------------------------
DROP TABLE IF EXISTS `zp_wechat_rece`;
CREATE TABLE `zp_wechat_rece` (
      `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
      `type` varchar(16) DEFAULT NULL COMMENT '消息类型：text,image,video,voice,news',
      `content` text COMMENT '消息内容',
      `status` tinyint(2) unsigned DEFAULT '1' COMMENT '状态：1启用：禁用',
      `utime` int(10) unsigned DEFAULT '0',
      `ctime` int(10) unsigned DEFAULT '0',
      PRIMARY KEY (`id`),
      KEY `idx_type` (`type`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COMMENT='微信公众号收到消息回复';

-- ----------------------------
-- Table structure for zp_wechat_sub
-- ----------------------------
DROP TABLE IF EXISTS `zp_wechat_sub`;
CREATE TABLE `zp_wechat_sub` (
     `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
     `type` varchar(16) DEFAULT NULL COMMENT '消息类型：text,image,video,voice,news',
     `content` text COMMENT '消息内容',
     `status` tinyint(2) unsigned DEFAULT '1' COMMENT '状态：1启用：禁用',
     `utime` int(10) unsigned DEFAULT '0',
     `ctime` int(10) unsigned DEFAULT '0',
     PRIMARY KEY (`id`),
     KEY `idx_type` (`type`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COMMENT='微信公众号关注回复';